{"'{0}' used in {1} filters/{0} is a column name and {1} is a number greater than 1, e.g. 'Sales' used in 5 filters. Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"\"{0}\" usati in {1} filtri","- read only":"- di sola lettura","--":"--",".NET acquire did not return a valid result!/The command 'dotnet.acquire' did not return a valid result.":"L'acquisizione .NET non ha restituito un risultato valido.",".NET is required for this feature.":"Per questa funzionalità è necessario .NET.","1 FILTER/'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"1 FILTRO","1 SORT/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"1 ORDINAMENTO","1 aggregation":"1 aggregazione","1 condition/'condition' is referring to a condition used in a filter to remove data from a column.":"1 condizione","1 filter":"1 filtro","1 filter with {1} conditions":"1 filtro con {1} condizioni","1 group":"1 gruppo","1 group with {0} sub-groups":"1 gruppo con {0} sottogruppi","1 missing package is required to run Data Wrangler in the selected runtime/'package' in the software sense, as for example: a Python package like numpy, pandas, or matplotlib":"Per eseguire Data Wrangler nel runtime selezionato è necessario 1 pacchetto mancante","1 sort/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"1 ordinamento","25th percentile":"25° percentile","75th percentile":"75° percentile","<a>Choose an operation</a> to get started/{Locked=\"<a>\"}{Locked=\"</a>\"}'operation' refers to a data operation to be performed on a data table.":"Per iniziare, <a>scegliere un'operazione</a>","A crashed paper plane./This is an image description for accessibility.":"Aeroplanino di carta caduto.","A previous step is currently selected. Applying operations will overwrite the existing step./'operation' refers to a data operation to be performed on a data table.":"È attualmente selezionato un passaggio precedente. L'applicazione delle operazioni sovrascriverà il passaggio esistente.","Accept preview":"Accettare anteprima","Activating Jupyter extension":"Attivazione dell'estensione Jupyter in corso","Add a new kernel/'kernel' in the sense 'Jupyter kernel'.":"Aggiungi un nuovo kernel","Add aggregation":"Aggiungi aggregazione","Add column":"Aggiungi colonna","Add condition":"Aggiungi condizione","Add filter":"Aggiungi filtro","Add filter/Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"Aggiungi filtro","Add group":"Aggiungi gruppo","Add sort/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Aggiungi ordinamento","Add sub-group":"Aggiungere sottogruppo","Add/Clicking this button will add a new sub-group to the UI.":"Aggiungi","Additional columns":"Colonne aggiuntive","Advanced statistics/'statistics' is meant as the plural of 'statistic' (definition: 'a numerical fact or datum, especially one computed from a sample.'). Namely, statistics such as the mean, median, average, min, max of a set of numbers. It is NOT meant as Statistics, the name of the field of study.Advanced statistics are statistics that are less known, such as skewness, kurtosis.":"Statistiche avanzate","Aggregation type":"Tipo di aggregazione","Aggregations":"Aggregazioni","All column types must be the same type for this operation":"Tutti i tipi di colonna devono essere dello stesso tipo per questa operazione","All files":"Tutti i file","All values are true":"Tutti i valori sono vero","An unknown error occurred.":"Si è verificato un errore sconosciuto.","And":"E","Any value is true":"Qualsiasi valore è vero","Apache Parquet files":"File Apache Parquet","Apply":"Applica","Apply operation":"Applica operazione","Are you sure you want to discard your code changes?":"Annullare le modifiche al codice?","Arithmetic by example/This is the name of a data operation where the user provides examples of the output of a mathematical operation, and the program infers what the operation is and applies it to the rest of the data column.":"Operazione aritmetica in base all’esempio","Ascending/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Crescente","Ascending/Whether data is sorted in ascending order or descending.":"Crescente","At least one option must be selected.":"È necessario selezionare almeno un'opzione.","Author":"Autore","Automatically create a column when a pattern is detected from the examples you provide. Powered by Microsoft Flash Fill.":"Crea automaticamente una colonna quando viene rilevato un criterio dagli esempi forniti. Con tecnologia Microsoft Flash Fill.","Automatically perform DateTime formatting when a pattern is detected from the examples you provide. Powered by Microsoft Flash Fill./Here, 'perform DateTime formatting' means taking a DateTime-type value and converting it to a string with a specific format. For example, '2023-09-21 3:00PM' or '21/09/2023 15h00'.":"Esegue automaticamente la Formattazione Data/ora quando viene rilevato un criterio dagli esempi forniti dall'utente. Con tecnologia Microsoft Flash Fill.","Automatically perform arithmetic when a pattern is detected from the examples you provide. Powered by Microsoft Flash Fill.":"Esegue automaticamente operazioni aritmetiche quando viene rilevato un criterio dagli esempi forniti dall'utente. Con tecnologia Microsoft Flash Fill.","Automatically perform string transformations when a pattern is detected from the examples you provide. Powered by Microsoft Flash Fill.":"Esegue automaticamente trasformazioni di stringhe quando viene rilevato un criterio dagli esempi forniti dall'utente. Con tecnologia Microsoft Flash Fill.","Back to all operations":"Torna a tutte le operazioni","Back to current operation":"Torna all'operazione corrente","Back to results":"Torna ai risultati","Bar chart with 1 bar.":"Grafico a barre con 1 barra.","Bar chart with {0} bars.":"Grafico a barre con {0} barre.","Bar chart with {0} data series.":"Grafico a barre con {0} serie di dati.","Bin frequencies":"Frequenze bin","Bin ranges":"Intervalli bin","Boolean values":"Valori booleani","Calculate text length":"Calcolare la lunghezza del testo","Calculated text length from column: {0}":"Lunghezza del testo calcolato dalla colonna: {0}","Can you please take a minute to tell us about your experience with Data Wrangler in VS Code?/{Locked=\"Data Wrangler\"}":"È possibile fornire informazioni sull'esperienza con Data Wrangler in VS Code?","Cancel":"Annulla","Cannot install dependencies without installer, aborting./The installer is required in order to install dependencies.":"Non è possibile installare le dipendenze senza il programma di installazione. Interruzione in corso.","Cannot move first item up":"Non è possibile spostare il primo elemento verso l'alto","Cannot move last item down":"Non è possibile spostare verso il basso l'ultimo elemento","Cannot perform this action while previewing. Please commit or discard the operation first./'while previewing' here refers to 'while previewing an operation'.'operation' refers to a data operation on a data table.":"Non è possibile eseguire questa azione durante l'anteprima. Eseguire prima il commit o rimuovere l'operazione.","Cannot perform this action with committed operations./Meaning: The button that the user is trying to press (namely, the 'Reload data' button) is disabled, because once the data table has had operations committed on it, the user is no longer allowed to perform a data reload, so the button becomes disabled.":"Non è possibile eseguire questa azione con le operazioni di cui è stato eseguito il commit.","Cannot select all with different column types/Meaning: cannot do 'Select all' action when the table has different types of columns. i.e, columns with different data types":"Non è possibile selezionare tutte le colonne con tipi di colonna diversi","Cannot select target '{0}'. {1}.":"Non è possibile selezionare la destinazione \"{0}\". {1}.","Capitalize all words/Capitalize the first letter of every word in a string (e.g., 'hello world' becomes 'Hello World'). When this toggle is off, only the first word is capitalized (e.g., 'Hello world').":"Converti in maiuscolo tutte le parole","Capitalize first character/For example, with this action the text 'hello' would become 'Hello'.":"Scrivere in lettera maiuscola il primo carattere","Capitalize the first character in column: {0}":"Scrivere in lettera maiuscola il primo carattere nella colonna: {0}","Capitalize the first character in columns: {0}":"Scrivere in lettera maiuscola il primo carattere nelle colonne: {0}","Case insensitive":"Nessuna distinzione tra maiuscole e minuscole","Case sensitive":"Distinzione maiuscole/minuscole","Cell generated by Data Wrangler./Cell refers to a code cell in a Jupyter Notebook.":"Cella generata da Data Wrangler.","Change column type":"Cambia tipo di colonna","Change column type to {1} for column: {0}":"Cambiare il tipo di colonna in {1} per la colonna: {0}","Change column type to {1} for columns: {0}":"Cambiare il tipo di colonna in {1} per le colonne: {0}","Change the data type of the targeted columns.":"Modificare il tipo di dati delle colonne di destinazione.","Change the name of the target column.":"Cambiare il nome della colonna di destinazione.","Choose a column to reveal/After the user chooses a data column from a list of column names, the column will be revealed, in the sense that the data table will scroll horizontally until the chosen column is visible on the screen.":"Scegli una colonna da rivelare","Choose a connection method":"Scegliere un metodo di connessione","Choose a kernel to use with Data Wrangler/'kernel' in the sense 'Jupyter kernel'.":"Scegliere un kernel da usare con Data Wrangler","Choose a runtime":"Scegliere un runtime","Choose a runtime for Data Wrangler":"Scegliere un runtime per Data Wrangler","Choose an export engine/'export engine' is an engine that exports code targeted at a certain code framework. For example, targeted at Pandas or PySpark.":"Scegliere un motore di esportazione","Choose an operation to generate preview":"Scegliere un'operazione per generare l'anteprima","Choose column/'column' as in a column of a data table":"Scegli colonna","Choose file...":"Scegli file...","Clean and edit your data with built-in operations/'built-in' in the sense that the data operations already come available in our software, ready to use. This is in contrast with custom operations where the user writes custom code to apply their own data operations.":"Pulisci e modifica i dati con le operazioni predefinite","Cleaning steps/Denotes a list of sequential steps that were taken to clean a data table, such as first sorting, then filling in missing values, etc.":"Passaggi di pulizia","Clear all":"Cancella tutto","Clear all filters for column/Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"Cancella tutti i filtri per la colonna","Click to choose runtime":"Fare clic per scegliere il runtime","Click to show Data Wrangler telemetry data":"Fare clic per visualizzare i dati di telemetria di Data Wrangler","Clone column":"Clona colonna","Clone column {0} as {1}":"Clona colonna {0}come {1}","Close":"Chiudi","Code copied to clipboard./'Code' meaning computer code.":"Codice copiato negli Appunti.","Code execution failed":"Non è stato possibile eseguire il codice","Code execution failed for operation '{operationName}'\r\n\r\n{innerErrorMessage}/'operation' in the sense: an operation on a data table.":"L'esecuzione del codice non è riuscita per l'operazione '{operationName}'\r\n\r\n{innerErrorMessage}","Code generated - manual preview required":"Codice generato: è necessaria l'anteprima manuale","Code generation failed":"Generazione codice non riuscita","Code generation failed for operation '{operationName}'\r\n\r\n{innerErrorMessage}/'operation' in the sense: an operation on a data table.":"La generazione del codice non è riuscita per l'operazione '{operationName}'\r\n\r\n{innerErrorMessage}","Code preview/It refers to a preview display of the computer code that will be executed.":"Anteprima codice","Column added":"Colonna aggiunta","Column formula":"Formula della colonna","Column name":"Nome colonna","Column name prefix":"Prefisso nome della colonna","Column removed":"Colonna rimossa","Column to aggregate":"Colonna da aggregare","Column {0} already exists. Please choose a different name.":"La colonna {0} esiste già. Scegliere un altro nome.","Columns":"Colonne","Columns to group by":"Colonne da raggruppare per","Committing operation/'operation' in the sense: an operation on a data table.":"Esecuzione del commit dell'operazione","Condition":"Condizione","Connect using Jupyter URL and token/Under this connection method, the user would provide a Jupyter URL and a Jupyter token to connect to a Jupyter server.":"Connetti tramite l'URL e il token Jupyter","Connect using local Python interpreter":"Connetti tramite interprete Python locale","Connecting to runtime...":"Connessione al runtime in corso...","Contains":"Contiene","Convert text to lowercase":"Converti testo in minuscolo","Convert text to lowercase in a text column.":"Convertire il testo in minuscolo in una colonna di testo.","Convert text to lowercase in column: {0}":"Converti testo in minuscolo nella colonna: {0}","Convert text to lowercase in columns: {0}":"Converti testo in minuscolo nelle colonne: {0}","Convert text to uppercase":"Converti testo in maiuscolo","Convert text to uppercase in a text column.":"Convertire il testo in maiuscolo in una colonna di testo.","Convert text to uppercase in column: {0}":"Converti testo in maiuscolo nella colonna: {0}","Convert text to uppercase in columns: {0}":"Converti testo in maiuscolo nelle colonne: {0}","Converted to editing mode. Do you want Data Wrangler to open in editing mode by default?":"Convertito in modalità di modifica. Aprire Data Wrangler in modalità di modifica per impostazione predefinita?","Converts the first character to uppercase and the remaining to lowercase.":"Converte il primo carattere in maiuscolo e i rimanenti in minuscolo.","Copied cell to clipboard!/Meaning: The contents of a cell in a data grid were copied to clipboard.":"La cella è stata copiata negli Appunti.","Copied row selection to clipboard!/Meaning: The contents of user-selected rows in a data grid were copied to clipboard.":"La selezione delle righe è stata copiata negli Appunti.","Copy all code/Meaning: Copy all code to clipboardThis localization string is a button label on our toolbar, so please make it as short, simple, and easy to understand as possible.":"Copia tutto il codice","Copy cell":"Copia cella","Copy code to clipboard":"Copia il codice negli Appunti","Copy row":"Copia riga","Copy rows":"Copia righe","Could not convert to the specified bits for type":"Non è stato possibile eseguire la conversione nei bit specificati per il tipo","Could not convert to unsigned type, instead converted to a signed type":"Non è stato possibile eseguire la conversione in un tipo non firmato, ma è stato convertito in un tipo firmato","Could not find an active notebook. Please try again later./'notebook' in the sense 'Jupyter notebook'.":"Non è stato possibile trovare un blocco appunti attivo. Riprovare più tardi.","Could not find connection object for kernel/'kernel' in the sense 'Jupyter kernel'.":"Impossibile trovare l'oggetto connessione per il kernel","Could not find sample extension.":"L'estensione di esempio non è stata trovata.","Could not find the PROSE DLL file!/{Locked=\"PROSE\"}A \"DLL file\" is a file with extension .dll":"Impossibile trovare il file DLL PROSE.","Could not get .NET dependency.":"Impossibile ottenere la dipendenza .NET.","Could not get Jupyter extension":"Non è stato possibile ottenere l'estensione Jupyter","Could not get current stack focus. This likely means that the Data Wrangler extension is not compatible with the VS Code version. Please file an issue on the Data Wrangler GitHub repository.":"Impossibile ottenere il focus sullo stack corrente. Ciò significa probabilmente che l'estensione Data Wrangler non è compatibile con l'estensione VS Code. Caricare un problema nel repository GitHub Data Wrangler.","Could not get debugger capabilities.":"Impossibile ottenere le funzionalità del debugger.","Could not get kernel from Jupyter extension. This likely means that the Data Wrangler extension is not compatible with the Jupyter extension. Please file an issue on the Data Wrangler GitHub repository.":"Could not get kernel from Jupyter extension. This likely means that the Data Wrangler extension is not compatible with the Jupyter extension. Please file an issue on the Data Wrangler GitHub repository.","Could not get kernel service from Jupyter extension. This likely means that the Data Wrangler extension is not compatible with the Jupyter extension. Please file an issue on the Data Wrangler GitHub repository.":"Non è stato possibile ottenere il servizio kernel dall'estensione Jupyter. Ciò significa probabilmente che l'estensione Data Wrangler non è compatibile con l'estensione Jupyter. Caricare un problema nel repository GitHub Data Wrangler.","Could not get kernel service/'kernel' in the sense 'Jupyter kernel'.":"Non è stato possibile ottenere il servizio kernel","Could not resolve the .NET path!/'.NET path' in the sense, the local file path to where .NET is installed.":"Non è stato possibile risolvere il percorso .NET!","Could not retrieve variable {dwVariable} from the Jupyter extension. Please file an issue on the Data Wrangler GitHub repository.":"Non è stato possibile recuperare la variabile {dwVariable} dall'estensione Jupyter. Caricare un problema nel repository GitHub Data Wrangler.","Could not set up {installerName} using the following command: {errorMessage}":"Impossibile configurare {installerName} utilizzando il comando seguente: {errorMessage}","Could not set up {installerName}.\r\n\r\n{errorName}: {errorMessage}":"Non è stato possibile configurare {installerName}.\r\n\r\n{errorName}: {errorMessage}","Could not set up {installerName}. Setup was canceled by user.":"Non è stato possibile configurare {installerName}. La configurazione è stata annullata dall'utente.","Could not update data frame: {errorMessage}":"Non è stato possibile aggiornare il frame di dati: {errorMessage}","Could not use {installerName} to install packages. Would you like to set it up?":"Non è stato possibile usare {installerName} per installare i pacchetti. Si vuole eseguire la configurazione?","Couldn't find kernel with ID: {kernelId}/'kernel' in the sense 'Jupyter kernel'.":"Impossibile trovare il kernel con ID: {kernelId}","Couldn't get kernel/'kernel' in the sense 'Jupyter kernel'.":"Non è stato possibile ottenere il kernel","Count":"Numero","Count/Label for the count of items in a histogram bin. Used as a label when hovering over a bar in the graph.":"Numero","Create column from formula":"Creare una colonna dalla formula","Create new column with values equal to the length of each string value in a text column.":"Creare una nuova colonna con valori uguali alla lunghezza di ogni valore stringa in una colonna di testo.","Created column {0} from formula":"Colonna {0} creata dalla formula","Creates a column using a custom Python formula. This can include any expression using other columns and custom lambdas.":"Crea una colonna usando una formula Python personalizzata. Ciò può includere qualsiasi espressione che usa altre colonne e espressioni lambda personalizzate.","Creates a copy of a column.":"Crea una copia di una colonna.","Custom operation":"Operazione personalizzata","Custom value":"Valore personalizzato","DW telemetry/DW stands for Data Wrangler":"Telemetria DW","DW: error/DW stands for Data Wrangler":"DW: errore","DW: {durationInSeconds}s/DW stands for Data Wrangler.The s is short for seconds.":"DW: {durationInSeconds}s","Data Array (Xarray)":"Matrice di dati (Xarray)","Data Summary":"Riepilogo dati","Data Wrangler is currently in editing mode. To enter the viewing-optimized mode, select \"Viewing\" from the rightmost dropdown in the toolbar. You can also configure the default mode in the Visual Studio Code settings for notebook entrypoints./'notebook' in the sense of a Jupyter notebook.":"Data Wrangler è attualmente in modalità di modifica. Per attivare la modalità ottimizzata per la visualizzazione, selezionare \"Visualizzazione\" dall'elenco a discesa più a destra nella barra degli strumenti. È anche possibile configurare la modalità predefinita nelle impostazioni Visual Studio Code per i punti di ingresso del blocco appunti.","Data Wrangler is currently in viewing mode. To clean or edit the data, select \"Editing\" from the rightmost dropdown in the toolbar. You can also configure the default mode in the Visual Studio Code settings for notebook entrypoints./'notebook' in the sense of a Jupyter notebook.":"Data Wrangler è attualmente in modalità di visualizzazione. Per pulire o modificare i dati, selezionare \"Modifica\" dall'elenco a discesa più a destra nella barra degli strumenti. È anche possibile configurare la modalità predefinita nelle impostazioni Visual Studio Code per i punti di ingresso del blocco appunti.","Data Wrangler may be unresponsive while debugging":"Data Wrangler potrebbe non rispondere durante il debug","Data Wrangler requires a newer version of the {packageName} package to view data.":"Data Wrangler richiede una versione più recente del pacchetto di {packageName} per visualizzare i dati.","Data Wrangler requires the following packages to view data: {packageNames}/'packages' meaning software packages.":"Data Wrangler per visualizzare i dati sono necessari i pacchetti seguenti: {packageNames}","Data Wrangler requires the {packageName} package to view data.":"Data Wrangler richiede il pacchetto di {packageName} per visualizzare i dati.","Data Wrangler was started in viewing mode because it was launched from a debugger context.":"Data Wrangler è stato avviato in modalità di visualizzazione perché è stato avviato da un contesto del debugger.","Data Wrangler: Editing":"Data Wrangler: modifica","Data Wrangler: Viewing":"Data Wrangler: visualizzazione","Data frame loaded":"Frame di dati caricato","Data grid":"Griglia dati","Data is unchanged":"I dati sono invariati","Data is unchanged. Did you forget to modify the {0} variable?":"I dati non sono stati modificati. Hai dimenticato di modificare la variabile {0}?","Data must be loaded first./This precondition must be met before the user is allowed to perform the action he or she is trying to do.":"È prima necessario caricare i dati.","Data ranges from {0} to {1}.":"Intervalli di dati da {0} a {1}.","Data shape":"Forma dei dati","Data type":"Tipo di dati","Data viewer":"Data viewer","Data viewer preview/This text is a human-readable name for the preview of an operation performed from the data viewer, such as filtering or sorting data. This can show up if the user encounters an error, e.g. 'Operation failed: Data viewer preview'.":"Anteprima visualizzatore dati","Data was loaded with truncation enabled. Statistics may not reflect the full data.":"I dati sono stati caricati con il troncamento abilitato. Le statistiche potrebbero non riflettere i dati completi.","DataFrame (Pandas)":"DataFrame (Pandas)","DataFrame (Polars)":"DataFrame (polari)","DataFrame (PySpark)":"DataFrame (Pyspark)","DateTime formatting by example/This is the name of a data operation where the user provides examples of how they want the DateTimes in a data column to be formatted (for example, '2023-09-21 3:00PM', or '21/09/2023 15h00'), and the program applies this formatting that matches the examples provided.":"Formattazione Data/ora in base all'esempio","Debugger does not support required capabilities to launch viewer (missing = {missingCapabilities}). Please file an issue on the Data Wrangler GitHub repository with more details on your debugging environment.":"Il debugger non supporta le funzionalità necessarie per avviare il visualizzatore (mancante = {missingCapabilities}). Caricare un problema nel repository GitHub Data Wrangler con altri dettagli sull'ambiente di debug.","Delete":"Elimina","Delete condition":"Elimina condizione","Delete filter group":"Elimina gruppo di filtri","Delimited text files":"File di testo delimitati","Delimiter":"Delimitatore","Derive column {1} from column: {0}/{1} is the name of the new column that is derived from column {0}":"Deriva colonna {1} dalla colonna: {0}","Derive column {1} from columns: {0}/{1} is the name of the new column that is derived from column {0}":"Deriva colonna {1} dalle colonne: {0}","Derived column name":"Nome colonna derivata","Descending/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Decrescente","Descending/Whether data is sorted in ascending order or descending.":"Decrescente","Description":"Descrizione","Dictionary":"Dizionario","Did not receive notebook URI from Jupyter extension. This likely means that the Data Wrangler extension is not compatible with the Jupyter extension. Please file an issue on the Data Wrangler GitHub repository.":"Non è stato ricevuto un URI del notebook dall'estensione Jupyter. Ciò significa probabilmente che l'estensione Data Wrangler non è compatibile con l'estensione Jupyter. Caricare un problema nel repository GitHub Data Wrangler.","Discard":"Rimuovi","Discard/This refers to discarding code changes.":"Rimuovi","Discarding operation/'operation' in the sense: an operation on a data table.":"Eliminazione dell'operazione","Disconnected from notebook kernel. Please re-open the viewer.":"Disconnesso dal kernel del notebook. Riaprire il visualizzatore.","Discovering kernels/'kernel' in the sense 'Jupyter kernel'.":"Individuazione dei kernel","Dismiss":"Chiudi","Distinct values/Count of values that are different from each other in a data column.":"Valori distinti","Distinct/Label for the count of values that are different from each other in a data column.":"Distinto","Does not contain":"Non contiene","Don't ask again/This is a possible answer to the question \"Do you want Data Wrangler to open in editing mode by default?\"":"Non chiedere più","Don't ask again/This is a possible answer to the question \"Would you like to make Data Wrangler the default editor?\"":"Non chiedere più","Don't show again":"Non visualizzare più questo messaggio","Draggable":"Trascinabile","Draggable item from index {0} was dropped./{0} is a number, e.g. 5":"L'elemento trascinabile dall'indice {0} è stato eliminato.","Draggable item is no longer over a droppable area.":"L'elemento trascinabile non si trova più in un'area di rilascio.","Dragged item over droppable area at index {0}./{0} is a number, e.g. 5":"Elemento trascinato nell'area di rilascio in corrispondenza dell'indice {0}.","Dragging was cancelled. Draggable item from index {0} was dropped./{0} is a number, e.g. 5":"Il trascinamento è stato annullato. L'elemento trascinabile dall'indice {0} è stato eliminato.","Drop column: {0}":"Elimina la colonna: {0}","Drop columns/'Drop' meaning 'Delete', but we're using the word 'Drop' here because it's a more common term in data science for this type of operation.":"Elimina colonne","Drop columns: {0}":"Rimuovi colonne: {0}","Drop duplicate rows across all columns":"Elimina righe duplicate in tutte le colonne","Drop duplicate rows in column: {0}":"Rimuovere righe duplicate nella colonna: {0}","Drop duplicate rows in columns: {0}":"Rimuovere righe duplicate nelle colonne: {0}","Drop duplicate rows/'Drop' meaning 'Delete', but we're using the word 'Drop' here because it's a more common term in data science for this type of operation.":"Eliminare le righe duplicate","Drop missing values/'Drop' meaning 'Delete', but we're using the word 'Drop' here because it's a more common term in data science for this type of operation.":"Eliminare i valori mancanti","Drop rows with missing data across all columns":"Rimuovi righe con dati mancanti in tutte le colonne","Drop rows with missing data in column: {0}":"Rimuovere le righe con dati mancanti nella colonna: {0}","Drop rows with missing data in columns: {0}":"Rimuovere le righe con dati mancanti nelle colonne: {0}","Drop rows with missing values in the targeted columns.":"Rilasciare le righe con valori mancanti nelle colonne di destinazione.","Drops duplicate rows. Duplicate rows are identified using the selected columns only.":"Elimina le righe duplicate. Le righe duplicate vengono identificate solo usando le colonne selezionate.","Duplicate rows":"Duplica righe","Eager Tensor":"Eager Tensor","Edit failed":"Modifica non riuscita","Edit loading parameters/Meaning: edit the parameters of the data loading process.":"Modifica parametri di caricamento","Edit was successful":"La modifica è stata completata","Editing":"Modifica","Editing previous operation":"Modifica dell'operazione precedente","Encode missing values":"Codifica valori mancanti","End of interactive chart.":"Fine del grafico interattivo.","Ends with":"Termina con","Enter a datetime string/A date time value, or DateTime value, represents a point in time, and it includes both a date and a time.":"Enter a datetime string","Enter an example":"Immetti un esempio","Equal to":"Uguale a","Equivalent translation for type '{0}' does not exist":"La traduzione equivalente per il tipo '{0}' non esiste","Error ({originalEditorTitle})":"Errore ({originalEditorTitle})","Error details":"Error details","Error: See code panel for details.":"Errore: per i dettagli, vedere il pannello del codice.","Examples":"Esempi","Excel files":"File di Excel","Executing performance tests":"Esecuzione dei test delle prestazioni","Expected {0} to be a DataFrame, but got: {1}":"Era previsto {0} come DataFrame, ma è stato ottenuto: {1}","Export as file/This localization string is a button label on our toolbar, so please make it as short, simple, and easy to understand as possible.":"Esporta come file","Export as...":"Esporta come...","Export code as new Notebook/'Notebook' refers to a computational notebook, such as to a Jupyter Notebook.":"Esporta il codice come nuovo blocco appunti","Export code back to Notebook and exit/'Notebook' refers to a computational notebook, such as to a Jupyter Notebook.":"Esporta di nuovo il codice nel blocco appunti ed esci","Export to notebook/Meaning: to export the code to a computational notebook (such as to a Jupyter Notebook).This localization string is a button label on our toolbar, so please make it as short, simple, and easy to understand as possible.":"Genera script nel notebook","Exported code may not be executable since we are working with a variable in local scope.":"Il codice esportato potrebbe non essere eseguibile perché è in uso una variabile nell'ambito locale.","Exporting to Parquet format requires the pyarrow package. Would you like to install it?":"L'esportazione in formato Parquet richiede il pacchetto pyarrow. Installarla?","Exporting {formatName} file.../{formatName} is the name of the file format like 'CSV' or 'Parquet'":"Esportazione del file {formatName}...","Failed to derive a program for the given examples.":"Impossibile derivare un programma per gli esempi forniti.","Failed to execute code on kernel session/'kernel' in the sense 'Jupyter kernel'.":"Non è stato possibile eseguire il codice nella sessione del kernel","Failed to export code: {innerErrorMessage}/'code' meaning computer code.":"Non è stato possibile esportare il codice: {innerErrorMessage}","Failed to export data: {innerErrorMessage}":"Non è stato possibile esportare i dati: {innerErrorMessage}","Failed to fetch file from GitHub. Please note that private repositories are currently not supported./{Locked=\"GitHub\"}":"Non è stato possibile recuperare il file dal GitHub. Si noti che i repository privati non sono attualmente supportati.","Failed to install '{packageNamesWithVersions}'.":"Non è stato possibile installare '{packageNamesWithVersions}'.","Failed to install '{packageNamesWithVersions}'.\r\n\r\n{errorName}: {errorMessage}":"Non è stato possibile installare '{packageNamesWithVersions}'.\r\n\r\n{errorName}: {errorMessage}","Failed to install {packageNamesWithVersions} using the following command: {errorMessage}.":"Impossibile installare {packageNamesWithVersions} utilizzando il comando seguente: {errorMessage}.","Failed to install {packageNamesWithVersions} using the following command: {errorMessage}. Install was canceled by user.":"Impossibile installare {packageNamesWithVersions} utilizzando il comando seguente: {errorMessage}. L'installazione è stata annullata dall'utente.","Failed to launch kernel./'kernel' in the sense 'Jupyter kernel'.":"Non è stato possibile avviare il kernel.","Failed to load data":"Non è stato possibile caricare i dati","Failed to load the data frame: {errorMessage}":"Non è stato possibile caricare il frame di dati: {errorMessage}","Failed to load the data frame: {innerErrorMessage}":"Non è stato possibile caricare il frame di dati: {innerErrorMessage}","Failed to preview operation\r\n\r\n{innerErrorMessage}/'operation' is an operation on a data table.":"Non è stato possibile visualizzare l'anteprima dell'operazione\r\n\r\n{innerErrorMessage}","Failed to preview operation/'operation' is an operation on a data table.":"Non è stato possibile visualizzare l'anteprima dell'operazione","Failed to translate the derived program to the target language.":"Impossibile convertire il programma derivato nel linguaggio di destinazione.","Failed to update data frame: {innerErrorMessage}":"Non è stato possibile aggiornare il frame di dati: {innerErrorMessage}","False":"False","Fetching kernel specifications/'kernel' in the sense 'Jupyter kernel'.":"Recupero delle specifiche del kernel","Fetching kernel version information/'kernel' in the sense 'Jupyter kernel'.":"Recupero delle informazioni sulla versione del kernel","File Type for Export/File type (e.g., CSV or Parquet) to use for exporting data to a file. This is the title of a quick pick dialog.":"Tipo di file per l'esportazione","File path":"Percorso file","Fill method":"Metodo riempimento","Fill missing values":"Compilare i valori mancanti","Fill missing values in the targeted columns.":"Riempire i valori mancanti nelle colonne di destinazione.","Filter":"Applicare il filtro","Filter order: {0} of {1}/{0} and {1} are both numbers, e.g. Filter order 2 of 5. Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"Ordine filtro: {0} di {1}","Filter rows based on column: {0}":"Filtra righe in base alla colonna: {0}","Filter rows based on columns: {0}":"Filtra righe in base alle colonne: {0}","Filters":"Filtri","Filters ({numberOfFilters})":"Filtri ({numberOfFilters})","Filters rows based on one or more conditions.":"Filtra le righe in base a una o più condizioni.","Find and replace":"Trova e sostituisci","First value":"Primo valore","Format":"Formato","Formulas":"Formule","Frequency":"Frequenza","Gathering diagnostic information":"Recupero delle informazioni di diagnostica","Generating code/'code' meaning computer code.":"Generazione codice in corso...","Getting Jupyter kernel service":"Recupero del servizio kernel Jupyter","Go to column/Meaning: jump to a certain column in a data table by scrolling the table horizontally until the specified column is in view.This localization string is a button label on our toolbar, so please make it as short, simple, and easy to understand as possible.":"Vai alla colonna","Greater than":"Maggiore di","Greater than or equal to":"Maggiore o uguale a","Grid view is limited to cached data. Reload for full preview and full summary information./'Grid view' is a panel that shows a data grid (data table).'summary' as in data summary.":"La visualizzazione Griglia è limitata ai dati memorizzati nella cache. Ricaricare per ottenere informazioni complete su anteprima e riepilogo.","Group by and aggregate/This operation groups the data frame by one or more columns and then performs an aggregation operation on the grouped data. For example, you can group by a column and then count the number of rows in each group. Or you can group by a column and then sum the values in another column for each group.":"Raggruppa per e aggrega","Group the target columns to perform aggregation operations.":"Raggruppare le colonne di destinazione per eseguire operazioni di aggregazione.","Grouped on column: {0}":"Raggruppamento effettuato in base alla colonna: {0}","Grouped on columns: {0}":"Raggruppamento effettuato in base alle colonne: {0}","Hide column insights":"Nascondi informazioni dettagliate colonna","Index of max value":"Indice del valore massimo","Index of min value":"Indice del valore minimo","Install dependencies":"Installa dipendenze","Install packages/'package' in the software sense, as for example: a Python package like numpy, pandas, or matplotlib":"Installa i pacchetti","Install {0}":"Installa {0}","Install/As a verb.":"Installa","Installed version/Lists the version of a specific software dependency that is currently installed.":"Versione installata","Installing Jupyter extension/Meaning: The Visual Studio Code extension called 'Jupyter' is being installed.":"Installazione dell'estensione Jupyter in corso","Installing Python extension (includes Jupyter extension)/Text shown with a progress bar. The Jupyter extension comes bundled with the Python extension, so if you install the Python extension, the installation wait time also includes installing the Jupyter extension.":"Installazione dell'estensione Python (include l'estensione Jupyter)","Installing {packageNames}":"Installazione {packageNames}","Interactive chart.":"Grafico interattivo.","Invalid extension exports":"Esportazioni di estensioni non valide","Is false":"È falso","Is missing":"Mancante","Is not missing":"Non è mancante","Is true":"È vero","Jupyter connection URL":"URL di connessione Jupyter","Jupyter connection token for {baseUrl}":"Token di connessione Jupyter per {baseUrl}","Jupyter extension is outdated":"L’estensione Jupyter è obsoleta","Keep matching rows/'Keep' in the sense 'Retain' (all rows not matching the filter pattern are deleted), not in the sense of 'Continue'. Matching here denotes rows that are matched by a filter pattern":"Mantieni righe corrispondenti","Keep matching rows/Meaning: Keep the rows that match the condition (and remove the ones that don't)":"Mantieni righe corrispondenti","Kernel must be connected first.":"È prima necessario connettere il kernel.","Kurtosis":"Curtosi","Last value":"Ultimo valore","Less than":"Minore di","Less than or equal to":"Minore o uguale a","Let's get you set up./This starts the process of helping the user to set up the Data Wrangler software and get it working in their computer, including installing any necessary dependencies.":"Configurazione.","List":"Elenco","Load an existing variable into Data Wrangler.":"Carica una variabile esistente in Data Wrangler.","Load data from CSV":"Caricare dati da CSV","Load data from Excel":"Caricare dati da Excel","Load data from Parquet":"Caricare dati da Parquet","Load data from variable":"Caricare dati da variabile","Loaded variable '{0}' from URI: {1}":"Caricata la variabile “{0}” dall'URI: {1}","Loaded variable '{0}' from kernel state":"Variabile caricata '{0}' dallo stato del kernel","Loaded with truncation: {rowCount} rows/'truncation' meaning that only the first {rowCount} rows of the data table were loaded. Not all the data was loaded.":"Caricato con troncamento: {rowCount} righe","Loaded {0} rows":"{0} righe caricate","Loading data frame":"Caricamento frame di dati in corso","Loading data with truncation.../'truncation' meaning that only the first n rows of the data table will be loaded. Not all the data will be loaded.":"Caricamento dei dati con troncamento in corso...","Loading data...":"Caricamento dei dati...","Loading...":"Caricamento in corso...","Loads data from a CSV or other delimited file.":"Carica i dati da un file CSV o da un altro file delimitato.","Loads data from a Parquet file.":"Carica i dati da un file Parquet.","Loads data from an Excel (XLS, XLSX) file.":"Carica i dati da un file di Excel (XLS, XLSX).","Manage all filters/Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"Gestisci tutti i filtri","Manage all sorts/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Gestisci tutti gli ordinamenti","Manage filters/'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"Gestisci filtri","Manage sorts/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Gestisci ordinamenti","Match case":"Trova corrispondenza maiuscole/minuscole","Match full string":"Corrispondenza stringa completa","Max/Short form of 'Maximum'. Indicates the biggest value in a data column.":"Max","Maximum":"Massimo","Mean/Statistics term.":"Media","Median":"Mediana","Min/Short form of 'Minimum'. Indicates the smallest value in a data column.":"Min","Minimum":"Minimo","Minimum value must be smaller than maximum value.":"Il valore minimo deve essere minore del valore massimo.","Minimum version/Lists the minimum version of a specific software package dependency that will be compatible with the program. That version and any higher (later) version will work with the program.":"Versione minima","Missing dependencies/Status message that very succinctly conveys the meaning 'There are missing Python package dependencies in the kernel' with the implication that the user can't proceed with using the extension until the required dependencies are installed. This text will sometimes be followed by the actual list of dependencies that are missing.":"Dipendenze mancanti","Missing required parameters":"Mancano i parametri obbligatori","Missing value/Placeholder text for a cell value that is missing (i.e., set to null, None, NaN, or equivalent) within a data table.":"Valore mancante","Missing values (by column)":"Valori mancanti (per colonna)","Missing values first/Meaning: When sorting rows of data, move the rows that are empty to the top.":"Prima i valori mancanti","Missing values first/Note that this is used in the context of ordering data, we put the missing entries at the top.":"Prima i valori mancanti","Missing values first/When this toggle is on, the sorting operation will place missing values at the top of the sorted list, before non-missing values.":"Prima i valori mancanti","Missing values/Count of values that are missing (i.e., set to null, None, NaN, or equivalent) in a data column.":"Valori mancanti","Missing/Label for the count of values that are missing (i.e., set to null, None, NaN, or equivalent) in a data column.":"Mancante","Mixed columns are not allowed for this operation":"Colonne miste non consentite per questa operazione","Mode/Statistics term":"Modalità","Mode/Statistics term.":"Modalità","Modified column {0} using formula":"La colonna {0} è stata modificata con la formula","Modify":"Modifica","More details":"Ulteriori dettagli","More items":"More items","More options":"Altre opzioni","More options...":"Altre opzioni...","Most common value":"Valore più comune","Most frequent value/The value that appears the most often in a data column.":"Valore più frequente","Move down in order":"Sposta verso il basso in ordine","Move up in order":"Sposta verso l'alto in ordine","Moved draggable item from index {0} to {1}./e.g. Moved draggable item from index 2 to 5.":"Elemento trascinabile spostato dall'indice {0} a {1}.","Multi-label binarizer/Terminology from the field of Machine Learning. An operation that transforms a data column into binary values using a multi-label format. This format uses a series of 1s and 0s as labels to represent the presence or absense of each of several categories in the input.":"Binarizzazione con più etichette","Multi-label encode column {0} using delimiter {1}":"Colonna con codifica con più etichette {0} tramite delimitatore {1}","Multi-label encode columns {0} using delimiter {1}":"Colonne con codifica con più etichette {0} tramite delimitatore {1}","N-Dimensional Array":"Matrice a N dimensioni","N/A/'N/A' = 'Not Applicable'. This is shown inside a table cell, so, if there's no equivalent to 'N/A' in the target language, feel free to use a dash (or equivalent) to indicate that there is no value in this cell.":"N/D","Name for new column":"Nome della nuova colonna","New column by example/This is the name of a data operation where the user provides examples of the output of a data operation, and the program infers what the operation is and applies it, creating a new column with the output.":"Nuova colonna in base all'esempio","New column name":"Nome nuova colonna","New maximum":"Nuovo massimo","New minimum":"Nuovo minimo","New operation":"Nuova operazione","New type":"Nuovo tipo","New value/The user fills in fields 'Old value' and 'New value' when doing a Find and Replace operation.":"Nuovo valore","No Jupyter connection URL received/Connecting to Jupyter requires a connection URL, which was not provided by the user":"Nessun URL di connessione Jupyter ricevuto","No Jupyter connection token received/Connecting to Jupyter requires a connection token, which was not provided by the user":"Nessun token di connessione Jupyter ricevuto","No active engine/Note that 'engine' here is referring to a code execution environment such as Pandas or PySpark.":"Nessun motore attivo","No active filter/Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"Nessun filtro attivo","No aggregations":"Nessuna aggregazione","No code exporter found":"Non è stata trovata alcuna utilità di esportazione del codice","No compatible Python interpreter found.":"Non è stato trovato alcun interprete Python compatibile.","No connection method selected":"Nessun metodo di connessione selezionato","No data exporter found":"Non è stata trovata alcuna utilità di esportazione dei dati","No engine available for translation/Note that 'engine' here is referring to a code execution environment such as Pandas or PySpark.":"Nessun motore disponibile per la traduzione","No filters":"Nessun filtro","No groups":"Nessun gruppo","No information for this package was found. Ensure the package name is correct before installing.":"Non sono state trovate informazioni per questo pacchetto. Verificare che il nome del pacchetto sia corretto prima dell'installazione.","No kernel session":"No kernel session","No kernel specs selected/'kernel' in the sense 'Jupyter kernel'.'specs' as short for 'specifications'.":"Nessuna specifica di kernel selezionata","No missing values":"Nessun valore mancante","No pattern detected from inputs.":"Nessun criterio rilevato dagli input.","No runtime connected":"Nessun runtime connesso","No sorts/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Nessun ordinamento","No translation available.":"Nessuna traduzione disponibile.","No variables found. Execute a code cell to create data variables.":"Nessuna variabile trovata. Esegue una cella di codice per creare variabili di dati.","No visualization available":"Nessuna visualizzazione disponibile","No, thanks/This is a possible response to the question \"Can you please take a minute to tell us about your experience with Data Wrangler in VS Code?\"":"No, grazie","No/Response to the question: 'Exporting to Parquet format requires the pyarrow package. Would you like to install it?'":"No","No/This is a possible answer to the question \"Would you like to install the VS Code extension(s)?\"":"No","No/This is a possible answer to the question 'Would you like to set up the installer?'":"No","No/This is a possible response to the question \"Would you like to install the .NET Installer extension to continue?\"":"No","Not equal to":"Diverso da","Note: The code below is Data Wrangler internal code.":"Nota: il codice seguente è un codice interno di Data Wrangler.","Number of decimals":"Numero di decimali","Number of digits must be a whole number.":"Il numero di cifre deve essere un numero intero.","Number of distinct values/Count of values that are different from each other in a data column.":"Numero di valori distinti","Number of rows to keep":"Numero di righe da mantenere","Numeric":"Numerico","Old value must be non-empty.":"Il valore precedente non deve essere vuoto.","Old value/The user fills in fields 'Old value' and 'New value' when doing a Find and Replace operation.":"Valore precedente","One-hot encode column: {0}/'one-hot encoding' is a technical term used in the field of Machine Learning":"Colonna di codifica one-hot: {0}","One-hot encode columns: {0}/'one-hot encoding' is a technical term used in the field of Machine Learning":"Colonne di codifica one-hot: {0}","One-hot encode/'one-hot encoding' is a technical term used in the field of Machine Learning":"Codifica one-hot","Only the most recent operation can be edited.":"È possibile modificare solo l'operazione più recente.","Only viewing is supported when debugging.":"Durante il debug è supportata solo la visualizzazione.","Open '{variableName}' in Data Wrangler":"Aprire '{variableName}' in Data Wrangler","Open Python download website/'Python download website' in the sense: the website where the users can download Python, so that they can install it on their computers.":"Apri sito Web per il download di Python","Open time picker":"Open time picker","Open variable in Data Wrangler":"Aprire variabile in Data Wrangler","Opening a dataset from a file is currently not supported in the web offering of Data Wrangler.":"L'apertura di un set di dati da un file non è attualmente supportata nell'offerta Web di Data Wrangler.","Opening files directly in Data Wrangler has limited support in the web version of Visual Studio Code. The desktop version is recommended for the best experience.":"L'apertura dei file direttamente in Data Wrangler ha un supporto limitato nella versione Web di Visual Studio Code. La versione del desktop è consigliata per un'esperienza ottimale.","Operation applied: {operationDescription}/'operation' is an operation on a data table.":"Operazione applicata: {operationDescription}","Operation preview: {operationDescription}/'operation' is an operation on a data table.":"Anteprima operazione: {operationDescription}","Operation rejected: {operationDescription}/'operation' is an operation on a data table.":"Operazione rifiutata: {operationDescription}","Operation undone: {operationDescription}/'operation' is an operation on a data table.":"Operazione annullata: {operationDescription}","Operations/It refers to operations on a data table, like sorting, filtering, deleting a column, filling in missing values, etc.":"Operazioni","Option is invalid for the selected column.":"Opzione non valida per la colonna selezionata.","Or":"O","Or, start typing code to see a live preview of the transformation on your data <ex>(e.g., <code>{exampleCode}</code>)</ex>/{Locked=\"<ex>\"}{Locked=\"</ex>\"}{Locked=\"<code>\"}{Locked=\"</code>\"}":"In alternativa, iniziare a digitare il codice per visualizzare un'anteprima dinamica della trasformazione sui dati <ex>(e.g., <code>{exampleCode}</code>)</ex>","Other":"Altro","Other/category 'Other' in a dropdown list of data operation categories":"Altro","Output/'Output' as a noun, like the output of a function or algorithm.":"Output","Package name/'package' in the software sense, as for example: a Python package like numpy, pandas, or matplotlib":"Nome pacchetto","Paused.":"In pausa.","Perform advanced filter/Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"Esegui filtro avanzato","Perform some operations on the data first./This precondition must be met before the user is allowed to perform the action he or she is trying to do.":"Eseguire prima alcune operazioni sui dati.","Performed {0} grouped on column: {1}":"Eseguita {0} raggruppata in base alla colonna: {1}","Performed {0} grouped on columns: {1}":"Eseguita {0} raggruppata in base alle colonne: {1}","Picked up draggable item from index {0}./{0} is a number, e.g. 5":"Elemento trascinabile prelevato dall'indice {0}.","Please install Python to continue. Note: Data Wrangler requires Python {minPythonVersion} or above.":"Installare Python per continuare. Nota: Data Wrangler richiede Python {minPythonVersion} o versione successiva.","Please note/This is the title of a notification message box":"Nota","Preparing":"Preparazione in corso","Preview code for all steps":"Anteprima del codice per tutti i passaggi","Preview columns cannot be targeted/'Preview' refers to a data column that has pending but yet-to-be confirmed changes.":"Le colonne dell'anteprima non possono essere specificate come destinazione","Preview paused":"Anteprima sospesa","Previewing all code steps":"Anteprima di tutti i passaggi del codice","Previewing/Status message that indicates that the program is currently showing a preview of the data.":"Anteprima","Product of all values":"Prodotto di tutti i valori","Propagate backward/Fill in missing values going backwards through the list, filling in with the previous non-missing value that was seen. e.g. [1, NaN, NaN, 2] becomes [1, 2, 2, 2]":"Propaga indietro","Propagate forward/Fill in missing values based on the previous available value and propagating it forwards. e.g. [1, NaN, NaN, 2] becomes [1, 1, 1, 2]":"Propaga avanti","Providing an edit for this cell can improve results":"L'inserimento di una modifica per questa cella può migliorare i risultati.","Python {minPythonVersion} or higher is required. Detected version: {kernelVersion}":"È necessario Python {minPythonVersion} o versione successiva. Versione rilevata: {kernelVersion}","Quit":"Esci","RPC connection not initialized/RPC = Remote Procedure Call":"Connessione RPC non inizializzata","Re-check/Meaning: check again whether a certain software dependency is now available or not yet.":"Verifica di nuovo","Re-loading data frame":"Nuovo caricamento frame di dati in corso","Received invalid notebook URI from Jupyter extension. This likely means that the Data Wrangler extension is not compatible with the Jupyter extension. Please file an issue on the Data Wrangler GitHub repository.":"È stato ricevuto un URI del notebook non valido dall'estensione Jupyter. Ciò significa probabilmente che l'estensione Data Wrangler non è compatibile con l'estensione Jupyter. Caricare un problema nel repository GitHub Data Wrangler.","Received malformed content: {0}":"Contenuto ricevuto non valido: {0}","Refresh data/This localization string is a button label on our toolbar, so please make it as short, simple, and easy to understand as possible.":"Aggiorna dati","Reload VS Code":"Reload VS Code","Reload preview":"Ricarica anteprima","Remove leading and trailing whitespace in column: {0}":"Rimuovi gli spazi vuoti iniziali e finali nella colonna: {0}","Remove leading and trailing whitespace in columns: {0}":"Rimuovi gli spazi vuoti iniziali e finali nelle colonne: {0}","Remove leading whitespace":"Rimuovi spazio vuoto iniziale","Remove leading whitespace in column: {0}":"Rimuovi lo spazio vuoto iniziale nella colonna: {0}","Remove leading whitespace in columns: {0}":"Rimuovi lo spazio vuoto iniziale nelle colonne: {0}","Remove sort/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Rimuovi ordinamento","Remove trailing whitespace":"Rimuovi lo spazio vuoto finale","Remove trailing whitespace in column: {0}":"Rimuovi lo spazio vuoto finale nella colonna: {0}","Remove trailing whitespace in columns: {0}":"Rimuovi lo spazio vuoto finale nelle colonne: {0}","Removes leading and trailing whitespace in a text column.":"Rimuove gli spazi vuoti iniziali e finali in una colonna di testo.","Removes the targeted columns from the data frame.":"Rimuove le colonne di destinazione dal frame di dati.","Removing matching rows":"Rimozione delle righe corrispondenti","Rename column":"Rinomina colonna","Rename column {0} to {1}":"Rinominare la colonna {0} in {1}","Replace all instances of {1} with {2} in column: {0}/Find all occurrences of string {1} in data column {0} and replace them with string {2}":"Sostituire tutte le istanze di {1} con {2} nella colonna: {0}","Replace all instances of {1} with {2} in columns: {0}/Find all occurrences of string {1} in data columns {0} and replace them with string {2}":"Sostituire tutte le istanze di {1} con {2} nelle colonne: {0}","Replace gaps back from the next valid value in: {0}":"Sostituisce gli spazi vuoti a partire dal successivo valore valido in: {0}","Replace gaps forward from the previous valid value in: {0}":"Sostituire gli spazi avanti a partire dal precedente valore valido in: {0}","Replace missing values with the mean of each column in: {0}":"Sostituire i valori mancanti con la media di ogni colonna in: {0}","Replace missing values with the median of each column in: {0}":"Sostituire i valori mancanti con il valore mediano di ogni colonna in: {0}","Replace missing values with the mode of each column in: {0}/'mode' as a statistics term.":"Sostituire i valori mancanti con la modalità di ogni colonna in: {0}","Replace missing values with the most common value of each column in: {0}":"Sostituire i valori mancanti con il valore più comune di ogni colonna in: {0}","Replace missing values with {1} in column: {0}":"Sostituire i valori mancanti con {1} nella colonna: {0}","Replace missing values with {1} in columns: {0}":"Sostituire i valori mancanti con {1} nelle colonne: {0}","Replacement for missing values":"Sostituzione dei valori mancanti","Replaces all occurrences of an old value with a new value.":"Sostituisce tutte le occorrenze di un valore precedente con un nuovo valore.","Report an issue/Meaning: report an issue, bug, error, etc. that the user found with our software.This localization string is a button label on our toolbar, so please make it as short, simple, and easy to understand as possible.":"Segnala un problema","Required debug API is not available in this version of VS Code. Debugging support will be disabled for Data Wrangler./{Locked=\"VS Code\"}":"L'API di debug richiesta non è disponibile in questa versione di VS Code. Il supporto per il debug verrà disabilitato per Data Wrangler.","Return to current step":"Torna al passaggio corrente","Round column {0} (Number of decimals: {1})":"Arrotonda colonna {0} (numero di decimali: {1})","Round columns {0} (Number of decimals: {1})":"Arrotonda colonne {0} (numero di decimali: {1})","Round down (floor)/'floor' and 'ceiling' are programming terms for rounding down and rounding up, respectively.":"Arrotonda per difetto","Round down column {0}":"Arrotonda per difetto la colonna {0}","Round down columns {0}":"Arrotonda per difetto le colonne {0}","Round up (ceiling)/'floor' and 'ceiling' are programming terms for rounding down and rounding up, respectively.":"Arrotonda per eccesso","Round up column {0}":"Arrotonda per eccesso la colonne {0}","Round up columns {0}":"Arrotonda per eccesso le colonne {0}","Round/'Round' as a verb in the mathematical sense.":"Arrotondamento","Rounds numbers down to the nearest integer.":"Arrotonda i numeri per difetto all'intero più vicino.","Rounds numbers to the specified number of decimal places.":"Arrotonda i numeri al numero specificato di posizioni decimali.","Rounds numbers up to the nearest integer./The verb here is 'to round up'. Not just 'to round'.":"Arrotonda i numeri per eccesso all'intero più vicino.","Rows":"Righe","Rows with missing values":"Righe con valori mancanti","Scale by min/max values/'scale' in the mathematical sense. The numbers will be scaled such that their new minimum and maximum values will be the ones specified by the user.":"Scalabilità per valori minimo/massimo","Scale column {0} between {1} and {2}":"Ridimensionare la colonna {0} tra {1} e {2}","Scale columns {0} between {1} and {2}":"Colonne di scala {0} tra {1} e {2}","Scales all numerical values in the targeted columns between a new minimum and maximum value.":"Ridimensiona tutti i valori numerici nelle colonne di destinazione tra un nuovo valore minimo e massimo.","Schema/'Schema' meaning the structure of a data table. For example, the columns and their data types.":"Schema","Search for operations...":"Cercare operazioni...","See {linkStart}documentation{linkEnd} for how to create a new local kernel.":"Per informazioni su come creare un nuovo kernel locale, vedere la documentazione {linkStart}{linkEnd}.","Select a condition":"Selezionare una condizione","Select a file type/File type (e.g., CSV or Parquet).":"Selezionare un tipo di file","Select a runtime":"Seleziona un runtime","Select a variable to open in Data Wrangler./The user is shown a list of names of variables (variables in the computer programming sense), each one containing a data table. The user is being asked to choose one of those variables so as to open the corresponding data table in Data Wrangler.":"Selezionare una variabile da aprire in Data Wrangler.","Select all":"Seleziona tutto","Select column: {0}":"Seleziona colonna: {0}","Select columns/Here, we mean keep the selected columns and drop all others. We chose the word 'Select' for the English string because that's the term that is often used when working with databases and data tables.":"Seleziona colonne","Select columns: {0}":"Seleziona colonne: {0}","Select kernel for '{filePath}'/'kernel' in the sense 'Jupyter kernel'.":"Selezionare il kernel per '{filePath}'","Select one or more target columns.../'column' as in a column of a data table":"Selezionare una o più colonne di destinazione...","Selecting runtime":"Selezione del runtime","Selects the targeted columns from the data frame and drops all others.":"Seleziona le colonne di destinazione dal frame di dati e rimuove tutte le altre.","Series (Pandas)":"Serie (Pandas)","Series (Polars)":"Serie (Polars)","Setting up {installerName}":"Configurazione {installerName}","Sheet number":"Numero foglio","Show column insights":"Mostra informazioni dettagliate colonna","Show more details":"Mostra altri dettagli","Showing code":"Visualizzazione del codice","Skew/'Skew' as a noun. Also known as 'Skewness'. Statistics term.":"Inclina","Skew/Statistics term. 'Skew' as a noun. Also known as 'Skewness'.":"Inclina","Skewness is biased in PySpark and may yield slightly different results./'Skewness' is a Statistics term. Also known as 'skew'":"L'indice di asimmetria è distorto in PySpark e potrebbe restituire risultati leggermente diversi.","Some operations were translated with warnings. Please see the generated code comments to see the warning messages./The program tried to translate computer code, which corresponds to operations on a data table, from one programming language to another. Some of the operations were able to be translated, but with warnings or caveats about the translated code. The translated version of the code includes some code comments with these warning messages.":"Alcune operazioni sono state tradotte con avvisi. Per visualizzare i messaggi di avviso, vedere i commenti generati sul codice.","Sort and filter/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Ordina e filtra","Sort ascending/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Ordinamento crescente","Sort by column: {0}/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Ordina per colonna: {0}","Sort by columns: {0}/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Ordina per colonne: {0}","Sort descending/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Ordinamento decrescente","Sort order/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Ordinamento","Sort order: {0} of {1}/{0} and {1} are both numbers, e.g. Sort order 2 of 5. Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Ordinamento: {0} di {1}","Sort the data according to one or more columns.":"Ordina i dati in base a una o più colonne.","Sort values/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Ordinare i valori","Sorts ({numberOfSorts})/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Ordina ({numberOfSorts})","Sorts/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Ordinamenti","Source":"Origine","Specify the URL, port, and token to connect to a Jupyter server.":"Specificare l'URL, la porta e il token per la connessione a un server Jupyter.","Specify the local Python interpreter used to run a kernel.":"Specificare l'interprete Python locale usato per eseguire un kernel.","Split categorical data into a new column for each category using a text split delimiter, where each new column contains a 1 in rows that match that category, and 0 otherwise.":"Dividere i dati categoriali in una nuova colonna per ogni categoria, in cui ogni nuova colonna contiene un 1 nelle righe corrispondenti a tale categoria e 0 in caso contrario.","Split categorical data into a new column for each category, where each new column contains a 1 in rows that match that category, and 0 otherwise.":"Dividere i dati categoriali in una nuova colonna per ogni categoria, in cui ogni nuova colonna contiene un 1 nelle righe corrispondenti a tale categoria e 0 in caso contrario.","Split text":"Dividi testo","Split text using regex '{0}' in column: {1}":"Dividi il testo usando il regex “{0}” regex nella colonna: {1}","Split text using regex '{0}' in columns: {1}":"Dividi il testo usando il regex “{0}” regex nelle colonne: {1}","Split text using string '{0}' in column: {1}":"Dividi testo usando la stringa “{0}” stringa nella colonna: {1}","Split text using string '{0}' in columns: {1}":"Dividi testo usando la stringa “{0}” stringa nelle colonne: {1}","Splits a text column into several columns based on the input value.":"Divide una colonna di testo in più colonne in base al valore di input.","Standard deviation":"Deviazione standard","Standard error of the mean":"Errore standard della media","Starting new Jupyter session":"Avvio della nuova sessione Jupyter","Starts with":"Inizia con","Statistics":"Statistiche","Statistics, visualizations, and operations will be performed on the truncated data only, and could be inaccurate. Do you want to truncate?/To 'Truncate' data table here means to only load the first n rows, instead of the entire table.":"Statistiche, visualizzazioni e operazioni verranno eseguite solo sui dati troncati e potrebbero non essere accurate. Troncare?","Statistics/This is meant as the plural of 'statistic' (definition: 'a numerical fact or datum, especially one computed from a sample'). Namely, statistics such as the mean, median, average, min, max of a set of numbers. It is NOT meant as Statistics, the name of the field of study.":"Statistiche","Step {0} of {1}":"Passaggio {0} di {1}","String transform by example":"Trasformazione stringa in base all'esempio","Strip whitespace/This operation removes whitespace from the beginning and/or end of each string of text. e.g. '  hello world  ' becomes 'hello world'":"Striscia spazi vuoti","Sum":"Somma","TIP: The selected runtime will be used for future launches. Note that if Data Wrangler is launched from a Jupyter Notebook, then the current notebook kernel will be used as the runtime by default.":"SUGGERIMENTO: il runtime selezionato verrà usato per gli avvii futuri. Si noti che se Data Wrangler viene avviato da un Jupyter Notebook, per impostazione predefinita verrà usato il kernel del notebook corrente come runtime.","Taking too long to load? You can <a>truncate the data</a> to work with a smaller sample./{Locked=\"<a>\"}{Locked=\"</a>\"}To 'Truncate' a data table here means to only load the first n rows, instead of the entire table.":"Il caricamento sta richiedendo troppo tempo? È possibile <a>troncare i dati</a>per lavorare con un campione più piccolo.","Target column":"Colonna di destinazione","Target columns":"Colonne di destinazione","Tensor":"Tensor","The base URL of the Jupyter connection host (e.g., http://localhost:8888)/{Locked=\"http://localhost:8888\"}":"URL di base dell'host di connessione Jupyter (ad esempio http://localhost:8888)","The chart has 1 X axis displaying {0}. {1}/{0} will be replaced with a label for the axis (above), and {1} will be replaced with the data range (below).":"Il grafico ha 1 asse X che mostra {0}. {1}","The chart has 1 Y axis displaying {0}. {1}":"Il grafico ha 1 asse Y che mostra {0}. {1}","The median in PySpark is approximated for performance reasons.":"La mediana in PySpark è approssimativa per motivi di prestazioni.","The minimum required version of the following dependencies couldn't be installed: {dependenciesList}":"Non è stato possibile installare la versione minima richiesta delle dipendenze seguenti: {dependenciesList}","The operation field is disabled.":"Il campo dell'operazione è disabilitato.","The token to use for the Jupyter connection":"Token da usare per la connessione Jupyter","This data type is not fully supported and will have limited statistics and operations. Please consider changing the column type.":"Questo tipo di dati non è completamente supportato e avrà statistiche e operazioni limitate. Considera la possibilità di modificare il tipo di colonna.","This feature depends on the Jupyter and Python extensions for Visual Studio Code. Would you like to install both extensions?/\"Jupyter\" and \"Python\" are the names of the extensions.":"Questa funzionalità dipende dalle estensioni Jupyter e Python per Visual Studio Code. Installare entrambe le estensioni?","This feature depends on the Jupyter extension for Visual Studio Code. Would you like to install it?/\"Jupyter\" is the name of the extension.":"Questa funzionalità dipende dall'estensione Jupyter per Visual Studio Code. Installarla?","This feature depends on the Python extension for Visual Studio Code. Would you like to install it?/\"Python\" is the name of the extension.":"Questa funzionalità dipende dall'estensione Python per Visual Studio Code. Installarla?","This feature depends on version {minVersion} or greater of the Jupyter extension for Visual Studio Code. Please update the extension before trying again./The extension is called \"Jupyter\".":"Questa funzionalità dipende dalla versione {minVersion} o superiore dell'estensione Jupyter per Visual Studio Code. Aggiornare l'estensione prima di riprovare.","This feature requires .NET. Would you like to install the .NET Installer extension to continue?":"Questa funzionalità richiede .NET. Installare l'estensione del programma di installazione di .NET per continuare?","This is taking longer than usual...":"L'operazione richiede più tempo del solito...","This operation cannot be performed on a non-editable step":"Non è possibile eseguire questa operazione in un passaggio non modificabile","This operation cannot be performed on the first step":"Non è possibile eseguire questa operazione nel primo passaggio","This operation does not support multiple columns":"Questa operazione non supporta più colonne","This step is complete":"Questo passaggio è stato completato","This step is incomplete":"Questo passaggio è incompleto","This was generated to match the original {0} logic but may have performance issues.":"È stato generato in modo da corrispondere alla logica {0} originale, ma potrebbero verificarsi problemi di prestazioni.","Timed out while discovering kernels/'kernel' in the sense 'Jupyter kernel'.":"Timeout durante l'individuazione dei kernel","Timed out while trying to derive a program.":"Timeout durante il tentativo di derivare un programma.","To export or modify your current code changes, you can switch back into the editing mode of Data Wrangler at any time./This is an informational message and not an immediate instruction.":"Per esportare o modificare le modifiche al codice correnti, è possibile tornare alla modalità di modifica di Data Wrangler in qualsiasi momento.","To use that command, you need to have a supported file open.":"Per utilizzare questo comando, è necessario aprire un file supportato.","Transform based on the following examples/Meaning: transform a data set into another according to the examples shown below.":"Trasformare in base agli esempi seguenti","True":"True","Truncate/To 'Truncate' a data table here means to only load the first n rows, instead of the entire table.":"Troncato","Truncated to {0} rows/Meaning that the data table was cut in size to only contain the first {0} rows.":"Troncato a {0} righe","Truncation enabled: {rowCount} rows/'truncation' meaning that only the first {rowCount} rows of a data table will be loaded. Not all the data will be loaded.":"Troncamento abilitato: righe {rowCount}","Try again":"Riprova","Type '{0}' is currently an unsupported type":"Il tipo '{0}' è attualmente un tipo non supportato","Type '{0}' is not allowed for this operation":"Tipo '{0}' non consentito per questa operazione","Uncaught error":"Errore non rilevato","Undoing operation/'operation' in the sense: an operation on a data table.":"Annullamento dell'operazione","Unknown error":"Errore sconosciuto","Unknown kernel":"Kernel sconosciuto","Unknown runtime":"Runtime sconosciuto","Unknown/This localization string is used in a context like: 'Environment type: Unknown'":"Sconosciuto","Update/This is a button label. 'Update' meaning: save an edited field. NOT in the sense of update software.":"Aggiorna","Updating preview":"Aggiornamento dell'anteprima","Use custom code to modify the dataframe. Note that `{0}` will be the variable for both the input and output of your code. You may modify the data frame directly or use `{0} = ...`":"Usare codice personalizzato per modificare il dataframe. Si noti che '{0}' sarà la variabile per l'input e per l'output del codice. È possibile modificare direttamente il dataframe o usare `{0} = ...`","Use regular expression":"Usa espressione regolare","Value":"Valore","Value counts":"Conteggi valori","Value histogram":"Istogramma valore","Variance":"Varianza","View column filter settings/Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"Visualizza impostazioni filtro colonna","View column sort settings/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Visualizza impostazioni di ordinamento colonna","View extension/This button opens up the extension's page in the Visual Studio Code extension marketplace":"Visualizza estensione","View the data and apply sorts and filters/'sorts' refers to data sorting (ordering) operations like sort ascending and sort descending. It does NOT mean classifications or types.":"Visualizza i dati e applica ordinamenti e filtri","Viewing":"Visualizzazione","Waiting for .NET process to initialize. This may take a while...":"In attesa dell'inizializzazione del processo .NET. L'operazione potrebbe richiedere del tempo...","Waiting for variables from notebook kernel/'kernel' in the sense 'Jupyter kernel'.":"In attesa di variabili dal kernel del notebook","Warning":"Avviso","Welcome to Data Wrangler":"Benvenuto in Data Wrangler","Work with truncated data?/To work with truncated data here means to only load and work with the first n rows of the data table, instead of the entire table.":"Usare dati troncati?","Would you like to make Data Wrangler the default editor for .{fileExtension} files?/{fileExtension} is a file extension, like 'csv' or 'json'. That's why there's a period before it in the localization string.":"Impostare Data Wrangler l'editor predefinito per i file con estensione {fileExtension}?","Yes (workspace)/This is a possible answer to the question \"Would you like to make Data Wrangler the default editor?\"":"Sì (area di lavoro)","Yes, take survey now/This is a possible response to the question \"Can you please take a minute to tell us about your experience with Data Wrangler in VS Code?\"":"Sì, rispondo ora al sondaggio","Yes/Response to the question: 'Exporting to Parquet format requires the pyarrow package. Would you like to install it?'":"Sì","Yes/This is a possible answer to the question \"Do you want Data Wrangler to open in editing mode by default?\"":"Sì","Yes/This is a possible answer to the question \"Would you like to install the VS Code extension(s)?\"":"Sì","Yes/This is a possible answer to the question \"Would you like to make Data Wrangler the default editor?\"":"Sì","Yes/This is a possible answer to the question 'Would you like to set up the installer?'":"Sì","Yes/This is a possible response to the question \"Would you like to install the .NET Installer extension to continue?\"":"Sì","You have unselected \"Keep matching rows\" in the filter settings. Rows matching the filter condition will be excluded./Meaning of 'Keep matching rows': Keep the rows that match the condition (and remove the ones that don't)":"È stata deselezionata l'opzione \"Mantieni righe corrispondenti\" nelle impostazioni del filtro. Le righe corrispondenti alla condizione di filtro verranno escluse.","all/Context: 'Number of rows to keep: all'":"tutte","launching":"avvio in corso","{0} (ascending)":"{0} (crescente)","{0} (descending)":"{0} (decrescente)","{0} (mixed)":"{0} (misto)","{0} FILTERS/{0} is an integer. 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"{0} FILTRI","{0} SORTS/{0} is an integer. Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"{0} ORDINAMENTI","{0} aggregations":"{0} aggregazioni","{0} aggregations/{0} is a number, e.g. 5":"{0} aggregazioni","{0} column":"{0} colonna","{0} columns":"{0} colonne","{0} conditions/{0} is an integer. Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"{0} condizioni","{0} filters with {1} conditions/Both {0} and {1} are numbers, e.g. 5":"{0} filtri con {1} condizioni","{0} filters/{0} is a number, e.g. 5":"{0} filtri","{0} groups with {1} sub-groups":"{0} gruppi con {1} sottogruppi","{0} groups/{0} is a number, e.g. 5":"{0} gruppi","{0} is not a supported engine for derived columns.":"{0} non è un motore supportato per le colonne derivate.","{0} is not a valid date time value./A date time value, or DateTime value, represents a point in time, and it includes both a date and a time.":"{0} non è costituito da un valore data/ora valido.","{0} row":"{0} riga","{0} rows":"{0} righe","{0} sorts/{0} is a number, e.g. 5. Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"{0} ordinamenti","{0} ȁ {1}":"{0} ȁ {1}","{0}%":"{0}%","{0}, bar series {1} of {2} with 1 bar./{0} will be replaced with the name of the data series. The other placeholders will be replaced with numbers.":"{0}, serie di barre {1} di {2} con 1 barra.","{0}, bar series {1} of {2} with {3} bars.":"{0}, serie di barre {1} di {2} con {3} barre.","{0}, {1} and {2} other columns":"{0}, {1} e altre {2} colonne","{0}. Interactive chart./{0} will be replaced with the title of the chart.":"{0}. Grafico interattivo.","{EnvironmentType} Env/{EnvironmentType} refers to a Python environment type, e.g., 'Conda' or 'Pyenv''Env' is short for 'Environment'":"{EnvironmentType} Env","{dataType} (mixed)/'mixed' is referring to a data column having different types of data":"{dataType} (misto)","{missingDependencyCount} missing packages are required to run Data Wrangler in the selected runtime/'package' in the software sense, as for example: a Python package like numpy, pandas, or matplotlib":"{missingDependencyCount} pacchetti mancanti sono necessari per eseguire Data Wrangler nel runtime selezionato","{rowCount} rows x {columnCount} columns":"{rowCount} righe x {columnCount} colonne"}
