{"'{0}' used in {1} filters/{0} is a column name and {1} is a number greater than 1, e.g. 'Sales' used in 5 filters. Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"« {0} » utilisé dans les filtres {1}","- read only":"– en lecture seule","--":"--",".NET acquire did not return a valid result!/The command 'dotnet.acquire' did not return a valid result.":"L’acquisition .NET n’a pas renvoyé de résultat valide.",".NET is required for this feature.":".NET est obligatoire pour cette fonctionnalité.","1 FILTER/'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"1 FILTRE","1 SORT/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"1 TRI","1 aggregation":"1 agrégation","1 condition/'condition' is referring to a condition used in a filter to remove data from a column.":"1 condition","1 filter":"1 filtre","1 filter with {1} conditions":"1 filtre avec conditions de {1} ","1 group":"1 groupe","1 group with {0} sub-groups":"1 groupe avec {0} sous-groupes","1 missing package is required to run Data Wrangler in the selected runtime/'package' in the software sense, as for example: a Python package like numpy, pandas, or matplotlib":"1 package manquant est nécessaire pour exécuter Data Wrangler dans le runtime sélectionné","1 sort/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"1 tri","25th percentile":"25e centile","75th percentile":"75e centile","<a>Choose an operation</a> to get started/{Locked=\"<a>\"}{Locked=\"</a>\"}'operation' refers to a data operation to be performed on a data table.":"<a>Choisissez une opération</a> pour commencer","A crashed paper plane./This is an image description for accessibility.":"Un avion en papier écrasé.","A previous step is currently selected. Applying operations will overwrite the existing step./'operation' refers to a data operation to be performed on a data table.":"Une étape précédente est actuellement sélectionnée. L’application d’opérations remplacera l’étape existante.","Accept preview":"Accepter l’aperçu","Activating Jupyter extension":"Activation de l’extension Jupyter","Add a new kernel/'kernel' in the sense 'Jupyter kernel'.":"Ajouter un nouveau noyau","Add aggregation":"Ajouter une agrégation","Add column":"Ajouter une colonne","Add condition":"Ajouter une condition","Add filter":"Ajouter un filtre","Add filter/Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"Ajouter un filtre","Add group":"Ajouter un groupe","Add sort/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Ajouter un tri","Add sub-group":"Ajouter un sous-groupe","Add/Clicking this button will add a new sub-group to the UI.":"Ajouter","Additional columns":"Colonnes supplémentaires","Advanced statistics/'statistics' is meant as the plural of 'statistic' (definition: 'a numerical fact or datum, especially one computed from a sample.'). Namely, statistics such as the mean, median, average, min, max of a set of numbers. It is NOT meant as Statistics, the name of the field of study.Advanced statistics are statistics that are less known, such as skewness, kurtosis.":"Statistiques avancées","Aggregation type":"Type d’agrégation","Aggregations":"Agrégations","All column types must be the same type for this operation":"Tous les types de colonnes doivent être du même type pour cette opération","All files":"Tous les fichiers","All values are true":"Toutes les valeurs sont vraies","An unknown error occurred.":"Une erreur inconnue s'est produite.","And":"Et","Any value is true":"N’importe quelle valeur a la valeur true","Apache Parquet files":"Fichiers Apache Parquet","Apply":"Appliquer","Apply operation":"Appliquer l’opération","Are you sure you want to discard your code changes?":"Voulez-vous vraiment ignorer toutes vos modifications de code ?","Arithmetic by example/This is the name of a data operation where the user provides examples of the output of a mathematical operation, and the program infers what the operation is and applies it to the rest of the data column.":"Arithmétique par exemple","Ascending/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Croissant","Ascending/Whether data is sorted in ascending order or descending.":"Ordre croissant","At least one option must be selected.":"Au moins une option doit être sélectionnée.","Author":"Auteur","Automatically create a column when a pattern is detected from the examples you provide. Powered by Microsoft Flash Fill.":"Créez automatiquement une colonne lorsqu’un modèle est détecté à partir des exemples que vous fournissez. Optimisé par Remplissage instantané Microsoft.","Automatically perform DateTime formatting when a pattern is detected from the examples you provide. Powered by Microsoft Flash Fill./Here, 'perform DateTime formatting' means taking a DateTime-type value and converting it to a string with a specific format. For example, '2023-09-21 3:00PM' or '21/09/2023 15h00'.":"Effectuez automatiquement une mise en forme DateTime lorsqu’un modèle est détecté à partir des exemples que vous fournissez. Optimisé par Remplissage instantané Microsoft.","Automatically perform arithmetic when a pattern is detected from the examples you provide. Powered by Microsoft Flash Fill.":"Effectuez automatiquement une opération arithmétique lorsqu’un modèle est détecté à partir des exemples que vous fournissez. Optimisé par Remplissage instantané Microsoft.","Automatically perform string transformations when a pattern is detected from the examples you provide. Powered by Microsoft Flash Fill.":"Effectuez automatiquement des transformations de chaîne lorsqu’un modèle est détecté à partir des exemples que vous fournissez. Optimisé par Remplissage instantané Microsoft.","Back to all operations":"Revenir à toutes les opérations","Back to current operation":"Retour à l'opération en cours","Back to results":"Revenir aux résultats","Bar chart with 1 bar.":"Graphique à barres avec 1 barre.","Bar chart with {0} bars.":"Graphique à barres avec barres {0}.","Bar chart with {0} data series.":"Graphique à barres avec {0} série de données.","Bin frequencies":"Fréquences de classe","Bin ranges":"Plages de classes","Boolean values":"Valeurs booléennes","Calculate text length":"Calculer la longueur du texte","Calculated text length from column: {0}":"Longueur de texte calculée à partir de la colonne : {0}","Can you please take a minute to tell us about your experience with Data Wrangler in VS Code?/{Locked=\"Data Wrangler\"}":"Pouvez-vous prendre une minute pour nous faire part de votre expérience avec Data Wrangler in VS Code ?","Cancel":"Annuler","Cannot install dependencies without installer, aborting./The installer is required in order to install dependencies.":"Impossible d’installer les dépendances sans installer, abandon.","Cannot move first item up":"Nous n’avons pas pu déplacer le premier élément vers le haut","Cannot move last item down":"Nous n’avons pas pu déplacer le dernier élément vers le bas","Cannot perform this action while previewing. Please commit or discard the operation first./'while previewing' here refers to 'while previewing an operation'.'operation' refers to a data operation on a data table.":"Désolé... Nous ne pouvons pas effectuer cette action pendant l’affichage d’aperçu. Veuillez valider ou ignorer d’abord l’opération.","Cannot perform this action with committed operations./Meaning: The button that the user is trying to press (namely, the 'Reload data' button) is disabled, because once the data table has had operations committed on it, the user is no longer allowed to perform a data reload, so the button becomes disabled.":"Désolé... Nous ne pouvons pas effectuer cette action avec des opérations validées.","Cannot select all with different column types/Meaning: cannot do 'Select all' action when the table has different types of columns. i.e, columns with different data types":"Impossible de sélectionner tout avec des types de colonnes différents","Cannot select target '{0}'. {1}.":"Impossible de sélectionner la cible « {0} ». {1}.","Capitalize all words/Capitalize the first letter of every word in a string (e.g., 'hello world' becomes 'Hello World'). When this toggle is off, only the first word is capitalized (e.g., 'Hello world').":"Mettre en majuscules tous les mots","Capitalize first character/For example, with this action the text 'hello' would become 'Hello'.":"Mettre en majuscules le premier caractère","Capitalize the first character in column: {0}":"Mettez en majuscule le premier caractère de la colonne : {0}","Capitalize the first character in columns: {0}":"Mettez en majuscule le premier caractère des colonnes : {0}","Case insensitive":"Insensible à la casse","Case sensitive":"Respecter la casse","Cell generated by Data Wrangler./Cell refers to a code cell in a Jupyter Notebook.":"Cellule générée par Data Wrangler.","Change column type":"Changer de type de colonne","Change column type to {1} for column: {0}":"Modifier le type de colonne en {1} pour la colonne : {0}","Change column type to {1} for columns: {0}":"Modifier le type de colonne en {1} pour les colonnes : {0}","Change the data type of the targeted columns.":"Modifiez le type de données des colonnes ciblées.","Change the name of the target column.":"Modifiez le nom de la colonne cible.","Choose a column to reveal/After the user chooses a data column from a list of column names, the column will be revealed, in the sense that the data table will scroll horizontally until the chosen column is visible on the screen.":"Choisissez une colonne à afficher","Choose a connection method":"Choisir une méthode de connexion","Choose a kernel to use with Data Wrangler/'kernel' in the sense 'Jupyter kernel'.":"Choisir un noyau à utiliser avec Data Wrangler","Choose a runtime":"Choisir un runtime","Choose a runtime for Data Wrangler":"Choisir un runtime pour Data Wrangler","Choose an export engine/'export engine' is an engine that exports code targeted at a certain code framework. For example, targeted at Pandas or PySpark.":"Choisir un moteur d’exportation","Choose an operation to generate preview":"Choisir une opération pour générer une version préliminaire","Choose column/'column' as in a column of a data table":"Choisir une colonne","Choose file...":"Choisir un fichier...","Clean and edit your data with built-in operations/'built-in' in the sense that the data operations already come available in our software, ready to use. This is in contrast with custom operations where the user writes custom code to apply their own data operations.":"Nettoyer et modifier vos données à l’aide d’opérations intégrées","Cleaning steps/Denotes a list of sequential steps that were taken to clean a data table, such as first sorting, then filling in missing values, etc.":"Étapes de nettoyage","Clear all":"Effacer tout","Clear all filters for column/Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"Effacer tous les filtres pour la colonne","Click to choose runtime":"Cliquez pour choisir le runtime","Click to show Data Wrangler telemetry data":"Cliquez pour afficher les données de télémétrie Data Wrangler","Clone column":"Cloner la colonne","Clone column {0} as {1}":"Cloner la colonne {0} comme {1}","Close":"Fermer","Code copied to clipboard./'Code' meaning computer code.":"Le code a été copié dans le presse-papiers.","Code execution failed":"Désolé... Nous n’avons pas pu exécuter le code","Code execution failed for operation '{operationName}'\r\n\r\n{innerErrorMessage}/'operation' in the sense: an operation on a data table.":"Échec de l’exécution du code pour l’opération « {operationName} »\r\n\r\n{innerErrorMessage}","Code generated - manual preview required":"Code généré : aperçu manuel requis","Code generation failed":"Désolé... Nous n’avons pas pu générer du code","Code generation failed for operation '{operationName}'\r\n\r\n{innerErrorMessage}/'operation' in the sense: an operation on a data table.":"Échec de la génération du code pour l’opération « {operationName} »\r\n\r\n{innerErrorMessage}","Code preview/It refers to a preview display of the computer code that will be executed.":"Aperçu du code","Column added":"Colonne ajoutée","Column formula":"Formule de colonne","Column name":"Nom de la colonne","Column name prefix":"Préfixe du nom de colonne","Column removed":"Colonne supprimée","Column to aggregate":"Colonne à agréger","Column {0} already exists. Please choose a different name.":"La colonne {0} existe déjà. Choisissez un autre nom.","Columns":"Colonnes","Columns to group by":"Colonnes à regrouper par","Committing operation/'operation' in the sense: an operation on a data table.":"Validation de l’opération","Condition":"Condition","Connect using Jupyter URL and token/Under this connection method, the user would provide a Jupyter URL and a Jupyter token to connect to a Jupyter server.":"Se connecter à l’aide de l’URL et du jeton Jupyter","Connect using local Python interpreter":"Se connecter en utilisant un interpréteur Python local","Connecting to runtime...":"Connexion au runtime...","Contains":"Contient","Convert text to lowercase":"Convertir du texte en minuscules","Convert text to lowercase in a text column.":"Convertir le texte en minuscules dans une colonne de texte.","Convert text to lowercase in column: {0}":"Convertir le texte en minuscules dans la colonne : {0}","Convert text to lowercase in columns: {0}":"Convertir du texte en minuscules en colonnes : {0}","Convert text to uppercase":"Convertir du texte en majuscules","Convert text to uppercase in a text column.":"Convertir du texte en majuscules dans une colonne de texte.","Convert text to uppercase in column: {0}":"Convertir du texte en majuscules dans la colonne : {0}","Convert text to uppercase in columns: {0}":"Convertir du texte en majuscules en colonnes : {0}","Converted to editing mode. Do you want Data Wrangler to open in editing mode by default?":"Converti en mode édition. Voulez-vous que Data Wrangler s’ouvre en mode édition par défaut ?","Converts the first character to uppercase and the remaining to lowercase.":"Convertit le premier caractère en majuscule et le reste en minuscule.","Copied cell to clipboard!/Meaning: The contents of a cell in a data grid were copied to clipboard.":"Cellule copiée dans le Presse-papiers !","Copied row selection to clipboard!/Meaning: The contents of user-selected rows in a data grid were copied to clipboard.":"La sélection de ligne a été copiée dans le Presse-papiers.","Copy all code/Meaning: Copy all code to clipboardThis localization string is a button label on our toolbar, so please make it as short, simple, and easy to understand as possible.":"Copier tout le code","Copy cell":"Copier la cellule","Copy code to clipboard":"Copier le code dans le Presse-papiers","Copy row":"Copier la ligne","Copy rows":"Copier les lignes","Could not convert to the specified bits for type":"Impossible de convertir les bits spécifiés pour le type","Could not convert to unsigned type, instead converted to a signed type":"Impossible de convertir en type non signé, à la place converti en type signé","Could not find an active notebook. Please try again later./'notebook' in the sense 'Jupyter notebook'.":"Désolé... Nous n’avons pas pu trouver de bloc-notes actif. Veuillez réessayer plus tard.","Could not find connection object for kernel/'kernel' in the sense 'Jupyter kernel'.":"Désolé... Nous n’avons pas pu trouver l’objet de connexion pour le noyau","Could not find sample extension.":"Désolé... Nous n’avons pas pu trouver l’extension d’exemple.","Could not find the PROSE DLL file!/{Locked=\"PROSE\"}A \"DLL file\" is a file with extension .dll":"Désolé... Nous n’avons pas pu trouver le fichier DLL PROSE !","Could not get .NET dependency.":"Désolé... Nous n’avons pas pu obtenir la dépendance .NET.","Could not get Jupyter extension":"Désolé... Nous n’avons pas pu obtenir l’extension Jupyter","Could not get current stack focus. This likely means that the Data Wrangler extension is not compatible with the VS Code version. Please file an issue on the Data Wrangler GitHub repository.":"Désolé... Nous n’avons pas pu obtenir le focus de pile actuel. Cela signifie probablement que l’extension Data Wrangler n’est pas compatible avec la version de VS Code. Veuillez signaler un problème sur le référentiel GitHub Data Wrangler.","Could not get debugger capabilities.":"Désolé... Nous n’avons pas pu obtenir les fonctionnalités du débogueur.","Could not get kernel from Jupyter extension. This likely means that the Data Wrangler extension is not compatible with the Jupyter extension. Please file an issue on the Data Wrangler GitHub repository.":"Could not get kernel from Jupyter extension. This likely means that the Data Wrangler extension is not compatible with the Jupyter extension. Please file an issue on the Data Wrangler GitHub repository.","Could not get kernel service from Jupyter extension. This likely means that the Data Wrangler extension is not compatible with the Jupyter extension. Please file an issue on the Data Wrangler GitHub repository.":"Désolé... Nous ne pouvons pas obtenir le service de noyau à partir de l’extension Jupyter. Cela signifie probablement que l’extension Data Wrangler n’est pas compatible avec l’extension Jupyter. Veuillez signaler un problème sur le référentiel GitHub Data Wrangler.","Could not get kernel service/'kernel' in the sense 'Jupyter kernel'.":"Impossible d’obtenir le service de noyau","Could not resolve the .NET path!/'.NET path' in the sense, the local file path to where .NET is installed.":"Désolé... Nous n’avons pas pu résoudre le chemin .NET.","Could not retrieve variable {dwVariable} from the Jupyter extension. Please file an issue on the Data Wrangler GitHub repository.":"Désolé... Nous n’avons pas pu récupérer la variable {dwVariable} à partir de l’extension Jupyter. Veuillez signaler un problème sur le référentiel GitHub Data Wrangler.","Could not set up {installerName} using the following command: {errorMessage}":"Désolé... Nous n’avons pas pu configurer {installerName} en utilisant la commande suivante : {errorMessage}","Could not set up {installerName}.\r\n\r\n{errorName}: {errorMessage}":"Désolé... Nous n’avons pas pu configurer {installerName}.\r\n\r\n{errorName} : {errorMessage}","Could not set up {installerName}. Setup was canceled by user.":"Désolé... Nous n’avons pas pu configurer {installerName}. La configuration a été annulée par l’utilisateur.","Could not update data frame: {errorMessage}":"Impossible de mettre à jour le cadre de données : {errorMessage}","Could not use {installerName} to install packages. Would you like to set it up?":"Impossible d’utiliser {installerName} pour installer les packages. Souhaitez-vous les configurer ?","Couldn't find kernel with ID: {kernelId}/'kernel' in the sense 'Jupyter kernel'.":"Désolé... Nous n’avons pas pu trouver le noyau avec l’ID : {kernelId}","Couldn't get kernel/'kernel' in the sense 'Jupyter kernel'.":"Désolé... Nous n’avons pas pu obtenir le noyau","Count":"Nombre","Count/Label for the count of items in a histogram bin. Used as a label when hovering over a bar in the graph.":"Nombre","Create column from formula":"Créer une colonne à partir d’une formule","Create new column with values equal to the length of each string value in a text column.":"Créez une nouvelle colonne avec des valeurs égales à la longueur de chaque valeur de chaîne dans une colonne de texte.","Created column {0} from formula":"Créez une colonne {0} à partir d’une formule.","Creates a column using a custom Python formula. This can include any expression using other columns and custom lambdas.":"Crée une colonne en utilisant une formule Python personnalisée. Cela peut inclure toute expression utilisant d’autres colonnes et des lambdas personnalisés.","Creates a copy of a column.":"Crée une copie d’une colonne.","Custom operation":"Opération personnalisée","Custom value":"Valeur personnalisée","DW telemetry/DW stands for Data Wrangler":"Télémétrie DW","DW: error/DW stands for Data Wrangler":"DW : erreur","DW: {durationInSeconds}s/DW stands for Data Wrangler.The s is short for seconds.":"DW : {durationInSeconds} s","Data Array (Xarray)":"Tableau de données (Xarray)","Data Summary":"Résumé des données","Data Wrangler is currently in editing mode. To enter the viewing-optimized mode, select \"Viewing\" from the rightmost dropdown in the toolbar. You can also configure the default mode in the Visual Studio Code settings for notebook entrypoints./'notebook' in the sense of a Jupyter notebook.":"Data Wrangler est actuellement en mode édition. Pour passer en mode d’affichage optimisé, sélectionnez « Affichage » dans la liste déroulante la plus à droite de la barre d’outils. Vous pouvez également configurer le mode par défaut dans les paramètres de Visual Studio Code pour les points d’entrée de notebook.","Data Wrangler is currently in viewing mode. To clean or edit the data, select \"Editing\" from the rightmost dropdown in the toolbar. You can also configure the default mode in the Visual Studio Code settings for notebook entrypoints./'notebook' in the sense of a Jupyter notebook.":"Data Wrangler est actuellement en mode affichage. Pour nettoyer ou modifier les données, sélectionnez «Modification » dans la liste déroulante la plus à droite de la barre d’outils. Vous pouvez également configurer le mode par défaut dans les paramètres de Visual Studio Code pour les points d’entrée de notebook.","Data Wrangler may be unresponsive while debugging":"Le wrangler de données ne répond peut-être pas pendant le débogage","Data Wrangler requires a newer version of the {packageName} package to view data.":"Data Wrangler nécessite une version plus récente du package {packageName} pour afficher des données.","Data Wrangler requires the following packages to view data: {packageNames}/'packages' meaning software packages.":"Data Wrangler nécessite les packages suivants pour afficher les données : {packageNames}","Data Wrangler requires the {packageName} package to view data.":"Data Wrangler nécessite le package {packageName} pour afficher des données.","Data Wrangler was started in viewing mode because it was launched from a debugger context.":"Data Wrangler a démarré en mode d’affichage, car il a été lancé à partir d’un contexte de débogueur.","Data Wrangler: Editing":"Wrangler de données : modification","Data Wrangler: Viewing":"Data Wrangler : affichage","Data frame loaded":"Trame de données chargée","Data grid":"Grille de données","Data is unchanged":"Les données sont inchangées.","Data is unchanged. Did you forget to modify the {0} variable?":"Les données n’ont pas été modifiées. Avez-vous oublié de modifier la variable {0} ?","Data must be loaded first./This precondition must be met before the user is allowed to perform the action he or she is trying to do.":"Les données doivent d’abord être chargées.","Data ranges from {0} to {1}.":"Plages de données comprises entre {0} et {1}.","Data shape":"Forme de données","Data type":"Type de données","Data viewer":"Data viewer","Data viewer preview/This text is a human-readable name for the preview of an operation performed from the data viewer, such as filtering or sorting data. This can show up if the user encounters an error, e.g. 'Operation failed: Data viewer preview'.":"Aperçu de la visionneuse de données","Data was loaded with truncation enabled. Statistics may not reflect the full data.":"Les données ont été chargées avec la troncation activée. Les statistiques peuvent ne pas refléter les données complètes.","DataFrame (Pandas)":"DataFrame (Pandas)","DataFrame (Polars)":"DataFrame (Polars)","DataFrame (PySpark)":"DataFrame (PySpark)","DateTime formatting by example/This is the name of a data operation where the user provides examples of how they want the DateTimes in a data column to be formatted (for example, '2023-09-21 3:00PM', or '21/09/2023 15h00'), and the program applies this formatting that matches the examples provided.":"Mise en forme DateTime par exemple","Debugger does not support required capabilities to launch viewer (missing = {missingCapabilities}). Please file an issue on the Data Wrangler GitHub repository with more details on your debugging environment.":"Le débogueur ne prend pas en charge les fonctionnalités requises pour lancer la visionneuse (manquant = {missingCapabilities}). Veuillez signaler un problème sur le dépôt GitHub Data Wrangler en incluant plus d’informations sur votre environnement de débogage.","Delete":"Supprimer","Delete condition":"Supprimer la condition","Delete filter group":"Supprimer le groupe de filtres","Delimited text files":"Fichiers texte délimités","Delimiter":"Délimiteur","Derive column {1} from column: {0}/{1} is the name of the new column that is derived from column {0}":"Dériver les {1} de colonnes à partir de la colonne : {0}","Derive column {1} from columns: {0}/{1} is the name of the new column that is derived from column {0}":"Dériver les {1} de colonnes à partir des colonnes : {0}","Derived column name":"Nom de colonne dérivée","Descending/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Ordre décroissant","Descending/Whether data is sorted in ascending order or descending.":"Ordre décroissant","Description":"Description","Dictionary":"Dictionnaire","Did not receive notebook URI from Jupyter extension. This likely means that the Data Wrangler extension is not compatible with the Jupyter extension. Please file an issue on the Data Wrangler GitHub repository.":"N’a pas reçu l’URI du notebook de l’extension Jupyter. Cela signifie probablement que l’extension Data Wrangler n’est pas compatible avec l’extension Jupyter. Veuillez signaler un problème sur le référentiel GitHub Data Wrangler.","Discard":"Ignorer","Discard/This refers to discarding code changes.":"Ignorer","Discarding operation/'operation' in the sense: an operation on a data table.":"Opération de discard","Disconnected from notebook kernel. Please re-open the viewer.":"Déconnecté du noyau de notebook. Veuillez rouvrir la visionneuse.","Discovering kernels/'kernel' in the sense 'Jupyter kernel'.":"Découverte de noyaux","Dismiss":"Ignorer","Distinct values/Count of values that are different from each other in a data column.":"Valeurs distinctes","Distinct/Label for the count of values that are different from each other in a data column.":"Distinct","Does not contain":"Ne contient pas","Don't ask again/This is a possible answer to the question \"Do you want Data Wrangler to open in editing mode by default?\"":"Ne plus me poser la question","Don't ask again/This is a possible answer to the question \"Would you like to make Data Wrangler the default editor?\"":"Ne plus me poser la question","Don't show again":"Ne plus afficher","Draggable":"Peut être déplacé","Draggable item from index {0} was dropped./{0} is a number, e.g. 5":"L’élément pouvant être déplacé à partir de l’index {0} a été supprimé.","Draggable item is no longer over a droppable area.":"L’élément pouvant être glissé ne se trouve plus sur une zone déroulante.","Dragged item over droppable area at index {0}./{0} is a number, e.g. 5":"Élément déplacé sur une zone déroulante au niveau de l’index {0}.","Dragging was cancelled. Draggable item from index {0} was dropped./{0} is a number, e.g. 5":"Le glissement a été annulé. L’élément pouvant être déplacé à partir de l’index {0} a été supprimé.","Drop column: {0}":"Supprimer la colonne : {0}","Drop columns/'Drop' meaning 'Delete', but we're using the word 'Drop' here because it's a more common term in data science for this type of operation.":"Supprimer des colonnes","Drop columns: {0}":"Supprimer les colonnes : {0}","Drop duplicate rows across all columns":"Supprimer les lignes dupliquées dans toutes les colonnes","Drop duplicate rows in column: {0}":"Supprimer les lignes dupliquées dans la colonne : {0}","Drop duplicate rows in columns: {0}":"Supprimer les lignes dupliquées dans les colonnes : {0}","Drop duplicate rows/'Drop' meaning 'Delete', but we're using the word 'Drop' here because it's a more common term in data science for this type of operation.":"Annuler les lignes dupliquées","Drop missing values/'Drop' meaning 'Delete', but we're using the word 'Drop' here because it's a more common term in data science for this type of operation.":"Annuler les valeurs manquantes","Drop rows with missing data across all columns":"Supprimer les lignes avec des données manquantes dans toutes les colonnes","Drop rows with missing data in column: {0}":"Supprimer les lignes avec des données manquantes dans la colonne : {0}","Drop rows with missing data in columns: {0}":"Supprimer les lignes avec des données manquantes dans les colonnes : {0}","Drop rows with missing values in the targeted columns.":"Supprimez les lignes avec des valeurs manquantes dans les colonnes ciblées.","Drops duplicate rows. Duplicate rows are identified using the selected columns only.":"Supprime les lignes dupliquées. Les lignes dupliquées sont identifiées à l’aide des colonnes sélectionnées uniquement.","Duplicate rows":"Lignes dupliquées","Eager Tensor":"Tenseur hâtif","Edit failed":"Désolé... Nous n’avons pas pu effectuer la modification","Edit loading parameters/Meaning: edit the parameters of the data loading process.":"Modifier le chargement des paramètres","Edit was successful":"La modification a réussi","Editing":"Modification","Editing previous operation":"Modification de l’opération précédente","Encode missing values":"Encoder des valeurs manquantes","End of interactive chart.":"Fin du graphique interactif.","Ends with":"Se termine par","Enter a datetime string/A date time value, or DateTime value, represents a point in time, and it includes both a date and a time.":"Enter a datetime string","Enter an example":"Entrer un exemple","Equal to":"Égal à","Equivalent translation for type '{0}' does not exist":"La traduction équivalente pour le type '{0}' n'existe pas","Error ({originalEditorTitle})":"Erreur ({originalEditorTitle})","Error details":"Error details","Error: See code panel for details.":"Erreur : consultez le panneau de codes pour obtenir plus d’informations.","Examples":"Exemples","Excel files":"Fichiers Excel","Executing performance tests":"Exécution de tests de performances","Expected {0} to be a DataFrame, but got: {1}":"{0} être un DataFrame attendu, mais j’ai reçu : {1}.","Export as file/This localization string is a button label on our toolbar, so please make it as short, simple, and easy to understand as possible.":"Exporter en tant que fichier","Export as...":"Exporter sous...","Export code as new Notebook/'Notebook' refers to a computational notebook, such as to a Jupyter Notebook.":"Exporter du code en tant que nouveau notebook","Export code back to Notebook and exit/'Notebook' refers to a computational notebook, such as to a Jupyter Notebook.":"Réexporter le code vers le bloc-notes et quitter","Export to notebook/Meaning: to export the code to a computational notebook (such as to a Jupyter Notebook).This localization string is a button label on our toolbar, so please make it as short, simple, and easy to understand as possible.":"Exporter vers un Notebook","Exported code may not be executable since we are working with a variable in local scope.":"Il est possible que le code exporté ne soit pas exécutable, car nous travaillons avec une variable dans l’étendue locale.","Exporting to Parquet format requires the pyarrow package. Would you like to install it?":"L’exportation au format Parquet nécessite le package pyarrow. Voulez-vous l’installer ?","Exporting {formatName} file.../{formatName} is the name of the file format like 'CSV' or 'Parquet'":"Exportation en cours du fichier {formatName}...","Failed to derive a program for the given examples.":"Échec de la dérive d’un programme pour les exemples donnés.","Failed to execute code on kernel session/'kernel' in the sense 'Jupyter kernel'.":"Échec de l’exécution du code sur la session du noyau","Failed to export code: {innerErrorMessage}/'code' meaning computer code.":"Échec de l’exportation de code : {innerErrorMessage}","Failed to export data: {innerErrorMessage}":"Échec de l’exportation des données : {innerErrorMessage}","Failed to fetch file from GitHub. Please note that private repositories are currently not supported./{Locked=\"GitHub\"}":"Désolé... Nous n’avons pas pu extraire le fichier à partir de GitHub. Veuillez noter que les référentiels privés ne sont actuellement pas pris en charge.","Failed to install '{packageNamesWithVersions}'.":"Échec de l’installation de « {packageNamesWithVersions} ».","Failed to install '{packageNamesWithVersions}'.\r\n\r\n{errorName}: {errorMessage}":"Échec de l’installation de « {packageNamesWithVersions} ».\r\n\r\n{errorName} : {errorMessage}","Failed to install {packageNamesWithVersions} using the following command: {errorMessage}.":"Échec de l’installation de {packageNamesWithVersions} à l’aide de la commande suivante : {errorMessage}.","Failed to install {packageNamesWithVersions} using the following command: {errorMessage}. Install was canceled by user.":"Échec de l’installation de {packageNamesWithVersions} à l’aide de la commande suivante : {errorMessage}. L’installation a été annulée par l’utilisateur(-trice).","Failed to launch kernel./'kernel' in the sense 'Jupyter kernel'.":"Le lancement du noyau a échoué.","Failed to load data":"Échec du chargement des données","Failed to load the data frame: {errorMessage}":"Désolé... Nous n’avons pas pu charger le cadre de données : {errorMessage}","Failed to load the data frame: {innerErrorMessage}":"Désolé... Nous n’avons pas pu charger le cadre de données : {innerErrorMessage}","Failed to preview operation\r\n\r\n{innerErrorMessage}/'operation' is an operation on a data table.":"Désolé... Nous n’avons pas pu afficher un aperçu de l’opération\r\n\r\n{innerErrorMessage}","Failed to preview operation/'operation' is an operation on a data table.":"Désolé... Nous n’avons pas pu afficher un aperçu de l’opération","Failed to translate the derived program to the target language.":"Échec de la traduction du programme dérivé dans la langue cible.","Failed to update data frame: {innerErrorMessage}":"Désolé... Nous n’avons pas pu mettre à jour du cadre de données : {innerErrorMessage}","False":"Faux","Fetching kernel specifications/'kernel' in the sense 'Jupyter kernel'.":"Extraction des spécifications du noyau","Fetching kernel version information/'kernel' in the sense 'Jupyter kernel'.":"Récupération des informations de version du noyau","File Type for Export/File type (e.g., CSV or Parquet) to use for exporting data to a file. This is the title of a quick pick dialog.":"Type de fichier pour l’exportation","File path":"Chemin d’accès au fichier","Fill method":"Méthode de remplissage","Fill missing values":"Remplir les valeurs manquantes","Fill missing values in the targeted columns.":"Remplissez les valeurs manquantes dans les colonnes ciblées.","Filter":"Filtrer","Filter order: {0} of {1}/{0} and {1} are both numbers, e.g. Filter order 2 of 5. Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"Ordre de filtrage : {0} de {1}","Filter rows based on column: {0}":"Filtrer les lignes en fonction de la colonne : {0}","Filter rows based on columns: {0}":"Filtrer les lignes en fonction des colonnes : {0}","Filters":"Filtres","Filters ({numberOfFilters})":"({numberOfFilters}) filtres","Filters rows based on one or more conditions.":"Filtre les lignes en fonction d’une ou de plusieurs conditions.","Find and replace":"Rechercher et remplacer","First value":"Première valeur","Format":"Format","Formulas":"Formules","Frequency":"Fréquence","Gathering diagnostic information":"Collecte des informations de diagnostic","Generating code/'code' meaning computer code.":"Génération de code","Getting Jupyter kernel service":"Obtention du service de noyau Jupyter","Go to column/Meaning: jump to a certain column in a data table by scrolling the table horizontally until the specified column is in view.This localization string is a button label on our toolbar, so please make it as short, simple, and easy to understand as possible.":"Accéder à la colonne","Greater than":"Supérieur à","Greater than or equal to":"Supérieur ou égal à","Grid view is limited to cached data. Reload for full preview and full summary information./'Grid view' is a panel that shows a data grid (data table).'summary' as in data summary.":"L’affichage en mode grille est limité aux données mises en cache. Rechargez pour obtenir un aperçu complet et des informations complètes sur le résumé.","Group by and aggregate/This operation groups the data frame by one or more columns and then performs an aggregation operation on the grouped data. For example, you can group by a column and then count the number of rows in each group. Or you can group by a column and then sum the values in another column for each group.":"Regrouper et agréger","Group the target columns to perform aggregation operations.":"Regroupez les colonnes cibles pour effectuer des opérations d’agrégation.","Grouped on column: {0}":"Groupé sur la colonne : {0}","Grouped on columns: {0}":"Groupé sur les colonnes : {0}","Hide column insights":"Masquer les insights de colonne","Index of max value":"Index de la valeur maximale","Index of min value":"Index de la valeur minimale","Install dependencies":"Installer les dépendances","Install packages/'package' in the software sense, as for example: a Python package like numpy, pandas, or matplotlib":"Installer des packages","Install {0}":"Installer {0}","Install/As a verb.":"Installer","Installed version/Lists the version of a specific software dependency that is currently installed.":"Version installée","Installing Jupyter extension/Meaning: The Visual Studio Code extension called 'Jupyter' is being installed.":"Installation de l’extension Jupyter","Installing Python extension (includes Jupyter extension)/Text shown with a progress bar. The Jupyter extension comes bundled with the Python extension, so if you install the Python extension, the installation wait time also includes installing the Jupyter extension.":"Installation de l’extension Python (inclut l’extension Jupyter)","Installing {packageNames}":"Installation de {packageNames}","Interactive chart.":"Graphique interactif.","Invalid extension exports":"Exportations d’extension non valides","Is false":"Est faux","Is missing":"Est manquant","Is not missing":"N’est pas manquant","Is true":"Est vrai","Jupyter connection URL":"URL de connexion Jupyter","Jupyter connection token for {baseUrl}":"Jeton de connexion Jupyter pour {baseUrl}","Jupyter extension is outdated":"L’extension Jupyter est obsolète","Keep matching rows/'Keep' in the sense 'Retain' (all rows not matching the filter pattern are deleted), not in the sense of 'Continue'. Matching here denotes rows that are matched by a filter pattern":"Conserver les lignes correspondantes","Keep matching rows/Meaning: Keep the rows that match the condition (and remove the ones that don't)":"Conserver les lignes correspondantes","Kernel must be connected first.":"Le noyau doit d’abord être connecté.","Kurtosis":"Kurtosis","Last value":"Dernière valeur","Less than":"Inférieur à","Less than or equal to":"Inférieur ou égal à","Let's get you set up./This starts the process of helping the user to set up the Data Wrangler software and get it working in their computer, including installing any necessary dependencies.":"Nous allons vous aider pour la configuration.","List":"Liste","Load an existing variable into Data Wrangler.":"Charger une variable existante dans Data Wrangler.","Load data from CSV":"Charger les données à partir du fichier CSV","Load data from Excel":"Charger des données à partir d’Excel","Load data from Parquet":"Charger les données à partir de Parquet","Load data from variable":"Charger les données de la variable","Loaded variable '{0}' from URI: {1}":"Variable chargée '{0}' à partir de l’URI : {1}","Loaded variable '{0}' from kernel state":"Variable chargée '{0}' à partir de l’état du noyau","Loaded with truncation: {rowCount} rows/'truncation' meaning that only the first {rowCount} rows of the data table were loaded. Not all the data was loaded.":"Chargé avec troncation : lignes {rowCount}","Loaded {0} rows":"{0} lignes chargées","Loading data frame":"Chargement du cadre de données","Loading data with truncation.../'truncation' meaning that only the first n rows of the data table will be loaded. Not all the data will be loaded.":"Chargement en cours des données avec troncation... Merci de patienter.","Loading data...":"Chargement des données en cours... Merci de patienter.","Loading...":"Chargement en cours...","Loads data from a CSV or other delimited file.":"Charge des données à partir d’un fichier CSV ou d’un autre fichier délimité.","Loads data from a Parquet file.":"Charge des données à partir d’un fichier Parquet.","Loads data from an Excel (XLS, XLSX) file.":"Charge des données à partir d’un fichier Excel (XLS, XLSX).","Manage all filters/Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"Gérer tous les filtres","Manage all sorts/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Gérer tous les tris","Manage filters/'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"Gérer les filtres","Manage sorts/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Gérer les tris","Match case":"Respecter la casse","Match full string":"Faire correspondre à une chaîne complète","Max/Short form of 'Maximum'. Indicates the biggest value in a data column.":"Max","Maximum":"Maximum","Mean/Statistics term.":"Moyenne","Median":"Médiane","Min/Short form of 'Minimum'. Indicates the smallest value in a data column.":"Min","Minimum":"Minimum","Minimum value must be smaller than maximum value.":"La valeur minimale doit être inférieure à la valeur maximale.","Minimum version/Lists the minimum version of a specific software package dependency that will be compatible with the program. That version and any higher (later) version will work with the program.":"Version minimale","Missing dependencies/Status message that very succinctly conveys the meaning 'There are missing Python package dependencies in the kernel' with the implication that the user can't proceed with using the extension until the required dependencies are installed. This text will sometimes be followed by the actual list of dependencies that are missing.":"Dépendances manquantes","Missing required parameters":"Paramètres obligatoires manquants","Missing value/Placeholder text for a cell value that is missing (i.e., set to null, None, NaN, or equivalent) within a data table.":"Valeur manquante","Missing values (by column)":"Valeurs manquantes (par colonne)","Missing values first/Meaning: When sorting rows of data, move the rows that are empty to the top.":"Valeurs manquantes en premier","Missing values first/Note that this is used in the context of ordering data, we put the missing entries at the top.":"Valeurs manquantes en premier","Missing values first/When this toggle is on, the sorting operation will place missing values at the top of the sorted list, before non-missing values.":"Valeurs manquantes en premier","Missing values/Count of values that are missing (i.e., set to null, None, NaN, or equivalent) in a data column.":"Valeurs manquantes","Missing/Label for the count of values that are missing (i.e., set to null, None, NaN, or equivalent) in a data column.":"Manquant","Mixed columns are not allowed for this operation":"Les colonnes mixtes ne sont pas autorisées pour cette opération","Mode/Statistics term":"Mode","Mode/Statistics term.":"Mode","Modified column {0} using formula":"Colonne modifiée {0} à l’aide d’une formule","Modify":"Modifier","More details":"Plus d’informations","More items":"More items","More options":"Autres options","More options...":"Plus d’options…","Most common value":"Valeur la plus courante","Most frequent value/The value that appears the most often in a data column.":"Valeur la plus fréquente","Move down in order":"Descendre dans l’ordre","Move up in order":"Monter dans l’ordre","Moved draggable item from index {0} to {1}./e.g. Moved draggable item from index 2 to 5.":"Élément pouvant être glissé récupéré de l’index {0} vers {1}.","Multi-label binarizer/Terminology from the field of Machine Learning. An operation that transforms a data column into binary values using a multi-label format. This format uses a series of 1s and 0s as labels to represent the presence or absense of each of several categories in the input.":"Binariseur de texte multi-étiquette","Multi-label encode column {0} using delimiter {1}":"Coder la colonne en plusieurs parties {0} en utilisant un délimiteur {1}","Multi-label encode columns {0} using delimiter {1}":"Coder la colonne en plusieurs étiquettes {0} en utilisant un délimiteur {1}","N-Dimensional Array":"Tableau à n dimensions","N/A/'N/A' = 'Not Applicable'. This is shown inside a table cell, so, if there's no equivalent to 'N/A' in the target language, feel free to use a dash (or equivalent) to indicate that there is no value in this cell.":"N/A","Name for new column":"Nom de la nouvelle colonne","New column by example/This is the name of a data operation where the user provides examples of the output of a data operation, and the program infers what the operation is and applies it, creating a new column with the output.":"Nouvelle colonne par exemple","New column name":"Nouveau nom de colonne","New maximum":"Nouveau maximum","New minimum":"Nouveau minimum","New operation":"Nouvelle opération","New type":"Nouveau type","New value/The user fills in fields 'Old value' and 'New value' when doing a Find and Replace operation.":"Nouvelle valeur","No Jupyter connection URL received/Connecting to Jupyter requires a connection URL, which was not provided by the user":"Aucune URL de connexion Jupyter reçue","No Jupyter connection token received/Connecting to Jupyter requires a connection token, which was not provided by the user":"Aucun jeton de connexion Jupyter reçue","No active engine/Note that 'engine' here is referring to a code execution environment such as Pandas or PySpark.":"Aucun moteur actif","No active filter/Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"Aucun filtre actif","No aggregations":"Aucune agrégation","No code exporter found":"Aucun exportateur de code trouvé","No compatible Python interpreter found.":"Interpréteur Python compatible introuvable.","No connection method selected":"Aucune méthode de connexion sélectionnée","No data exporter found":"Aucun exportateur de données trouvé","No engine available for translation/Note that 'engine' here is referring to a code execution environment such as Pandas or PySpark.":"Aucun moteur disponible pour la traduction","No filters":"Aucun filtre","No groups":"Aucun groupe","No information for this package was found. Ensure the package name is correct before installing.":"Aucune information n’a été trouvée pour ce package. Vérifiez que le nom du package est correct avant l’installation.","No kernel session":"No kernel session","No kernel specs selected/'kernel' in the sense 'Jupyter kernel'.'specs' as short for 'specifications'.":"Aucune spécification de noyau sélectionnée","No missing values":"Aucune valeur manquante","No pattern detected from inputs.":"Aucun modèle détecté dans les entrées.","No runtime connected":"Aucun runtime connecté","No sorts/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Aucun tri","No translation available.":"Aucune traduction disponible.","No variables found. Execute a code cell to create data variables.":"Les variables sont introuvables. Exécutez une cellule de code pour créer des variables de données.","No visualization available":"Aucune visualisation disponible","No, thanks/This is a possible response to the question \"Can you please take a minute to tell us about your experience with Data Wrangler in VS Code?\"":"Non, merci","No/Response to the question: 'Exporting to Parquet format requires the pyarrow package. Would you like to install it?'":"Non","No/This is a possible answer to the question \"Would you like to install the VS Code extension(s)?\"":"Non","No/This is a possible answer to the question 'Would you like to set up the installer?'":"Non","No/This is a possible response to the question \"Would you like to install the .NET Installer extension to continue?\"":"Non","Not equal to":"Différent de","Note: The code below is Data Wrangler internal code.":"Remarque : le code ci-dessous est un code interne Data Wrangler.","Number of decimals":"Nombre de décimales","Number of digits must be a whole number.":"Le nombre de chiffres doit être un nombre entier.","Number of distinct values/Count of values that are different from each other in a data column.":"Nombre de valeurs distinctes","Number of rows to keep":"Nombre de lignes à conserver","Numeric":"Numérique","Old value must be non-empty.":"L'ancienne valeur doit être non vide.","Old value/The user fills in fields 'Old value' and 'New value' when doing a Find and Replace operation.":"Ancienne valeur","One-hot encode column: {0}/'one-hot encoding' is a technical term used in the field of Machine Learning":"Colonne d’encodage à chaud : {0}","One-hot encode columns: {0}/'one-hot encoding' is a technical term used in the field of Machine Learning":"Colonnes d’encodage à chaud : {0}","One-hot encode/'one-hot encoding' is a technical term used in the field of Machine Learning":"Un encodeur à chaud","Only the most recent operation can be edited.":"Seule l'opération la plus récente peut être modifiée.","Only viewing is supported when debugging.":"Seul l’affichage est pris en charge lors du débogage.","Open '{variableName}' in Data Wrangler":"Ouvrir « {variableName} » dans Data Wrangler","Open Python download website/'Python download website' in the sense: the website where the users can download Python, so that they can install it on their computers.":"Ouvrir le site web de téléchargement Python","Open time picker":"Open time picker","Open variable in Data Wrangler":"Ouvrir une variable dans Data Wrangler","Opening a dataset from a file is currently not supported in the web offering of Data Wrangler.":"L’ouverture d’un jeu de données à partir d’un fichier n’est actuellement pas prise en charge dans l’offre web de Data Wrangler.","Opening files directly in Data Wrangler has limited support in the web version of Visual Studio Code. The desktop version is recommended for the best experience.":"L’ouverture de fichiers directement dans Data Wrangler a une prise en charge limitée dans la version web de Visual Studio Code. La version de bureau est recommandée pour une expérience optimale.","Operation applied: {operationDescription}/'operation' is an operation on a data table.":"Opération appliquée : {operationDescription}","Operation preview: {operationDescription}/'operation' is an operation on a data table.":"Aperçu de l’opération : {operationDescription}","Operation rejected: {operationDescription}/'operation' is an operation on a data table.":"Opération rejetée : {operationDescription}","Operation undone: {operationDescription}/'operation' is an operation on a data table.":"Opération annulée : {operationDescription}","Operations/It refers to operations on a data table, like sorting, filtering, deleting a column, filling in missing values, etc.":"Opérations","Option is invalid for the selected column.":"L’option n’est pas valide pour la colonne sélectionnée.","Or":"Ou","Or, start typing code to see a live preview of the transformation on your data <ex>(e.g., <code>{exampleCode}</code>)</ex>/{Locked=\"<ex>\"}{Locked=\"</ex>\"}{Locked=\"<code>\"}{Locked=\"</code>\"}":"Ou, commencez à saisir du code pour voir un aperçu en direct de la transformation de vos données <ex>(e.g., <code>{exampleCode}</code>)</ex>","Other":"Autre","Other/category 'Other' in a dropdown list of data operation categories":"Autre","Output/'Output' as a noun, like the output of a function or algorithm.":"Sortie","Package name/'package' in the software sense, as for example: a Python package like numpy, pandas, or matplotlib":"Nom du package","Paused.":"Suspendu.","Perform advanced filter/Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"Effectuer un filtre avancé","Perform some operations on the data first./This precondition must be met before the user is allowed to perform the action he or she is trying to do.":"Effectuez d’abord des opérations sur les données.","Performed {0} grouped on column: {1}":"Effectué {0} groupé sur la colonne : {1}","Performed {0} grouped on columns: {1}":"Effectué {0} groupé sur des colonnes : {1}","Picked up draggable item from index {0}./{0} is a number, e.g. 5":"Élément pouvant être glissé récupéré dans l’index {0}.","Please install Python to continue. Note: Data Wrangler requires Python {minPythonVersion} or above.":"Veuillez installer Python pour continuer. Remarque : Data Wrangler nécessite Python {minPythonVersion} ou une version ultérieure.","Please note/This is the title of a notification message box":"Veuillez noter","Preparing":"Préparation","Preview code for all steps":"Aperçu du code pour toutes les étapes","Preview columns cannot be targeted/'Preview' refers to a data column that has pending but yet-to-be confirmed changes.":"Les colonnes d’aperçu ne peuvent pas être ciblées","Preview paused":"Préversion suspendue","Previewing all code steps":"Afficher une version préliminaire de toutes les étapes de code","Previewing/Status message that indicates that the program is currently showing a preview of the data.":"Afficher une version préliminaire","Product of all values":"Produit de toutes les valeurs","Propagate backward/Fill in missing values going backwards through the list, filling in with the previous non-missing value that was seen. e.g. [1, NaN, NaN, 2] becomes [1, 2, 2, 2]":"Propager vers l’arrière","Propagate forward/Fill in missing values based on the previous available value and propagating it forwards. e.g. [1, NaN, NaN, 2] becomes [1, 1, 1, 2]":"Propager vers l’avant","Providing an edit for this cell can improve results":"Apporter une modification de cette cellule peut améliorer les résultats","Python {minPythonVersion} or higher is required. Detected version: {kernelVersion}":"Python {minPythonVersion} ou une version ultérieure est obligatoire. Version détectée : {kernelVersion}","Quit":"Quitter","RPC connection not initialized/RPC = Remote Procedure Call":"La connexion RPC n’est pas initialisée.","Re-check/Meaning: check again whether a certain software dependency is now available or not yet.":"Nouvelle vérification","Re-loading data frame":"Nouveau chargement du frame de données","Received invalid notebook URI from Jupyter extension. This likely means that the Data Wrangler extension is not compatible with the Jupyter extension. Please file an issue on the Data Wrangler GitHub repository.":"URI de notebook non valide reçu de l’extension Jupyter. Cela signifie probablement que l’extension Data Wrangler n’est pas compatible avec l’extension Jupyter. Veuillez entrer un problème sur le référentiel GitHub Data Wrangler.","Received malformed content: {0}":"Contenu malformé reçu : {0}","Refresh data/This localization string is a button label on our toolbar, so please make it as short, simple, and easy to understand as possible.":"Actualiser des données","Reload VS Code":"Reload VS Code","Reload preview":"Recharger la préversion","Remove leading and trailing whitespace in column: {0}":"Supprimer les espaces blancs de début et de fin dans la colonne : {0}","Remove leading and trailing whitespace in columns: {0}":"Supprimer les espaces blancs de début et de fin dans les colonnes : {0}","Remove leading whitespace":"Supprimer les espaces blancs de début","Remove leading whitespace in column: {0}":"Supprimer les espaces blancs de début dans la colonne : {0}","Remove leading whitespace in columns: {0}":"Supprimer les espaces blancs de début dans les colonnes : {0}","Remove sort/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Supprimer le tri","Remove trailing whitespace":"Supprimer les espaces blancs de fin","Remove trailing whitespace in column: {0}":"Supprimer l’espace blanc de fin dans la colonne : {0}","Remove trailing whitespace in columns: {0}":"Supprimer les espaces blancs de fin dans les colonnes : {0}","Removes leading and trailing whitespace in a text column.":"Supprime les espaces blancs de début et de fin dans une colonne de texte.","Removes the targeted columns from the data frame.":"Supprime les colonnes ciblées de la trame de données.","Removing matching rows":"Suppression des lignes correspondantes","Rename column":"Renommer une colonne","Rename column {0} to {1}":"Renommer la colonne {0} à {1}","Replace all instances of {1} with {2} in column: {0}/Find all occurrences of string {1} in data column {0} and replace them with string {2}":"Remplacer toutes les instances de {1} par {2} dans la colonne : {0}","Replace all instances of {1} with {2} in columns: {0}/Find all occurrences of string {1} in data columns {0} and replace them with string {2}":"Remplacer toutes les instances de {1} par {2} dans les colonnes : {0}","Replace gaps back from the next valid value in: {0}":"Remplacez les écarts par la valeur valide suivante dans : {0}","Replace gaps forward from the previous valid value in: {0}":"Remplacer les écarts par rapport à la valeur valide précédente dans : {0}","Replace missing values with the mean of each column in: {0}":"Remplacer les valeurs manquantes par la moyenne de chaque colonne dans : {0}","Replace missing values with the median of each column in: {0}":"Remplacez les valeurs manquantes par la médiane de chaque colonne dans : {0}","Replace missing values with the mode of each column in: {0}/'mode' as a statistics term.":"Remplacez les valeurs manquantes par le mode de chaque colonne dans : {0}","Replace missing values with the most common value of each column in: {0}":"Remplacer les valeurs manquantes par la valeur la plus courante de chaque colonne dans : {0}","Replace missing values with {1} in column: {0}":"Remplacer les valeurs manquantes par {1} dans la colonne : {0}","Replace missing values with {1} in columns: {0}":"Remplacer les valeurs manquantes par {1} dans les colonnes : {0}","Replacement for missing values":"Remplacement des valeurs manquantes","Replaces all occurrences of an old value with a new value.":"Remplace toutes les occurrences d’une ancienne valeur par une nouvelle valeur.","Report an issue/Meaning: report an issue, bug, error, etc. that the user found with our software.This localization string is a button label on our toolbar, so please make it as short, simple, and easy to understand as possible.":"Signaler un problème","Required debug API is not available in this version of VS Code. Debugging support will be disabled for Data Wrangler./{Locked=\"VS Code\"}":"L’API de débogage requise n’est pas disponible dans cette version de VS Code. La prise en charge du débogage sera désactivée pour Data Wrangler.","Return to current step":"Revenir à l’étape actuelle","Round column {0} (Number of decimals: {1})":"Colonne ronde {0} (nombre de décimales : {1})","Round columns {0} (Number of decimals: {1})":"Colonnes rondes {0} (nombre de décimales : {1})","Round down (floor)/'floor' and 'ceiling' are programming terms for rounding down and rounding up, respectively.":"Arrondir vers le bas (plancher)","Round down column {0}":"Arrondir la colonne {0} vers le bas","Round down columns {0}":"Arrondir les colonnes en bas {0}","Round up (ceiling)/'floor' and 'ceiling' are programming terms for rounding down and rounding up, respectively.":"Arrondir vers le haut (plafond)","Round up column {0}":"Arrondir la colonne {0} vers le haut","Round up columns {0}":"Arrondir les colonnes {0} vers le haut","Round/'Round' as a verb in the mathematical sense.":"Arrondi","Rounds numbers down to the nearest integer.":"Arrondit les nombres vers le bas à l’entier le plus proche.","Rounds numbers to the specified number of decimal places.":"Arrondit les nombres au nombre de décimales spécifié.","Rounds numbers up to the nearest integer./The verb here is 'to round up'. Not just 'to round'.":"Arrondit les nombres à l’entier le plus proche.","Rows":"Lignes","Rows with missing values":"Lignes avec des valeurs manquantes","Scale by min/max values/'scale' in the mathematical sense. The numbers will be scaled such that their new minimum and maximum values will be the ones specified by the user.":"Échelle par valeurs min/max","Scale column {0} between {1} and {2}":"Mettre à l’échelle la colonne {0} entre {1} et {2}","Scale columns {0} between {1} and {2}":"Mettre à l’échelle les colonnes {0} entre {1} et {2}","Scales all numerical values in the targeted columns between a new minimum and maximum value.":"Met à l’échelle toutes les valeurs numériques des colonnes ciblées entre une nouvelle valeur minimale et une valeur maximale.","Schema/'Schema' meaning the structure of a data table. For example, the columns and their data types.":"Schéma","Search for operations...":"Rechercher des opérations...","See {linkStart}documentation{linkEnd} for how to create a new local kernel.":"Consultez {linkStart}documentation{linkEnd} pour savoir comment créer un noyau local.","Select a condition":"Sélectionner une condition","Select a file type/File type (e.g., CSV or Parquet).":"Sélectionner un type de fichier","Select a runtime":"Sélectionner un runtime","Select a variable to open in Data Wrangler./The user is shown a list of names of variables (variables in the computer programming sense), each one containing a data table. The user is being asked to choose one of those variables so as to open the corresponding data table in Data Wrangler.":"Sélectionnez une variable à ouvrir dans Data Wrangler.","Select all":"Sélectionner tout","Select column: {0}":"Sélectionner une colonne : {0}","Select columns/Here, we mean keep the selected columns and drop all others. We chose the word 'Select' for the English string because that's the term that is often used when working with databases and data tables.":"Sélectionner les colonnes","Select columns: {0}":"Sélectionner des colonnes : {0}","Select kernel for '{filePath}'/'kernel' in the sense 'Jupyter kernel'.":"Sélectionner le noyau pour « {filePath} »","Select one or more target columns.../'column' as in a column of a data table":"Sélectionnez une ou plusieurs colonnes cibles...","Selecting runtime":"Sélection du runtime","Selects the targeted columns from the data frame and drops all others.":"Sélectionne les colonnes ciblées dans la trame de données et supprime toutes les autres.","Series (Pandas)":"Série (Pandas)","Series (Polars)":"Série (Polars)","Setting up {installerName}":"Configuration de {installerName}","Sheet number":"Numéro de feuille","Show column insights":"Afficher les insights de colonne","Show more details":"Afficher plus de détails","Showing code":"Affichage du code","Skew/'Skew' as a noun. Also known as 'Skewness'. Statistics term.":"Incliner","Skew/Statistics term. 'Skew' as a noun. Also known as 'Skewness'.":"Incliner","Skewness is biased in PySpark and may yield slightly different results./'Skewness' is a Statistics term. Also known as 'skew'":"L’asymétrie est biaisée dans PySpark et peut produire des résultats légèrement différents.","Some operations were translated with warnings. Please see the generated code comments to see the warning messages./The program tried to translate computer code, which corresponds to operations on a data table, from one programming language to another. Some of the operations were able to be translated, but with warnings or caveats about the translated code. The translated version of the code includes some code comments with these warning messages.":"Certaines opérations ont été traduites avec des avertissements. Veuillez consulter les commentaires de code générés pour afficher les messages d’avertissement.","Sort and filter/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Trier et filtrer","Sort ascending/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Tri croissant","Sort by column: {0}/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Trier par colonne : {0}","Sort by columns: {0}/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Trier par colonnes : {0}","Sort descending/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Tri décroissant","Sort order/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Ordre de tri","Sort order: {0} of {1}/{0} and {1} are both numbers, e.g. Sort order 2 of 5. Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Ordre de tri : {0} de {1}","Sort the data according to one or more columns.":"Triez les données en fonction d’une ou de plusieurs colonnes.","Sort values/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Trier des valeurs","Sorts ({numberOfSorts})/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Tris ({numberOfSorts})","Sorts/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Tris","Source":"Source","Specify the URL, port, and token to connect to a Jupyter server.":"Spécifiez l’URL, le port et le jeton pour la connexion à un serveur Jupyter.","Specify the local Python interpreter used to run a kernel.":"Spécifiez l’interpréteur Python local utilisé pour exécuter un noyau.","Split categorical data into a new column for each category using a text split delimiter, where each new column contains a 1 in rows that match that category, and 0 otherwise.":"Fractionner les données catégorielles en une nouvelle colonne pour chaque catégorie à l’aide d’un délimiteur de fractionnement de texte, où chaque nouvelle colonne contient un 1 dans les lignes qui correspondent à cette catégorie, et 0 dans le cas contraire.","Split categorical data into a new column for each category, where each new column contains a 1 in rows that match that category, and 0 otherwise.":"Fractionnez les données catégorielles en une nouvelle colonne pour chaque catégorie, où chaque nouvelle colonne contient 1 ligne correspondant à cette catégorie, et 0 dans le cas contraire.","Split text":"Fractionner un texte","Split text using regex '{0}' in column: {1}":"Fractionner le texte à l’aide de l’expression régulière «{0}» dans la colonne : {1}","Split text using regex '{0}' in columns: {1}":"Fractionner le texte à l’aide de l’expression régulière «{0}» dans les colonnes : {1}","Split text using string '{0}' in column: {1}":"Fractionner le texte à l’aide de la chaîne '{0}' dans la colonne : {1}","Split text using string '{0}' in columns: {1}":"Fractionner le texte à l’aide de la chaîne '{0}' dans les colonnes : {1}","Splits a text column into several columns based on the input value.":"Fractionne une colonne de texte en plusieurs colonnes en fonction de la valeur d’entrée.","Standard deviation":"Écart type","Standard error of the mean":"Erreur standard de la moyenne","Starting new Jupyter session":"Démarrage d’une nouvelle session Jupyter","Starts with":"Commence par","Statistics":"Statistiques","Statistics, visualizations, and operations will be performed on the truncated data only, and could be inaccurate. Do you want to truncate?/To 'Truncate' data table here means to only load the first n rows, instead of the entire table.":"Les statistiques, visualisations et opérations sont effectuées uniquement sur les données tronquées et risquent d’être inexactes. Voulez-vous tronquer ?","Statistics/This is meant as the plural of 'statistic' (definition: 'a numerical fact or datum, especially one computed from a sample'). Namely, statistics such as the mean, median, average, min, max of a set of numbers. It is NOT meant as Statistics, the name of the field of study.":"Statistiques","Step {0} of {1}":"Étape {0} sur {1}","String transform by example":"Transformation de chaîne par exemple","Strip whitespace/This operation removes whitespace from the beginning and/or end of each string of text. e.g. '  hello world  ' becomes 'hello world'":"Éliminer les espaces blancs","Sum":"Somme","TIP: The selected runtime will be used for future launches. Note that if Data Wrangler is launched from a Jupyter Notebook, then the current notebook kernel will be used as the runtime by default.":"CONSEIL : le runtime sélectionné sera utilisé pour les prochains lancements. Notez que si Data Wrangler est lancé à partir d’un Jupyter Notebook, le noyau de notebook actuel est utilisé comme runtime par défaut.","Taking too long to load? You can <a>truncate the data</a> to work with a smaller sample./{Locked=\"<a>\"}{Locked=\"</a>\"}To 'Truncate' a data table here means to only load the first n rows, instead of the entire table.":"Le chargement prend-il trop de temps ? Vous pouvez <a>tronquer les données</a> pour leur fonctionnement avec un plus petit exemple.","Target column":"Colonne cible","Target columns":"Colonnes cibles","Tensor":"Tenseur","The base URL of the Jupyter connection host (e.g., http://localhost:8888)/{Locked=\"http://localhost:8888\"}":"URL de base de l’hôte de connexion Jupyter (par exemple, http://localhost:8888)","The chart has 1 X axis displaying {0}. {1}/{0} will be replaced with a label for the axis (above), and {1} will be replaced with the data range (below).":"Le graphique comporte 1 axe Y affichant {0}. {1}","The chart has 1 Y axis displaying {0}. {1}":"Le graphique comporte 1 axe Y affichant {0}. {1}","The median in PySpark is approximated for performance reasons.":"La médiane dans PySpark est approximative pour des raisons de performances.","The minimum required version of the following dependencies couldn't be installed: {dependenciesList}":"Désolé... Nous n’avons pas pu installer la version minimale requise des dépendances suivantes : {dependenciesList}","The operation field is disabled.":"Le champ d’opération est désactivé.","The token to use for the Jupyter connection":"Jeton à utiliser pour la connexion Jupyter","This data type is not fully supported and will have limited statistics and operations. Please consider changing the column type.":"Ce type de données n’est pas entièrement pris en charge et ses statistiques et opérations seront limitées. Veuillez envisager de modifier le type de colonne.","This feature depends on the Jupyter and Python extensions for Visual Studio Code. Would you like to install both extensions?/\"Jupyter\" and \"Python\" are the names of the extensions.":"Cette fonctionnalité dépend des extensions Jupyter et Python pour Visual Studio Code. Voulez-vous installer les deux extensions ?","This feature depends on the Jupyter extension for Visual Studio Code. Would you like to install it?/\"Jupyter\" is the name of the extension.":"Cette fonctionnalité dépend de l’extension Jupyter pour Visual Studio Code. Voulez-vous l’installer ?","This feature depends on the Python extension for Visual Studio Code. Would you like to install it?/\"Python\" is the name of the extension.":"Cette fonctionnalité dépend de l’extension Python pour Visual Studio Code. Voulez-vous l’installer ?","This feature depends on version {minVersion} or greater of the Jupyter extension for Visual Studio Code. Please update the extension before trying again./The extension is called \"Jupyter\".":"Cette fonctionnalité dépend de la version {minVersion} ou supérieure de l’extension Jupyter pour Visual Studio Code. Veuillez mettre à jour l’extension avant de réessayer.","This feature requires .NET. Would you like to install the .NET Installer extension to continue?":"Cette fonctionnalité nécessite .NET. Voulez-vous installer l’extension .NET Installer pour continuer ?","This is taking longer than usual...":"Cela prend plus de temps que d’habitude...","This operation cannot be performed on a non-editable step":"Cette opération ne peut pas être effectuée sur une étape non modifiable.","This operation cannot be performed on the first step":"Cette opération ne peut pas être effectuée à la première étape","This operation does not support multiple columns":"Cette opération ne prend pas en charge plusieurs colonnes","This step is complete":"Cette étape est terminée","This step is incomplete":"Cette étape est incomplète","This was generated to match the original {0} logic but may have performance issues.":"Cette opération a été générée pour correspondre à la logique d’origine {0} mais peut présenter des problèmes de performances.","Timed out while discovering kernels/'kernel' in the sense 'Jupyter kernel'.":"Expiration du délai d’attente lors de la découverte des noyaux","Timed out while trying to derive a program.":"Expiration du délai d’attente lors de la tentative de dérive d’un programme.","To export or modify your current code changes, you can switch back into the editing mode of Data Wrangler at any time./This is an informational message and not an immediate instruction.":"Pour exporter ou modifier vos modifications de code actuelles, vous pouvez revenir au mode d’édition de Data Wrangler à tout moment.","To use that command, you need to have a supported file open.":"Pour utiliser cette commande, vous devez disposer d’un fichier pris en charge ouvert.","Transform based on the following examples/Meaning: transform a data set into another according to the examples shown below.":"Transformer en fonction des exemples suivants","True":"Vrai","Truncate/To 'Truncate' a data table here means to only load the first n rows, instead of the entire table.":"Découper","Truncated to {0} rows/Meaning that the data table was cut in size to only contain the first {0} rows.":"Tronqué pour {0} lignes","Truncation enabled: {rowCount} rows/'truncation' meaning that only the first {rowCount} rows of a data table will be loaded. Not all the data will be loaded.":"Troncation activée : {rowCount} lignes","Try again":"Réessayer","Type '{0}' is currently an unsupported type":"Le type '{0}' n’est pas un type pris en charge actuellement","Type '{0}' is not allowed for this operation":"Le type '{0}' n'est pas autorisé pour cette opération","Uncaught error":"Erreur non interceptée","Undoing operation/'operation' in the sense: an operation on a data table.":"Annulation de l’opération","Unknown error":"Erreur inconnue","Unknown kernel":"Noyau inconnu","Unknown runtime":"Runtime inconnu","Unknown/This localization string is used in a context like: 'Environment type: Unknown'":"Inconnue","Update/This is a button label. 'Update' meaning: save an edited field. NOT in the sense of update software.":"Mettre à jour","Updating preview":"Mise à jour de l’aperçu","Use custom code to modify the dataframe. Note that `{0}` will be the variable for both the input and output of your code. You may modify the data frame directly or use `{0} = ...`":"Utilisez du code personnalisé pour modifier le dataframe. Notez que `{0}` est la variable pour l’entrée et la sortie de votre code. Vous pouvez modifier directement le frame de données ou utiliser `{0} = ...`","Use regular expression":"Utiliser une expression régulière","Value":"Valeur","Value counts":"Nombre de valeurs","Value histogram":"Histogramme de valeur","Variance":"Variance","View column filter settings/Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"Afficher les paramètres de filtre de colonne","View column sort settings/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Afficher les paramètres de tri des colonnes","View extension/This button opens up the extension's page in the Visual Studio Code extension marketplace":"Afficher l’extension","View the data and apply sorts and filters/'sorts' refers to data sorting (ordering) operations like sort ascending and sort descending. It does NOT mean classifications or types.":"Afficher les données et appliquer des tris et des filtres","Viewing":"Visualisation","Waiting for .NET process to initialize. This may take a while...":"En attente de l’initialisation du processus .NET. Cela peut prendre du temps...","Waiting for variables from notebook kernel/'kernel' in the sense 'Jupyter kernel'.":"En attente des variables du noyau de notebook","Warning":"Avertissement","Welcome to Data Wrangler":"Bienvenue dans Data Wrangler","Work with truncated data?/To work with truncated data here means to only load and work with the first n rows of the data table, instead of the entire table.":"Utilisez-vous des données tronquées ?","Would you like to make Data Wrangler the default editor for .{fileExtension} files?/{fileExtension} is a file extension, like 'csv' or 'json'. That's why there's a period before it in the localization string.":"Voulez-vous définir Data Wrangler comme éditeur par défaut pour les fichiers .{fileExtension} ?","Yes (workspace)/This is a possible answer to the question \"Would you like to make Data Wrangler the default editor?\"":"Oui (espace de travail)","Yes, take survey now/This is a possible response to the question \"Can you please take a minute to tell us about your experience with Data Wrangler in VS Code?\"":"Oui, participer à l’enquête maintenant","Yes/Response to the question: 'Exporting to Parquet format requires the pyarrow package. Would you like to install it?'":"Oui","Yes/This is a possible answer to the question \"Do you want Data Wrangler to open in editing mode by default?\"":"Oui","Yes/This is a possible answer to the question \"Would you like to install the VS Code extension(s)?\"":"Oui","Yes/This is a possible answer to the question \"Would you like to make Data Wrangler the default editor?\"":"Oui","Yes/This is a possible answer to the question 'Would you like to set up the installer?'":"Oui","Yes/This is a possible response to the question \"Would you like to install the .NET Installer extension to continue?\"":"Oui","You have unselected \"Keep matching rows\" in the filter settings. Rows matching the filter condition will be excluded./Meaning of 'Keep matching rows': Keep the rows that match the condition (and remove the ones that don't)":"Vous avez désélectionné « Conserver les lignes correspondantes » dans les paramètres de filtre. Les lignes correspondant à la condition du filtre seront exclues.","all/Context: 'Number of rows to keep: all'":"tout","launching":"lancement","{0} (ascending)":"{0} (croissant)","{0} (descending)":"{0} (décroissant)","{0} (mixed)":"{0} (mélangé)","{0} FILTERS/{0} is an integer. 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"{0} FILTRES","{0} SORTS/{0} is an integer. Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"{0} TRIS","{0} aggregations":"{0} agrégations","{0} aggregations/{0} is a number, e.g. 5":"{0} agrégations","{0} column":"{0} colonne","{0} columns":"{0} colonnes","{0} conditions/{0} is an integer. Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"{0} conditions","{0} filters with {1} conditions/Both {0} and {1} are numbers, e.g. 5":"filtres{0} avec des conditions de {1} ","{0} filters/{0} is a number, e.g. 5":"{0} filtres","{0} groups with {1} sub-groups":"{0} groupes avec {1} sous-groupes","{0} groups/{0} is a number, e.g. 5":"{0} groupes","{0} is not a supported engine for derived columns.":"{0} n’est pas un moteur pris en charge pour les colonnes dérivées.","{0} is not a valid date time value./A date time value, or DateTime value, represents a point in time, and it includes both a date and a time.":"{0} n'est pas une valeur de date et heure valide.","{0} row":"{0} ligne","{0} rows":"{0} lignes","{0} sorts/{0} is a number, e.g. 5. Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"{0} tris","{0} ȁ {1}":"{0} ȁ {1}","{0}%":"{0} %","{0}, bar series {1} of {2} with 1 bar./{0} will be replaced with the name of the data series. The other placeholders will be replaced with numbers.":"{0}, série de barres {1} de {2} avec 1 barre.","{0}, bar series {1} of {2} with {3} bars.":"{0} série de barres {1} de {2} avec barres {3}.","{0}, {1} and {2} other columns":"{0}, {1} et {2} autres colonnes","{0}. Interactive chart./{0} will be replaced with the title of the chart.":"{0}. Graphique interactif.","{EnvironmentType} Env/{EnvironmentType} refers to a Python environment type, e.g., 'Conda' or 'Pyenv''Env' is short for 'Environment'":"Environnement {EnvironmentType}","{dataType} (mixed)/'mixed' is referring to a data column having different types of data":"{dataType} (mixed)","{missingDependencyCount} missing packages are required to run Data Wrangler in the selected runtime/'package' in the software sense, as for example: a Python package like numpy, pandas, or matplotlib":"{missingDependencyCount} packages manquants sont nécessaires pour exécuter Data Wrangler dans le runtime sélectionné","{rowCount} rows x {columnCount} columns":"{rowCount} lignes x {columnCount} colonnes"}
