{"'{0}' used in {1} filters/{0} is a column name and {1} is a number greater than 1, e.g. 'Sales' used in 5 filters. Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"'{0}' usado en {1} filtros","- read only":"Solo lectura","--":"--",".NET acquire did not return a valid result!/The command 'dotnet.acquire' did not return a valid result.":"La adquisición de .NET no devolvió un resultado válido.",".NET is required for this feature.":"Se requiere .NET para esta característica.","1 FILTER/'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"1 FILTRO","1 SORT/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"1 ORDENAR","1 aggregation":"1 agregación","1 condition/'condition' is referring to a condition used in a filter to remove data from a column.":"1 condición","1 filter":"1 filtro","1 filter with {1} conditions":"1 filtro con {1} condiciones","1 group":"1 grupo","1 group with {0} sub-groups":"1 grupo con {0} sub grupos","1 missing package is required to run Data Wrangler in the selected runtime/'package' in the software sense, as for example: a Python package like numpy, pandas, or matplotlib":"Se requiere 1 paquete que falta para ejecutar Data Wrangler en el runtime seleccionado","1 sort/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"1 ordenación","25th percentile":"Percentil 25","75th percentile":"Percentil 75","<a>Choose an operation</a> to get started/{Locked=\"<a>\"}{Locked=\"</a>\"}'operation' refers to a data operation to be performed on a data table.":"<a>Elegir una operación</a> para empezar","A crashed paper plane./This is an image description for accessibility.":"Un avión de papel aplastado.","A previous step is currently selected. Applying operations will overwrite the existing step./'operation' refers to a data operation to be performed on a data table.":"Actualmente se ha seleccionado un paso anterior. La aplicación de operaciones sobrescribirá el paso existente.","Accept preview":"Aceptar vista previa","Activating Jupyter extension":"Activando la extensión de Jupyter","Add a new kernel/'kernel' in the sense 'Jupyter kernel'.":"Agregar un nuevo kernel","Add aggregation":"Agregar agregación","Add column":"Agregar columna","Add condition":"Agregar condición","Add filter":"Agregar filtro","Add filter/Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"Agregar filtro","Add group":"Agregar grupo","Add sort/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Agregar ordenación","Add sub-group":"Agregar subgrupo","Add/Clicking this button will add a new sub-group to the UI.":"Agregar","Additional columns":"Columnas adicionales","Advanced statistics/'statistics' is meant as the plural of 'statistic' (definition: 'a numerical fact or datum, especially one computed from a sample.'). Namely, statistics such as the mean, median, average, min, max of a set of numbers. It is NOT meant as Statistics, the name of the field of study.Advanced statistics are statistics that are less known, such as skewness, kurtosis.":"Estadísticas avanzadas","Aggregation type":"Tipo de agregación","Aggregations":"Agregaciones","All column types must be the same type for this operation":"Todos los tipos de columna deben ser del mismo tipo para esta operación","All files":"Todos los archivos","All values are true":"Todos los valores son VERDADERO","An unknown error occurred.":"Error desconocido.","And":"Y","Any value is true":"Cualquier valor es verdadero","Apache Parquet files":"Archivos de Apache Parquet","Apply":"Aplicar","Apply operation":"Aplicar operación","Are you sure you want to discard your code changes?":"¿Está seguro de que desea descartar los cambios de código?","Arithmetic by example/This is the name of a data operation where the user provides examples of the output of a mathematical operation, and the program infers what the operation is and applies it to the rest of the data column.":"Aritmética por ejemplo","Ascending/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Ascendente","Ascending/Whether data is sorted in ascending order or descending.":"Ascendente","At least one option must be selected.":"Se debe seleccionar al menos una acción.","Author":"Autor","Automatically create a column when a pattern is detected from the examples you provide. Powered by Microsoft Flash Fill.":"Cree una columna automáticamente cuando se detecta un patrón a partir de los ejemplos que proporcione. Con tecnología de Relleno rápido de Microsoft.","Automatically perform DateTime formatting when a pattern is detected from the examples you provide. Powered by Microsoft Flash Fill./Here, 'perform DateTime formatting' means taking a DateTime-type value and converting it to a string with a specific format. For example, '2023-09-21 3:00PM' or '21/09/2023 15h00'.":"Aplique el formato Fecha y hora automáticamente cuando se detecte un patrón a partir de los ejemplos proporcionados. Con tecnología de Relleno rápido de Microsoft.","Automatically perform arithmetic when a pattern is detected from the examples you provide. Powered by Microsoft Flash Fill.":"Realice automáticamente operaciones aritméticas cuando se detecta un patrón a partir de los ejemplos que proporcione. Con tecnología de Relleno rápido de Microsoft.","Automatically perform string transformations when a pattern is detected from the examples you provide. Powered by Microsoft Flash Fill.":"Realice automáticamente transformaciones de cadena cuando se detecta un patrón a partir de los ejemplos que proporcione. Con tecnología de Relleno rápido de Microsoft.","Back to all operations":"Volver a todas las operaciones","Back to current operation":"Volver a la operación actual","Back to results":"Volver a los resultados","Bar chart with 1 bar.":"Gráfico de barras con 1 barra.","Bar chart with {0} bars.":"Gráfico de barras con {0} barras.","Bar chart with {0} data series.":"Gráfico de barras con {0} series de datos.","Bin frequencies":"Frecuencias de discretización","Bin ranges":"Rangos de intervalos","Boolean values":"Valores booleanos","Calculate text length":"Calcular la longitud del texto","Calculated text length from column: {0}":"Longitud de texto calculada de la columna: {0}","Can you please take a minute to tell us about your experience with Data Wrangler in VS Code?/{Locked=\"Data Wrangler\"}":"¿Puede dedicar un minuto a contarnos su experiencia con Data Wrangler en VS Code?","Cancel":"Cancelar","Cannot install dependencies without installer, aborting./The installer is required in order to install dependencies.":"No se pueden instalar las dependencias sin el instalador, anulando.","Cannot move first item up":"No se puede subir el primer elemento","Cannot move last item down":"No se puede bajar el último elemento","Cannot perform this action while previewing. Please commit or discard the operation first./'while previewing' here refers to 'while previewing an operation'.'operation' refers to a data operation on a data table.":"No se puede realizar esta acción mientras se muestra una vista previa. Confirme o descarte primero la operación.","Cannot perform this action with committed operations./Meaning: The button that the user is trying to press (namely, the 'Reload data' button) is disabled, because once the data table has had operations committed on it, the user is no longer allowed to perform a data reload, so the button becomes disabled.":"No se puede realizar esta acción con operaciones confirmadas.","Cannot select all with different column types/Meaning: cannot do 'Select all' action when the table has different types of columns. i.e, columns with different data types":"No se puede seleccionar todo con tipos de columna diferentes","Cannot select target '{0}'. {1}.":"No se puede seleccionar el destino '{0}'. {1}.","Capitalize all words/Capitalize the first letter of every word in a string (e.g., 'hello world' becomes 'Hello World'). When this toggle is off, only the first word is capitalized (e.g., 'Hello world').":"Poner todas las palabras en mayúscula","Capitalize first character/For example, with this action the text 'hello' would become 'Hello'.":"Escribir el primer carácter en mayúsculas","Capitalize the first character in column: {0}":"Escriba en mayúsculas el primer carácter de la columna: {0}","Capitalize the first character in columns: {0}":"Poner en mayúsculas el primer carácter de las columnas: {0}","Case insensitive":"Sin distinción de mayúsculas y minúsculas","Case sensitive":"Distinguir mayúsculas de minúsculas","Cell generated by Data Wrangler./Cell refers to a code cell in a Jupyter Notebook.":"Celda generada por Data Wrangler.","Change column type":"Cambiar tipo de columna","Change column type to {1} for column: {0}":"Cambia el tipo de columna por {1} para la columna: {0}","Change column type to {1} for columns: {0}":"Cambiar el tipo de columna a {1}para las columnas: {0}","Change the data type of the targeted columns.":"Cambie el tipo de datos de las columnas de destino.","Change the name of the target column.":"Cambie el nombre de la columna de destino.","Choose a column to reveal/After the user chooses a data column from a list of column names, the column will be revealed, in the sense that the data table will scroll horizontally until the chosen column is visible on the screen.":"Elegir una columna para mostrar","Choose a connection method":"Elegir un método de conexión","Choose a kernel to use with Data Wrangler/'kernel' in the sense 'Jupyter kernel'.":"Elija un kernel para usarlo con Data Wrangler","Choose a runtime":"Elegir un entorno de ejecución","Choose a runtime for Data Wrangler":"Elegir un runtime para Data Wrangler","Choose an export engine/'export engine' is an engine that exports code targeted at a certain code framework. For example, targeted at Pandas or PySpark.":"Elegir un motor de exportación","Choose an operation to generate preview":"Elegir una operación para generar la vista previa","Choose column/'column' as in a column of a data table":"Elegir columna","Choose file...":"Elegir archivo...","Clean and edit your data with built-in operations/'built-in' in the sense that the data operations already come available in our software, ready to use. This is in contrast with custom operations where the user writes custom code to apply their own data operations.":"Limpieza y edición de los datos con operaciones integradas","Cleaning steps/Denotes a list of sequential steps that were taken to clean a data table, such as first sorting, then filling in missing values, etc.":"Pasos de limpieza","Clear all":"Borrar todo","Clear all filters for column/Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"Borrar todos los filtros de la columna","Click to choose runtime":"Hacer clic para elegir runtime","Click to show Data Wrangler telemetry data":"Haga clic para mostrar los datos de telemetría de Data Wrangler","Clone column":"Clonar columna","Clone column {0} as {1}":"Clonar columna {0} como {1}","Close":"Cerrar","Code copied to clipboard./'Code' meaning computer code.":"Código copiado en el portapapeles.","Code execution failed":"Ha ocurrido un error en la ejecución del código","Code execution failed for operation '{operationName}'\r\n\r\n{innerErrorMessage}/'operation' in the sense: an operation on a data table.":"Error de ejecución de código para la operación '{operationName}'\r\n\r\n{innerErrorMessage}","Code generated - manual preview required":"Código generado: se requiere una vista previa manual","Code generation failed":"Error de generación de código","Code generation failed for operation '{operationName}'\r\n\r\n{innerErrorMessage}/'operation' in the sense: an operation on a data table.":"Error de generación de código para la operación \"{operationName}\"\r\n\r\n{innerErrorMessage}","Code preview/It refers to a preview display of the computer code that will be executed.":"Vista previa del código","Column added":"Columna agregada","Column formula":"Fórmula de columna","Column name":"Nombre de columna","Column name prefix":"Prefijo de nombre de columna","Column removed":"Columna quitada","Column to aggregate":"Columna que se va a agregar","Column {0} already exists. Please choose a different name.":"La columna {0} ya existe. Elija otro nombre.","Columns":"Columnas","Columns to group by":"Columnas por las que se va a agrupar","Committing operation/'operation' in the sense: an operation on a data table.":"Confirmando operación","Condition":"Condición","Connect using Jupyter URL and token/Under this connection method, the user would provide a Jupyter URL and a Jupyter token to connect to a Jupyter server.":"Conexión mediante la dirección URL y el token de Jupyter","Connect using local Python interpreter":"Conexión mediante el intérprete de Python local","Connecting to runtime...":"Conectando con el entorno de ejecución...","Contains":"Contiene","Convert text to lowercase":"Convertir texto en minúsculas","Convert text to lowercase in a text column.":"Convertir texto en minúsculas en una columna de texto.","Convert text to lowercase in column: {0}":"Convertir texto en minúsculas en la columna: {0}","Convert text to lowercase in columns: {0}":"Convertir texto en minúsculas en columnas: {0}","Convert text to uppercase":"Convertir texto en mayúsculas","Convert text to uppercase in a text column.":"Convertir texto en mayúsculas en una columna de texto.","Convert text to uppercase in column: {0}":"Convertir texto en mayúsculas en la columna: {0}","Convert text to uppercase in columns: {0}":"Convertir texto en mayúsculas en columnas: {0}","Converted to editing mode. Do you want Data Wrangler to open in editing mode by default?":"Se convierte al modo de edición. ¿Desea que Data Wrangler se abra en modo de edición de forma predeterminada?","Converts the first character to uppercase and the remaining to lowercase.":"Convierte el primer carácter en mayúsculas y el resto en minúsculas.","Copied cell to clipboard!/Meaning: The contents of a cell in a data grid were copied to clipboard.":"Celda copiada en el Portapapeles.","Copied row selection to clipboard!/Meaning: The contents of user-selected rows in a data grid were copied to clipboard.":"Selección de fila copiada en el Portapapeles.","Copy all code/Meaning: Copy all code to clipboardThis localization string is a button label on our toolbar, so please make it as short, simple, and easy to understand as possible.":"Copiar todo el código","Copy cell":"Copiar celda","Copy code to clipboard":"Copiar código en el portapapeles","Copy row":"Copiar fila","Copy rows":"Copiar filas","Could not convert to the specified bits for type":"No se pudo convertir en los bits especificados para el tipo","Could not convert to unsigned type, instead converted to a signed type":"No se pudo convertir a un tipo sin signo; en su lugar, se convirtió en un tipo con signo","Could not find an active notebook. Please try again later./'notebook' in the sense 'Jupyter notebook'.":"No se encontró un bloc de notas activo. Vuelva a intentarlo más tarde.","Could not find connection object for kernel/'kernel' in the sense 'Jupyter kernel'.":"No se encontró el objeto de conexión para el kernel","Could not find sample extension.":"No se pudo encontrar la extensión de ejemplo.","Could not find the PROSE DLL file!/{Locked=\"PROSE\"}A \"DLL file\" is a file with extension .dll":"No se encontró el archivo DLL de PROSE.","Could not get .NET dependency.":"No se pudo obtener la dependencia de .NET.","Could not get Jupyter extension":"No se pudo obtener la extensión de Jupyter","Could not get current stack focus. This likely means that the Data Wrangler extension is not compatible with the VS Code version. Please file an issue on the Data Wrangler GitHub repository.":"No se pudo obtener el foco de pila actual. Probablemente esto significa que la extensión Data Wrangler no es compatible con la versión VS Code. Registre un problema en el repositorio de GitHub de Data Wrangler.","Could not get debugger capabilities.":"No se pudieron obtener las capacidades del depurador.","Could not get kernel from Jupyter extension. This likely means that the Data Wrangler extension is not compatible with the Jupyter extension. Please file an issue on the Data Wrangler GitHub repository.":"Could not get kernel from Jupyter extension. This likely means that the Data Wrangler extension is not compatible with the Jupyter extension. Please file an issue on the Data Wrangler GitHub repository.","Could not get kernel service from Jupyter extension. This likely means that the Data Wrangler extension is not compatible with the Jupyter extension. Please file an issue on the Data Wrangler GitHub repository.":"No se pudo obtener el servicio del kernel de la extensión de Jupyter. Probablemente, esto significa que la extensión Data Wrangler no es compatible con la extensión de Jupyter. Envíe un problema en el repositorio de GitHub de Data Wrangler.","Could not get kernel service/'kernel' in the sense 'Jupyter kernel'.":"No se pudo obtener el servicio de kernel","Could not resolve the .NET path!/'.NET path' in the sense, the local file path to where .NET is installed.":"No se pudo resolver la ruta de acceso de .NET.","Could not retrieve variable {dwVariable} from the Jupyter extension. Please file an issue on the Data Wrangler GitHub repository.":"No se ha podido recuperar la variable {dwVariable} de la extensión de Jupyter. Registre un problema en el repositorio de GitHub de Data Wrangler.","Could not set up {installerName} using the following command: {errorMessage}":"No se pudo configurar {installerName} con el siguiente comando: {errorMessage}","Could not set up {installerName}.\r\n\r\n{errorName}: {errorMessage}":"No se pudo configurar {installerName}.\r\n\r\n{errorName}: {errorMessage}","Could not set up {installerName}. Setup was canceled by user.":"No se pudo configurar {installerName}. El usuario canceló la instalación.","Could not update data frame: {errorMessage}":"No se pudo actualizar el DataFrame: {errorMessage}","Could not use {installerName} to install packages. Would you like to set it up?":"No se pudo usar {installerName} para instalar paquetes. ¿Quiere configurarlo?","Couldn't find kernel with ID: {kernelId}/'kernel' in the sense 'Jupyter kernel'.":"No se pudo encontrar el kernel con id.: {kernelId}","Couldn't get kernel/'kernel' in the sense 'Jupyter kernel'.":"No se pudo obtener el kernel","Count":"Contar","Count/Label for the count of items in a histogram bin. Used as a label when hovering over a bar in the graph.":"Contar","Create column from formula":"Crear una columna a partir de una fórmula","Create new column with values equal to the length of each string value in a text column.":"Crea una nueva columna con valores iguales a la longitud de cada valor de cadena en una columna de texto.","Created column {0} from formula":"Columna {0} creada a partir de una fórmula","Creates a column using a custom Python formula. This can include any expression using other columns and custom lambdas.":"Crea una columna utilizando una fórmula personalizada de Python. Esto puede incluir cualquier expresión que utilice otras columnas y lambdas personalizadas.","Creates a copy of a column.":"Crea una copia de una columna.","Custom operation":"Operación personalizada","Custom value":"Valor personalizado","DW telemetry/DW stands for Data Wrangler":"Telemetría de DW","DW: error/DW stands for Data Wrangler":"DW: error","DW: {durationInSeconds}s/DW stands for Data Wrangler.The s is short for seconds.":"DW: {durationInSeconds}s","Data Array (Xarray)":"Matriz de datos (Xarray)","Data Summary":"Resumen de datos","Data Wrangler is currently in editing mode. To enter the viewing-optimized mode, select \"Viewing\" from the rightmost dropdown in the toolbar. You can also configure the default mode in the Visual Studio Code settings for notebook entrypoints./'notebook' in the sense of a Jupyter notebook.":"Data Wrangler está actualmente en modo de edición. Para entrar en el modo optimizado para visualización, seleccione \"Visualización\" en la lista desplegable situada más a la derecha de la barra de herramientas. También puede configurar el modo predeterminado en la configuración de Visual Studio Code para los puntos de entrada del bloc de notas.","Data Wrangler is currently in viewing mode. To clean or edit the data, select \"Editing\" from the rightmost dropdown in the toolbar. You can also configure the default mode in the Visual Studio Code settings for notebook entrypoints./'notebook' in the sense of a Jupyter notebook.":"Data Wrangler está actualmente en modo de visualización. Para limpiar o editar los datos, seleccione \"Edición\" en la lista desplegable situada más a la derecha de la barra de herramientas. También puede configurar el modo predeterminado en la configuración de Visual Studio Code para los puntos de entrada del bloc de notas.","Data Wrangler may be unresponsive while debugging":"Es posible que Data Wrangler no responda durante la depuración","Data Wrangler requires a newer version of the {packageName} package to view data.":"Data Wrangler requiere una versión más reciente del paquete {packageName} para ver los datos.","Data Wrangler requires the following packages to view data: {packageNames}/'packages' meaning software packages.":"Data Wrangler requiere los siguientes paquetes para ver los datos: {packageNames}","Data Wrangler requires the {packageName} package to view data.":"Data Wrangler requiere el paquete {packageName} para ver los datos.","Data Wrangler was started in viewing mode because it was launched from a debugger context.":"Data Wrangler se ha iniciado en modo de visualización porque se inició desde un contexto de depurador.","Data Wrangler: Editing":"Data Wrangler: edición","Data Wrangler: Viewing":"Data Wrangler: Visualización","Data frame loaded":"DataFrame cargado","Data grid":"Cuadrícula de datos","Data is unchanged":"Los datos no cambian","Data is unchanged. Did you forget to modify the {0} variable?":"Los datos no se han modificado. ¿Ha olvidado modificar la variable {0}?","Data must be loaded first./This precondition must be met before the user is allowed to perform the action he or she is trying to do.":"Primero se deben cargar los datos.","Data ranges from {0} to {1}.":"Los datos van de {0} a {1}.","Data shape":"Forma de datos","Data type":"Tipo de datos","Data viewer":"Data viewer","Data viewer preview/This text is a human-readable name for the preview of an operation performed from the data viewer, such as filtering or sorting data. This can show up if the user encounters an error, e.g. 'Operation failed: Data viewer preview'.":"Vista previa del visor de datos","Data was loaded with truncation enabled. Statistics may not reflect the full data.":"Los datos se cargaron con truncamiento habilitado. Es posible que las estadísticas no reflejen los datos completos.","DataFrame (Pandas)":"DataFrame (Pandas)","DataFrame (Polars)":"DataFrame (polares)","DataFrame (PySpark)":"DataFrame (PySpark)","DateTime formatting by example/This is the name of a data operation where the user provides examples of how they want the DateTimes in a data column to be formatted (for example, '2023-09-21 3:00PM', or '21/09/2023 15h00'), and the program applies this formatting that matches the examples provided.":"Formato Fecha y hora por ejemplo","Debugger does not support required capabilities to launch viewer (missing = {missingCapabilities}). Please file an issue on the Data Wrangler GitHub repository with more details on your debugging environment.":"El depurador no admite las funcionalidades necesarias para iniciar el visor (falta = {missingCapabilities}). Envíe una incidencia al repositorio GitHub de Data Wrangler con más detalles sobre su entorno de depuración.","Delete":"Eliminar","Delete condition":"Eliminar condición","Delete filter group":"Eliminar grupo de filtros","Delimited text files":"Archivos de texto delimitados","Delimiter":"Delimitador","Derive column {1} from column: {0}/{1} is the name of the new column that is derived from column {0}":"Derivar la columna {1} de la columna: {0}","Derive column {1} from columns: {0}/{1} is the name of the new column that is derived from column {0}":"Derivar la columna {1} de las columnas: {0}","Derived column name":"Nombre de columna derivada","Descending/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Descendente","Descending/Whether data is sorted in ascending order or descending.":"Descendente","Description":"Descripción","Dictionary":"Diccionario","Did not receive notebook URI from Jupyter extension. This likely means that the Data Wrangler extension is not compatible with the Jupyter extension. Please file an issue on the Data Wrangler GitHub repository.":"No se recibió el URI del cuaderno de la extensión de Jupyter. Probablemente, significa que la extensión Data Wrangler no es compatible con la extensión de Jupyter. Registre un problema en el repositorio de GitHub de Data Wrangler.","Discard":"Descartar","Discard/This refers to discarding code changes.":"Descartar","Discarding operation/'operation' in the sense: an operation on a data table.":"Descartando operación","Disconnected from notebook kernel. Please re-open the viewer.":"Desconectado del kernel del bloc de notas. Vuelva a abrir el visor.","Discovering kernels/'kernel' in the sense 'Jupyter kernel'.":"Detectando kernels","Dismiss":"Descartar","Distinct values/Count of values that are different from each other in a data column.":"Valores únicos","Distinct/Label for the count of values that are different from each other in a data column.":"Distinto","Does not contain":"No contiene","Don't ask again/This is a possible answer to the question \"Do you want Data Wrangler to open in editing mode by default?\"":"No volver a preguntar","Don't ask again/This is a possible answer to the question \"Would you like to make Data Wrangler the default editor?\"":"No volver a preguntar","Don't show again":"No volver a mostrar","Draggable":"Arrastrable","Draggable item from index {0} was dropped./{0} is a number, e.g. 5":"Se soltó el elemento arrastrable del índice {0}.","Draggable item is no longer over a droppable area.":"El elemento arrastrable ya no está sobre un área que se puede colocar.","Dragged item over droppable area at index {0}./{0} is a number, e.g. 5":"Elemento arrastrado sobre el área colocable en el índice {0}.","Dragging was cancelled. Draggable item from index {0} was dropped./{0} is a number, e.g. 5":"El arrastre se ha cancelado. Se soltó el elemento arrastrable del índice {0}.","Drop column: {0}":"Eliminar columna: {0}","Drop columns/'Drop' meaning 'Delete', but we're using the word 'Drop' here because it's a more common term in data science for this type of operation.":"Excluir columnas","Drop columns: {0}":"Eliminar las columnas: {0}","Drop duplicate rows across all columns":"Quitar filas duplicadas en todas las columnas","Drop duplicate rows in column: {0}":"Eliminar las filas duplicadas en la columna: {0}","Drop duplicate rows in columns: {0}":"Eliminar las filas duplicadas en las columnas: {0}","Drop duplicate rows/'Drop' meaning 'Delete', but we're using the word 'Drop' here because it's a more common term in data science for this type of operation.":"Excluir filas duplicadas","Drop missing values/'Drop' meaning 'Delete', but we're using the word 'Drop' here because it's a more common term in data science for this type of operation.":"Quitar valores que faltan","Drop rows with missing data across all columns":"Quitar filas con datos que faltan en todas las columnas","Drop rows with missing data in column: {0}":"Eliminar las filas con datos faltantes en la columna: {0}","Drop rows with missing data in columns: {0}":"Eliminar las filas con datos faltantes en las columnas: {0}","Drop rows with missing values in the targeted columns.":"Quite las filas a las que les faltan valores en las columnas de destino.","Drops duplicate rows. Duplicate rows are identified using the selected columns only.":"Quita las filas duplicadas. Las filas duplicadas se identifican solo con las columnas seleccionadas.","Duplicate rows":"Duplicar filas","Eager Tensor":"Tensor diligente","Edit failed":"Error de edición","Edit loading parameters/Meaning: edit the parameters of the data loading process.":"Editar parámetros de carga","Edit was successful":"La edición se realizó correctamente","Editing":"Edición","Editing previous operation":"Editando la operación anterior","Encode missing values":"Codificar los valores que faltan","End of interactive chart.":"Final del gráfico interactivo.","Ends with":"Termina en","Enter a datetime string/A date time value, or DateTime value, represents a point in time, and it includes both a date and a time.":"Enter a datetime string","Enter an example":"Escriba un ejemplo","Equal to":"Igual a","Equivalent translation for type '{0}' does not exist":"La traducción equivalente para el tipo '{0}' no existe","Error ({originalEditorTitle})":"Error ({originalEditorTitle})","Error details":"Error details","Error: See code panel for details.":"Error: Vea el panel de código para obtener más información.","Examples":"Ejemplos","Excel files":"Archivos de Excel","Executing performance tests":"Ejecución de pruebas de rendimiento","Expected {0} to be a DataFrame, but got: {1}":"Se esperaba que {0} fuera un DataFrame, pero se obtuvo: {1}","Export as file/This localization string is a button label on our toolbar, so please make it as short, simple, and easy to understand as possible.":"Exportar como archivo","Export as...":"Exportar como...","Export code as new Notebook/'Notebook' refers to a computational notebook, such as to a Jupyter Notebook.":"Exportar código como nuevo bloc de notas","Export code back to Notebook and exit/'Notebook' refers to a computational notebook, such as to a Jupyter Notebook.":"Volver a exportar el código a Notebook y salir","Export to notebook/Meaning: to export the code to a computational notebook (such as to a Jupyter Notebook).This localization string is a button label on our toolbar, so please make it as short, simple, and easy to understand as possible.":"Exportar al bloc de notas","Exported code may not be executable since we are working with a variable in local scope.":"Es posible que el código exportado no sea ejecutable, ya que estamos trabajando con una variable en el ámbito local.","Exporting to Parquet format requires the pyarrow package. Would you like to install it?":"La exportación al formato Parquet requiere el paquete pyarrow. ¿Le gustaría instalarlo?","Exporting {formatName} file.../{formatName} is the name of the file format like 'CSV' or 'Parquet'":"Exportando archivo {formatName}...","Failed to derive a program for the given examples.":"No se ha podido derivar un programa para los ejemplos proporcionados.","Failed to execute code on kernel session/'kernel' in the sense 'Jupyter kernel'.":"No se pudo ejecutar el código en la sesión de kernel","Failed to export code: {innerErrorMessage}/'code' meaning computer code.":"No se pudo exportar el código: {innerErrorMessage}","Failed to export data: {innerErrorMessage}":"No se pudieron exportar los datos: {innerErrorMessage}","Failed to fetch file from GitHub. Please note that private repositories are currently not supported./{Locked=\"GitHub\"}":"No se pudo capturar el archivo de GitHub. Tenga en cuenta que actualmente no se admiten repositorios privados.","Failed to install '{packageNamesWithVersions}'.":"No se pudo instalar \"{packageNamesWithVersions}\".","Failed to install '{packageNamesWithVersions}'.\r\n\r\n{errorName}: {errorMessage}":"No se pudo instalar \"{packageNamesWithVersions}\".\r\n\r\n{errorName}: {errorMessage}","Failed to install {packageNamesWithVersions} using the following command: {errorMessage}.":"No se pudieron instalar {packageNamesWithVersions} con el siguiente comando: {errorMessage}.","Failed to install {packageNamesWithVersions} using the following command: {errorMessage}. Install was canceled by user.":"No se pudieron instalar {packageNamesWithVersions} con el siguiente comando: {errorMessage}. El usuario canceló la instalación.","Failed to launch kernel./'kernel' in the sense 'Jupyter kernel'.":"No se pudo iniciar el kernel.","Failed to load data":"Error al cargar datos","Failed to load the data frame: {errorMessage}":"No se pudo cargar el marco de datos: {errorMessage}","Failed to load the data frame: {innerErrorMessage}":"No se pudo cargar el marco de datos: {innerErrorMessage}","Failed to preview operation\r\n\r\n{innerErrorMessage}/'operation' is an operation on a data table.":"No se pudo obtener una vista previa de la operación\r\n\r\n{innerErrorMessage}","Failed to preview operation/'operation' is an operation on a data table.":"No se pudo obtener una vista previa de la operación","Failed to translate the derived program to the target language.":"No se ha podido traducir el programa derivado al idioma de destino.","Failed to update data frame: {innerErrorMessage}":"No se pudo cargar el marco de datos: {innerErrorMessage}","False":"Falso","Fetching kernel specifications/'kernel' in the sense 'Jupyter kernel'.":"Capturando especificaciones del kernel","Fetching kernel version information/'kernel' in the sense 'Jupyter kernel'.":"Capturando información de la versión del kernel","File Type for Export/File type (e.g., CSV or Parquet) to use for exporting data to a file. This is the title of a quick pick dialog.":"Tipo de archivo para exportación","File path":"Ruta de archivo","Fill method":"Método de relleno","Fill missing values":"Rellenar los valores que faltan","Fill missing values in the targeted columns.":"Rellene los valores que faltan en las columnas de destino.","Filter":"Filtrar","Filter order: {0} of {1}/{0} and {1} are both numbers, e.g. Filter order 2 of 5. Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"Orden de filtrado: {0} de {1}","Filter rows based on column: {0}":"Filtrar filas según la columna: {0}","Filter rows based on columns: {0}":"Filtrar filas en función de las columnas: {0}","Filters":"Filtros","Filters ({numberOfFilters})":"Filtros ({numberOfFilters})","Filters rows based on one or more conditions.":"Filtra las filas en función de una o varias condiciones.","Find and replace":"Buscar y reemplazar","First value":"Primer valor","Format":"Formato","Formulas":"Fórmulas","Frequency":"Frecuencia","Gathering diagnostic information":"Recopilando información de diagnóstico","Generating code/'code' meaning computer code.":"Generando código","Getting Jupyter kernel service":"Obteniendo el servicio de kernel de Jupyter","Go to column/Meaning: jump to a certain column in a data table by scrolling the table horizontally until the specified column is in view.This localization string is a button label on our toolbar, so please make it as short, simple, and easy to understand as possible.":"Ir a columna","Greater than":"Mayor que","Greater than or equal to":"Es mayor o igual que","Grid view is limited to cached data. Reload for full preview and full summary information./'Grid view' is a panel that shows a data grid (data table).'summary' as in data summary.":"La vista de cuadrícula se limita a los datos almacenados en caché. Vuelva a cargar para obtener la vista previa completa y la información de resumen completa.","Group by and aggregate/This operation groups the data frame by one or more columns and then performs an aggregation operation on the grouped data. For example, you can group by a column and then count the number of rows in each group. Or you can group by a column and then sum the values in another column for each group.":"Agrupar por y agregar","Group the target columns to perform aggregation operations.":"Agrupe las columnas de destino para realizar operaciones de agregación.","Grouped on column: {0}":"Agrupado en columna: {0}","Grouped on columns: {0}":"Agrupado en columna: {0}","Hide column insights":"Ocultar información de columna","Index of max value":"Índice de valor máximo","Index of min value":"Índice de valor mínimo","Install dependencies":"Instalar dependencias","Install packages/'package' in the software sense, as for example: a Python package like numpy, pandas, or matplotlib":"Instalar paquetes","Install {0}":"Instalar {0}","Install/As a verb.":"Instalar","Installed version/Lists the version of a specific software dependency that is currently installed.":"Versión instalada","Installing Jupyter extension/Meaning: The Visual Studio Code extension called 'Jupyter' is being installed.":"Instalación de la extensión de Jupyter","Installing Python extension (includes Jupyter extension)/Text shown with a progress bar. The Jupyter extension comes bundled with the Python extension, so if you install the Python extension, the installation wait time also includes installing the Jupyter extension.":"Instalación de la extensión de Python (incluye la extensión de Jupyter)","Installing {packageNames}":"Instalando {packageNames}","Interactive chart.":"Gráfico interactivo.","Invalid extension exports":"Exportaciones de extensión no válidas","Is false":"Es falso","Is missing":"Falta","Is not missing":"No falta el elemento","Is true":"Es verdadero","Jupyter connection URL":"Dirección URL de conexión de Jupyter","Jupyter connection token for {baseUrl}":"Token de conexión de Jupyter para {baseUrl}","Jupyter extension is outdated":"La extensión de Jupyter está obsoleta","Keep matching rows/'Keep' in the sense 'Retain' (all rows not matching the filter pattern are deleted), not in the sense of 'Continue'. Matching here denotes rows that are matched by a filter pattern":"Mantener filas coincidentes","Keep matching rows/Meaning: Keep the rows that match the condition (and remove the ones that don't)":"Mantener filas coincidentes","Kernel must be connected first.":"El kernel debe estar conectado primero.","Kurtosis":"Kurtosis","Last value":"Último valor","Less than":"Menor que","Less than or equal to":"Es menor o igual que","Let's get you set up./This starts the process of helping the user to set up the Data Wrangler software and get it working in their computer, including installing any necessary dependencies.":"Vamos a prepararle.","List":"Lista","Load an existing variable into Data Wrangler.":"Cargue una variable existente en Data Wrangler.","Load data from CSV":"Cargar datos desde CSV","Load data from Excel":"Cargar datos de Excel","Load data from Parquet":"Carga de datos desde Parquet","Load data from variable":"Cargar datos de la variable","Loaded variable '{0}' from URI: {1}":"Se ha cargado la variable \"{0}\" del URI: {1}","Loaded variable '{0}' from kernel state":"Variable cargada \"{0}\" del estado del Kernel","Loaded with truncation: {rowCount} rows/'truncation' meaning that only the first {rowCount} rows of the data table were loaded. Not all the data was loaded.":"Cargado con truncamiento: {rowCount} filas","Loaded {0} rows":"Se cargaron {0} filas","Loading data frame":"Cargando marco de datos","Loading data with truncation.../'truncation' meaning that only the first n rows of the data table will be loaded. Not all the data will be loaded.":"Cargando datos con truncamiento...","Loading data...":"Cargando datos...","Loading...":"Cargando...","Loads data from a CSV or other delimited file.":"Carga datos de un archivo CSV u otro archivo delimitado.","Loads data from a Parquet file.":"Carga datos de un archivo Parquet.","Loads data from an Excel (XLS, XLSX) file.":"Carga datos desde un archivo de Excel (XLS, XLSX).","Manage all filters/Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"Administrar todos los filtros","Manage all sorts/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Administrar todas las ordenaciones","Manage filters/'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"Administrar filtros","Manage sorts/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Administrar ordenaciones","Match case":"Coincidencia de mayúsculas y minúsculas","Match full string":"Coincidencia de cadena completa","Max/Short form of 'Maximum'. Indicates the biggest value in a data column.":"Max","Maximum":"Máximo","Mean/Statistics term.":"Medio","Median":"Valor medio","Min/Short form of 'Minimum'. Indicates the smallest value in a data column.":"Mín","Minimum":"Mínimo","Minimum value must be smaller than maximum value.":"El valor mínimo debe ser menor que el valor máximo.","Minimum version/Lists the minimum version of a specific software package dependency that will be compatible with the program. That version and any higher (later) version will work with the program.":"Versión mínima","Missing dependencies/Status message that very succinctly conveys the meaning 'There are missing Python package dependencies in the kernel' with the implication that the user can't proceed with using the extension until the required dependencies are installed. This text will sometimes be followed by the actual list of dependencies that are missing.":"Dependencias faltantes","Missing required parameters":"Faltan parámetros obligatorios","Missing value/Placeholder text for a cell value that is missing (i.e., set to null, None, NaN, or equivalent) within a data table.":"Falta el valor","Missing values (by column)":"Faltan valores (por columna)","Missing values first/Meaning: When sorting rows of data, move the rows that are empty to the top.":"Valores que faltan primero","Missing values first/Note that this is used in the context of ordering data, we put the missing entries at the top.":"Valores que faltan primero","Missing values first/When this toggle is on, the sorting operation will place missing values at the top of the sorted list, before non-missing values.":"Valores que faltan primero","Missing values/Count of values that are missing (i.e., set to null, None, NaN, or equivalent) in a data column.":"Valores faltantes","Missing/Label for the count of values that are missing (i.e., set to null, None, NaN, or equivalent) in a data column.":"Ausente","Mixed columns are not allowed for this operation":"No se permiten columnas mixtas para esta operación","Mode/Statistics term":"Modo","Mode/Statistics term.":"Modo","Modified column {0} using formula":"Columna {0} modificada mediante la fórmula","Modify":"Modificar","More details":"Más detalles","More items":"More items","More options":"Más opciones","More options...":"Más opciones...","Most common value":"Valor más común","Most frequent value/The value that appears the most often in a data column.":"Valor más frecuente","Move down in order":"Bajar en orden","Move up in order":"Subir en orden","Moved draggable item from index {0} to {1}./e.g. Moved draggable item from index 2 to 5.":"Se seleccionó un elemento arrastrable del índice {0} a {1}.","Multi-label binarizer/Terminology from the field of Machine Learning. An operation that transforms a data column into binary values using a multi-label format. This format uses a series of 1s and 0s as labels to represent the presence or absense of each of several categories in the input.":"Binarizador de varias etiquetas","Multi-label encode column {0} using delimiter {1}":"La columna de codificación de varias etiquetas {0} con el delimitador {1}","Multi-label encode columns {0} using delimiter {1}":"Las columnas de codificación de varias etiquetas {0} con el delimitador {1}","N-Dimensional Array":"Matriz N-Dimensional","N/A/'N/A' = 'Not Applicable'. This is shown inside a table cell, so, if there's no equivalent to 'N/A' in the target language, feel free to use a dash (or equivalent) to indicate that there is no value in this cell.":"N/A","Name for new column":"Nombre para una columna nueva","New column by example/This is the name of a data operation where the user provides examples of the output of a data operation, and the program infers what the operation is and applies it, creating a new column with the output.":"Nueva columna por ejemplo","New column name":"Nuevo nombre de columna","New maximum":"Nuevo máximo","New minimum":"Nuevo mínimo","New operation":"Nueva operación","New type":"Nuevo tipo","New value/The user fills in fields 'Old value' and 'New value' when doing a Find and Replace operation.":"Nuevo valor","No Jupyter connection URL received/Connecting to Jupyter requires a connection URL, which was not provided by the user":"No se recibió ninguna dirección URL de conexión de Jupyter","No Jupyter connection token received/Connecting to Jupyter requires a connection token, which was not provided by the user":"No se recibió ningún token de conexión de Jupyter","No active engine/Note that 'engine' here is referring to a code execution environment such as Pandas or PySpark.":"No hay ningún motor activo","No active filter/Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"No hay ningún filtro activo","No aggregations":"Sin agregaciones","No code exporter found":"No se encontró ningún exportador de código","No compatible Python interpreter found.":"No se encontró ningún intérprete de Python compatible.","No connection method selected":"No se ha seleccionado ningún método de conexión","No data exporter found":"No se encontró ningún exportador de datos","No engine available for translation/Note that 'engine' here is referring to a code execution environment such as Pandas or PySpark.":"No hay ningún motor disponible para la traducción","No filters":"No hay ningún filtro","No groups":"No hay grupos","No information for this package was found. Ensure the package name is correct before installing.":"No se encontró información para este paquete. Asegúrese de que el nombre del paquete es correcto antes de la instalación.","No kernel session":"No kernel session","No kernel specs selected/'kernel' in the sense 'Jupyter kernel'.'specs' as short for 'specifications'.":"No se han seleccionado especificaciones del kernel","No missing values":"No faltan valores","No pattern detected from inputs.":"No se detectó ningún patrón en las entradas.","No runtime connected":"No hay ningún entorno de ejecución conectado","No sorts/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Sin ordenaciones","No translation available.":"No hay traducción disponible.","No variables found. Execute a code cell to create data variables.":"No se encontraron variables. Ejecute una celda de código para crear variables de datos.","No visualization available":"No hay visualización disponible","No, thanks/This is a possible response to the question \"Can you please take a minute to tell us about your experience with Data Wrangler in VS Code?\"":"No, gracias","No/Response to the question: 'Exporting to Parquet format requires the pyarrow package. Would you like to install it?'":"No","No/This is a possible answer to the question \"Would you like to install the VS Code extension(s)?\"":"No","No/This is a possible answer to the question 'Would you like to set up the installer?'":"No","No/This is a possible response to the question \"Would you like to install the .NET Installer extension to continue?\"":"No","Not equal to":"Distinto de","Note: The code below is Data Wrangler internal code.":"Nota: el código siguiente es Data Wrangler código interno.","Number of decimals":"Número de decimales","Number of digits must be a whole number.":"El número de dígitos debe ser un número entero.","Number of distinct values/Count of values that are different from each other in a data column.":"Número de valores distintos","Number of rows to keep":"Número de filas que se conservarán","Numeric":"Numérico","Old value must be non-empty.":"El valor anterior no debe estar vacío.","Old value/The user fills in fields 'Old value' and 'New value' when doing a Find and Replace operation.":"Valor anterior","One-hot encode column: {0}/'one-hot encoding' is a technical term used in the field of Machine Learning":"Columna de codificación de acceso único: {0}","One-hot encode columns: {0}/'one-hot encoding' is a technical term used in the field of Machine Learning":"Columnas de codificación de acceso único: {0}","One-hot encode/'one-hot encoding' is a technical term used in the field of Machine Learning":"Codificación de acceso único","Only the most recent operation can be edited.":"Solo se puede editar la operación más reciente.","Only viewing is supported when debugging.":"Solo se admite la visualización al depurar.","Open '{variableName}' in Data Wrangler":"Abrir \"{variableName}\" en Data Wrangler","Open Python download website/'Python download website' in the sense: the website where the users can download Python, so that they can install it on their computers.":"Abrir sitio web de descarga de Python","Open time picker":"Open time picker","Open variable in Data Wrangler":"Abrir variable en Data Wrangler","Opening a dataset from a file is currently not supported in the web offering of Data Wrangler.":"La apertura de un conjunto de datos desde un archivo no se admite actualmente en la oferta web de Data Wrangler.","Opening files directly in Data Wrangler has limited support in the web version of Visual Studio Code. The desktop version is recommended for the best experience.":"La apertura de archivos directamente en Data Wrangler tiene compatibilidad limitada con la versión web de Visual Studio Code. Se recomienda usar la versión de escritorio para disfrutar de la mejor experiencia.","Operation applied: {operationDescription}/'operation' is an operation on a data table.":"Operación aplicada: {operationDescription}","Operation preview: {operationDescription}/'operation' is an operation on a data table.":"Vista previa de la operación: {operationDescription}","Operation rejected: {operationDescription}/'operation' is an operation on a data table.":"Operación rechazada: {operationDescription}","Operation undone: {operationDescription}/'operation' is an operation on a data table.":"Operación deshecha: {operationDescription}","Operations/It refers to operations on a data table, like sorting, filtering, deleting a column, filling in missing values, etc.":"Operaciones","Option is invalid for the selected column.":"La opción no es válida para la columna seleccionada.","Or":"O","Or, start typing code to see a live preview of the transformation on your data <ex>(e.g., <code>{exampleCode}</code>)</ex>/{Locked=\"<ex>\"}{Locked=\"</ex>\"}{Locked=\"<code>\"}{Locked=\"</code>\"}":"O bien empiece a escribir código para ver una vista previa en directo de la transformación en los datos <ex>(e.g., <code>{exampleCode}</code>)</ex>","Other":"Otros","Other/category 'Other' in a dropdown list of data operation categories":"Otro","Output/'Output' as a noun, like the output of a function or algorithm.":"Salida","Package name/'package' in the software sense, as for example: a Python package like numpy, pandas, or matplotlib":"Nombre del paquete","Paused.":"En pausa.","Perform advanced filter/Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"Realizar filtro avanzado","Perform some operations on the data first./This precondition must be met before the user is allowed to perform the action he or she is trying to do.":"Realice primero algunas operaciones en los datos.","Performed {0} grouped on column: {1}":"Se ha realizado {0} agrupada en la columna: {1}","Performed {0} grouped on columns: {1}":"Se ha realizado {0} agrupados en columnas: {1}","Picked up draggable item from index {0}./{0} is a number, e.g. 5":"Se seleccionó un elemento arrastrable del índice {0}.","Please install Python to continue. Note: Data Wrangler requires Python {minPythonVersion} or above.":"Instale Python para continuar. Nota: Data Wrangler requiere Python {minPythonVersion} o superior.","Please note/This is the title of a notification message box":"Tenga en cuenta","Preparing":"Preparando","Preview code for all steps":"Vista previa del código en todos los pasos","Preview columns cannot be targeted/'Preview' refers to a data column that has pending but yet-to-be confirmed changes.":"Las columnas de vista previa no pueden ser destino","Preview paused":"Vista previa en pausa","Previewing all code steps":"Vista previa de todos los pasos de código","Previewing/Status message that indicates that the program is currently showing a preview of the data.":"Mostrando vista previa","Product of all values":"Producto de todos los valores","Propagate backward/Fill in missing values going backwards through the list, filling in with the previous non-missing value that was seen. e.g. [1, NaN, NaN, 2] becomes [1, 2, 2, 2]":"Propagar hacia atrás","Propagate forward/Fill in missing values based on the previous available value and propagating it forwards. e.g. [1, NaN, NaN, 2] becomes [1, 1, 1, 2]":"Propagar hacia delante","Providing an edit for this cell can improve results":"Al proporcionar una edición para esta celda, puede mejorar los resultados","Python {minPythonVersion} or higher is required. Detected version: {kernelVersion}":"Se requiere Python {minPythonVersion} o superior. Versión detectada: {kernelVersion}","Quit":"Salir","RPC connection not initialized/RPC = Remote Procedure Call":"Conexión RPC no inicializada","Re-check/Meaning: check again whether a certain software dependency is now available or not yet.":"Volver a comprobar","Re-loading data frame":"Recargando marco de datos","Received invalid notebook URI from Jupyter extension. This likely means that the Data Wrangler extension is not compatible with the Jupyter extension. Please file an issue on the Data Wrangler GitHub repository.":"Se recibió un URI de cuaderno no válido de la extensión de Jupyter. Probablemente, esto significa que la extensión Data Wrangler no es compatible con la extensión de Jupyter. Envíe un problema en el repositorio de GitHub de Data Wrangler.","Received malformed content: {0}":"Contenido con formato incorrecto recibido: {0}","Refresh data/This localization string is a button label on our toolbar, so please make it as short, simple, and easy to understand as possible.":"Actualizar datos","Reload VS Code":"Reload VS Code","Reload preview":"Volver a cargar vista previa","Remove leading and trailing whitespace in column: {0}":"Quitar los espacios en blanco iniciales y finales de la columna: {0}","Remove leading and trailing whitespace in columns: {0}":"Quitar los espacios en blanco iniciales y finales de las columnas: {0}","Remove leading whitespace":"Quitar espacio en blanco inicial","Remove leading whitespace in column: {0}":"Quitar espacio en blanco inicial en la columna: {0}","Remove leading whitespace in columns: {0}":"Quite el espacio en blanco inicial en las columnas: {0}","Remove sort/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Quitar ordenación","Remove trailing whitespace":"Quitar espacio en blanco final","Remove trailing whitespace in column: {0}":"Quitar espacio en blanco final en la columna: {0}","Remove trailing whitespace in columns: {0}":"Quitar espacio en blanco final en columnas: {0}","Removes leading and trailing whitespace in a text column.":"Quita los espacios en blanco iniciales y finales de una columna de texto.","Removes the targeted columns from the data frame.":"Quita las columnas de destino de la trama de datos.","Removing matching rows":"Quitando filas coincidentes","Rename column":"Cambiar nombre de columna","Rename column {0} to {1}":"Cambiar el nombre de la columna {0} a {1}","Replace all instances of {1} with {2} in column: {0}/Find all occurrences of string {1} in data column {0} and replace them with string {2}":"Reemplazar todas las instancias de {1} con {2} en la columna: {0}","Replace all instances of {1} with {2} in columns: {0}/Find all occurrences of string {1} in data columns {0} and replace them with string {2}":"Reemplazar todas las instancias de {1} con {2} en las columnas: {0}","Replace gaps back from the next valid value in: {0}":"Reemplazar intervalos respecto al siguiente valor válido en: {0}","Replace gaps forward from the previous valid value in: {0}":"Reemplazar intervalos hacia delante desde el valor válido anterior en: {0}","Replace missing values with the mean of each column in: {0}":"Reemplazar los valores que faltan por la media de cada columna en: {0}","Replace missing values with the median of each column in: {0}":"Reemplazar los valores que faltan por la mediana de cada columna en: {0}","Replace missing values with the mode of each column in: {0}/'mode' as a statistics term.":"Reemplazar los valores que faltan por la moda de cada columna en: {0}","Replace missing values with the most common value of each column in: {0}":"Reemplazar los valores que faltan por el valor más común de cada columna en: {0}","Replace missing values with {1} in column: {0}":"Reemplazar los valores que faltan con {1}en la columna: {0}","Replace missing values with {1} in columns: {0}":"Reemplazar los valores que faltan con {1} en las columnas: {0}","Replacement for missing values":"Sustitución de los valores que faltan","Replaces all occurrences of an old value with a new value.":"Reemplaza todas las apariciones de un valor antiguo por un nuevo valor.","Report an issue/Meaning: report an issue, bug, error, etc. that the user found with our software.This localization string is a button label on our toolbar, so please make it as short, simple, and easy to understand as possible.":"Informar de un problema","Required debug API is not available in this version of VS Code. Debugging support will be disabled for Data Wrangler./{Locked=\"VS Code\"}":"La API de depuración necesaria no está disponible en esta versión de VS Code. La compatibilidad con la depuración se deshabilitará para Data Wrangler.","Return to current step":"Volver al paso actual","Round column {0} (Number of decimals: {1})":"Redondear columna {0} (número de decimales: {1})","Round columns {0} (Number of decimals: {1})":"Redondear columnas {0} (número de decimales: {1})","Round down (floor)/'floor' and 'ceiling' are programming terms for rounding down and rounding up, respectively.":"Redondear hacia abajo (suelo)","Round down column {0}":"Redondear columna hacia abajo {0}","Round down columns {0}":"Redondear columnas hacia abajo {0}","Round up (ceiling)/'floor' and 'ceiling' are programming terms for rounding down and rounding up, respectively.":"Redondear hacia arriba (techo)","Round up column {0}":"Redondear columna hacia arriba {0}","Round up columns {0}":"Redondear columnas hacia arriba {0}","Round/'Round' as a verb in the mathematical sense.":"Redondear","Rounds numbers down to the nearest integer.":"Redondea hacia abajo los números al entero más próximo.","Rounds numbers to the specified number of decimal places.":"Redondea los números al número especificado de decimales.","Rounds numbers up to the nearest integer./The verb here is 'to round up'. Not just 'to round'.":"Redondea hacia arriba los números al entero más próximo.","Rows":"Filas","Rows with missing values":"Filas con valores que faltan","Scale by min/max values/'scale' in the mathematical sense. The numbers will be scaled such that their new minimum and maximum values will be the ones specified by the user.":"Escala por valores mín./máx.","Scale column {0} between {1} and {2}":"Columna de escala {0} entre {1} y {2}","Scale columns {0} between {1} and {2}":"Columnas de escala {0} entre {1} y {2}","Scales all numerical values in the targeted columns between a new minimum and maximum value.":"Escala todos los valores numéricos de las columnas de destino entre un nuevo valor mínimo y máximo.","Schema/'Schema' meaning the structure of a data table. For example, the columns and their data types.":"Esquema","Search for operations...":"Buscar operaciones...","See {linkStart}documentation{linkEnd} for how to create a new local kernel.":"Consulte {linkStart}documentación{linkEnd} para obtener información sobre cómo crear un nuevo kernel local.","Select a condition":"Seleccionar una condición","Select a file type/File type (e.g., CSV or Parquet).":"Seleccionar un tipo de archivo","Select a runtime":"Seleccionar un runtime","Select a variable to open in Data Wrangler./The user is shown a list of names of variables (variables in the computer programming sense), each one containing a data table. The user is being asked to choose one of those variables so as to open the corresponding data table in Data Wrangler.":"Seleccione una variable para abrirla en Data Wrangler.","Select all":"Seleccionar todo","Select column: {0}":"Seleccionar columna: {0}","Select columns/Here, we mean keep the selected columns and drop all others. We chose the word 'Select' for the English string because that's the term that is often used when working with databases and data tables.":"Seleccionar columnas","Select columns: {0}":"Seleccionar columnas: {0}","Select kernel for '{filePath}'/'kernel' in the sense 'Jupyter kernel'.":"Seleccionar kernel para \"{filePath}\"","Select one or more target columns.../'column' as in a column of a data table":"Seleccione una o varias columnas de destino...","Selecting runtime":"Selección del tiempo de ejecución","Selects the targeted columns from the data frame and drops all others.":"Selecciona las columnas de destino de la trama de datos y quita todas las demás.","Series (Pandas)":"Serie (Pandas)","Series (Polars)":"Serie (polares)","Setting up {installerName}":"Configurando {installerName}","Sheet number":"Número de hoja","Show column insights":"Mostrar información de columna","Show more details":"Mostrar más detalles","Showing code":"Mostrando código","Skew/'Skew' as a noun. Also known as 'Skewness'. Statistics term.":"Sesgar","Skew/Statistics term. 'Skew' as a noun. Also known as 'Skewness'.":"Sesgar","Skewness is biased in PySpark and may yield slightly different results./'Skewness' is a Statistics term. Also known as 'skew'":"La asimetría está sesgada en PySpark y puede producir resultados ligeramente diferentes.","Some operations were translated with warnings. Please see the generated code comments to see the warning messages./The program tried to translate computer code, which corresponds to operations on a data table, from one programming language to another. Some of the operations were able to be translated, but with warnings or caveats about the translated code. The translated version of the code includes some code comments with these warning messages.":"Algunas operaciones se han traducido con advertencias. Vea los comentarios de código generados para ver los mensajes de advertencia.","Sort and filter/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Ordenar y filtrar","Sort ascending/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Orden ascendente","Sort by column: {0}/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Ordenar por columna: {0}","Sort by columns: {0}/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Ordenar por columnas: {0}","Sort descending/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Orden descendente","Sort order/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Criterio de ordenación","Sort order: {0} of {1}/{0} and {1} are both numbers, e.g. Sort order 2 of 5. Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Criterio de ordenación: {0} de {1}","Sort the data according to one or more columns.":"Ordene los datos según una o más columnas.","Sort values/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Ordenar valores","Sorts ({numberOfSorts})/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Ordenaciones ({numberOfSorts})","Sorts/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Ordenaciones","Source":"Origen","Specify the URL, port, and token to connect to a Jupyter server.":"Especifique la dirección URL, el puerto y el token para conectarse a un servidor de Jupyter.","Specify the local Python interpreter used to run a kernel.":"Especifique el intérprete de Python local que se usa para ejecutar un kernel.","Split categorical data into a new column for each category using a text split delimiter, where each new column contains a 1 in rows that match that category, and 0 otherwise.":"Divida los datos de categorías en una nueva columna para cada categoría mediante un delimitador de división de texto, donde cada nueva columna contiene un 1 en las filas que coinciden con esa categoría, y 0 de lo contrario.","Split categorical data into a new column for each category, where each new column contains a 1 in rows that match that category, and 0 otherwise.":"Divida los datos de categorías en una nueva columna para cada categoría, donde cada nueva columna contiene un 1 en las filas que coinciden con esa categoría, y 0 de lo contrario.","Split text":"Dividir texto","Split text using regex '{0}' in column: {1}":"Dividir texto con regex \"{0}\" en la columna: {1}","Split text using regex '{0}' in columns: {1}":"Dividir texto con regex \"{0}\" en columnas: {1}","Split text using string '{0}' in column: {1}":"Dividir texto con la cadena \"{0}\" en la columna: {1}","Split text using string '{0}' in columns: {1}":"Dividir texto mediante la cadena \"{0}\" en columnas: {1}","Splits a text column into several columns based on the input value.":"Divide una columna de texto en varias columnas en función del valor de entrada.","Standard deviation":"Desviación estándar","Standard error of the mean":"Error estándar de la media","Starting new Jupyter session":"Iniciando nueva sesión de Jupyter","Starts with":"Comienza con","Statistics":"Estadísticas","Statistics, visualizations, and operations will be performed on the truncated data only, and could be inaccurate. Do you want to truncate?/To 'Truncate' data table here means to only load the first n rows, instead of the entire table.":"Las estadísticas, las visualizaciones y las operaciones se realizarán solo en los datos truncados y podrían ser inexactos. ¿Desea truncar?","Statistics/This is meant as the plural of 'statistic' (definition: 'a numerical fact or datum, especially one computed from a sample'). Namely, statistics such as the mean, median, average, min, max of a set of numbers. It is NOT meant as Statistics, the name of the field of study.":"Estadísticas","Step {0} of {1}":"Paso {0} de {1}","String transform by example":"Transformación de cadena por ejemplo","Strip whitespace/This operation removes whitespace from the beginning and/or end of each string of text. e.g. '  hello world  ' becomes 'hello world'":"Eliminar espacio en blanco","Sum":"Suma","TIP: The selected runtime will be used for future launches. Note that if Data Wrangler is launched from a Jupyter Notebook, then the current notebook kernel will be used as the runtime by default.":"SUGERENCIA: El entorno de ejecución seleccionado se usará en futuros lanzamientos. Tenga en cuenta que si Data Wrangler se inicia desde una instancia de Jupyter Notebook, el kernel del cuaderno actual se usará como entorno de ejecución de forma predeterminada.","Taking too long to load? You can <a>truncate the data</a> to work with a smaller sample./{Locked=\"<a>\"}{Locked=\"</a>\"}To 'Truncate' a data table here means to only load the first n rows, instead of the entire table.":"¿Tarda demasiado en cargarse? Puede <a>truncar los datos</a> para trabajar con un ejemplo más pequeño.","Target column":"Columna de destino","Target columns":"Columnas de destino","Tensor":"Tensor","The base URL of the Jupyter connection host (e.g., http://localhost:8888)/{Locked=\"http://localhost:8888\"}":"Dirección URL base del host de conexión de Jupyter (por ejemplo, http://localhost:8888)","The chart has 1 X axis displaying {0}. {1}/{0} will be replaced with a label for the axis (above), and {1} will be replaced with the data range (below).":"El gráfico tiene un eje X que muestra {0}. {1}","The chart has 1 Y axis displaying {0}. {1}":"El gráfico tiene un eje Y que {0}muestra . {1}","The median in PySpark is approximated for performance reasons.":"La mediana de PySpark es aproximada por motivos de rendimiento.","The minimum required version of the following dependencies couldn't be installed: {dependenciesList}":"No se pudo instalar la versión mínima necesaria de las siguientes dependencias: {dependenciesList}","The operation field is disabled.":"El campo de operación está deshabilitado.","The token to use for the Jupyter connection":"Token que se va a usar para la conexión de Jupyter.","This data type is not fully supported and will have limited statistics and operations. Please consider changing the column type.":"Este tipo de datos no es totalmente compatible y tendrá estadísticas y operaciones limitadas. Considere la posibilidad de cambiar el tipo de columna.","This feature depends on the Jupyter and Python extensions for Visual Studio Code. Would you like to install both extensions?/\"Jupyter\" and \"Python\" are the names of the extensions.":"Esta característica depende de las extensiones de Jupyter y Python para Visual Studio Code. ¿Desea instalar ambas extensiones?","This feature depends on the Jupyter extension for Visual Studio Code. Would you like to install it?/\"Jupyter\" is the name of the extension.":"Esta característica depende de la extensión de Jupyter para Visual Studio Code. ¿Desea instalarlo?","This feature depends on the Python extension for Visual Studio Code. Would you like to install it?/\"Python\" is the name of the extension.":"Esta característica depende de la extensión de Python para Visual Studio Code. ¿Le gustaría instalarlo?","This feature depends on version {minVersion} or greater of the Jupyter extension for Visual Studio Code. Please update the extension before trying again./The extension is called \"Jupyter\".":"Esta característica depende de la versión {minVersion} o posterior de la extensión de Jupyter para Visual Studio Code. Actualice la extensión antes de intentarlo de nuevo.","This feature requires .NET. Would you like to install the .NET Installer extension to continue?":"Esta característica requiere .NET. ¿Desea instalar la extensión del instalador de .NET para continuar?","This is taking longer than usual...":"Esto está tardando más de lo habitual...","This operation cannot be performed on a non-editable step":"Esta operación no se puede realizar en un paso no editable","This operation cannot be performed on the first step":"Esta operación no se puede realizar en el primer paso","This operation does not support multiple columns":"Esta operación no admite varias columnas","This step is complete":"Este paso se ha completado","This step is incomplete":"Este paso está incompleto","This was generated to match the original {0} logic but may have performance issues.":"Esto se generó para que coincida con la lógica de {0} original, pero puede tener problemas de rendimiento.","Timed out while discovering kernels/'kernel' in the sense 'Jupyter kernel'.":"Se agotó el tiempo de espera al detectar kernels","Timed out while trying to derive a program.":"Se ha agotado el tiempo de espera al intentar derivar un programa.","To export or modify your current code changes, you can switch back into the editing mode of Data Wrangler at any time./This is an informational message and not an immediate instruction.":"Para exportar o modificar los cambios de código actuales, puede volver al modo de edición de Data Wrangler en cualquier momento.","To use that command, you need to have a supported file open.":"Para usar ese comando, debe tener abierto un archivo compatible.","Transform based on the following examples/Meaning: transform a data set into another according to the examples shown below.":"Transformación basada en los siguientes ejemplos","True":"Verdadero","Truncate/To 'Truncate' a data table here means to only load the first n rows, instead of the entire table.":"Truncar","Truncated to {0} rows/Meaning that the data table was cut in size to only contain the first {0} rows.":"Truncado para {0} filas","Truncation enabled: {rowCount} rows/'truncation' meaning that only the first {rowCount} rows of a data table will be loaded. Not all the data will be loaded.":"Truncamiento habilitado: {rowCount} filas","Try again":"Volver a intentarlo","Type '{0}' is currently an unsupported type":"El tipo \"{0}\" es actualmente un tipo no admitido","Type '{0}' is not allowed for this operation":"No se permite el tipo \"{0}\" para esta operación","Uncaught error":"Error no detectado","Undoing operation/'operation' in the sense: an operation on a data table.":"Deshacer operación","Unknown error":"Error desconocido","Unknown kernel":"Kernel desconocido","Unknown runtime":"Tiempo de ejecución desconocido","Unknown/This localization string is used in a context like: 'Environment type: Unknown'":"Desconocido","Update/This is a button label. 'Update' meaning: save an edited field. NOT in the sense of update software.":"Actualizar","Updating preview":"Actualizando vista previa","Use custom code to modify the dataframe. Note that `{0}` will be the variable for both the input and output of your code. You may modify the data frame directly or use `{0} = ...`":"Utilice el código personalizado para modificar el marco de datos. Tenga en cuenta que \"{0}\" será la variable tanto de entrada como de salida de su código. Puede modificar el marco de datos directamente o utilizar \"{0} = ...\".","Use regular expression":"Usar expresión regular","Value":"Valor","Value counts":"Recuentos de valores","Value histogram":"Histograma de valores","Variance":"Varianza","View column filter settings/Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"Ver la configuración del filtro de columna","View column sort settings/Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"Ver configuración de ordenación de columnas","View extension/This button opens up the extension's page in the Visual Studio Code extension marketplace":"Ver extensión","View the data and apply sorts and filters/'sorts' refers to data sorting (ordering) operations like sort ascending and sort descending. It does NOT mean classifications or types.":"Ver los datos y aplicar ordenaciones y filtros","Viewing":"Visualización","Waiting for .NET process to initialize. This may take a while...":"Esperando a que se inicialice el proceso de .NET. Esto puede tardar un rato...","Waiting for variables from notebook kernel/'kernel' in the sense 'Jupyter kernel'.":"Esperando variables del kernel del bloc de notas","Warning":"Advertencia","Welcome to Data Wrangler":"Bienvenido a Data Wrangler","Work with truncated data?/To work with truncated data here means to only load and work with the first n rows of the data table, instead of the entire table.":"¿Trabajar con datos truncados?","Would you like to make Data Wrangler the default editor for .{fileExtension} files?/{fileExtension} is a file extension, like 'csv' or 'json'. That's why there's a period before it in the localization string.":"¿Desea convertir Data Wrangler en el editor predeterminado para archivos .{fileExtension}?","Yes (workspace)/This is a possible answer to the question \"Would you like to make Data Wrangler the default editor?\"":"Sí (área de trabajo)","Yes, take survey now/This is a possible response to the question \"Can you please take a minute to tell us about your experience with Data Wrangler in VS Code?\"":"Sí, realizar una encuesta ahora","Yes/Response to the question: 'Exporting to Parquet format requires the pyarrow package. Would you like to install it?'":"Sí","Yes/This is a possible answer to the question \"Do you want Data Wrangler to open in editing mode by default?\"":"Sí","Yes/This is a possible answer to the question \"Would you like to install the VS Code extension(s)?\"":"Sí","Yes/This is a possible answer to the question \"Would you like to make Data Wrangler the default editor?\"":"Sí","Yes/This is a possible answer to the question 'Would you like to set up the installer?'":"Sí","Yes/This is a possible response to the question \"Would you like to install the .NET Installer extension to continue?\"":"Sí","You have unselected \"Keep matching rows\" in the filter settings. Rows matching the filter condition will be excluded./Meaning of 'Keep matching rows': Keep the rows that match the condition (and remove the ones that don't)":"Ha anulado la selección de \"Mantener filas coincidentes\" en la configuración del filtro. Se excluirán las filas que coincidan con la condición del filtro.","all/Context: 'Number of rows to keep: all'":"todo","launching":"iniciando","{0} (ascending)":"{0} (ascendente)","{0} (descending)":"{0} (descendente)","{0} (mixed)":"{0} (mixto)","{0} FILTERS/{0} is an integer. 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"{0} FILTROS","{0} SORTS/{0} is an integer. Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"{0} ORDENACIONES","{0} aggregations":"{0} agregaciones","{0} aggregations/{0} is a number, e.g. 5":"{0} agregaciones","{0} column":"{0} columna","{0} columns":"{0} columnas","{0} conditions/{0} is an integer. Note that 'filter' is referring to a filter (removal of data based on conditions) applied to a column.":"{0} condiciones","{0} filters with {1} conditions/Both {0} and {1} are numbers, e.g. 5":"{0} filtros con {1} condiciones","{0} filters/{0} is a number, e.g. 5":"{0} filtros","{0} groups with {1} sub-groups":"{0} grupos con {1} sub grupos","{0} groups/{0} is a number, e.g. 5":"{0} grupos","{0} is not a supported engine for derived columns.":"{0} no es un motor compatible con columnas derivadas.","{0} is not a valid date time value./A date time value, or DateTime value, represents a point in time, and it includes both a date and a time.":"{0} no es una fecha u hora válida.","{0} row":"{0} fila","{0} rows":"{0} filas","{0} sorts/{0} is a number, e.g. 5. Note that 'sort' is referring to a sort (ordering of data) applied to a column. It does not mean 'classification' or 'kind'.":"{0} ordenaciones","{0} ȁ {1}":"{0} ȁ {1}","{0}%":"{0} %","{0}, bar series {1} of {2} with 1 bar./{0} will be replaced with the name of the data series. The other placeholders will be replaced with numbers.":"{0}, serie {1} de barras de {2} con 1 barra.","{0}, bar series {1} of {2} with {3} bars.":"{0}, serie {1} de barras de {2} con {3} barras.","{0}, {1} and {2} other columns":"{0}, {1} y {2} otras columnas","{0}. Interactive chart./{0} will be replaced with the title of the chart.":"{0}. Gráfico interactivo.","{EnvironmentType} Env/{EnvironmentType} refers to a Python environment type, e.g., 'Conda' or 'Pyenv''Env' is short for 'Environment'":"{EnvironmentType} Env","{dataType} (mixed)/'mixed' is referring to a data column having different types of data":"{dataType} (mixto)","{missingDependencyCount} missing packages are required to run Data Wrangler in the selected runtime/'package' in the software sense, as for example: a Python package like numpy, pandas, or matplotlib":"Faltan {missingDependencyCount} paquetes necesarios para ejecutar Data Wrangler en el runtime seleccionado","{rowCount} rows x {columnCount} columns":"{rowCount} filas x {columnCount} columnas"}
